camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************
;***** Created: 2015-03-13 15:19 ******* Source: ATA5702M322_internal.xml 
;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;* 
;* Number            : AVR000
;* File Name         : "ATA5702M322_internaldef.inc"
;* Title             : Register/Bit Definitions for the ATA5702M322
;* Date              : 2015-03-13
;* Version           : 2.25
;* Support E-mail    : avr@atmel.com
;* Target MCU        : ATA5702M322
;* 
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register 
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and 
;* Z have been assigned names XL - ZH. Highest RAM address for Internal 
;* SRAM is also defined 
;* 
;* The Register names are represented by their hexadecimal address.
;* 
;* The Register Bit names are represented by their bit number (0-7).
;* 
;* Please observe the difference in using the bit names with instructions
;* such as "sbr"/"cbr" (set/clear bit in register) and "sbrs"/"sbrc"
;* (skip if bit in register set/cleared). The following example illustrates
;* this:
;* 
;* in    r16,PORTB             ;read PORTB latch
;* sbr   r16,(1<<PB6)+(1<<PB5) ;set PB6 and PB5 (use masks, not bit#)
;* out   PORTB,r16             ;output to PORTB
;* 
;* in    r16,TIFR              ;read the Timer Interrupt Flag Register
;* sbrc  r16,TOV0              ;test the overflow flag (use bit#)
;* rjmp  TOV0_is_set           ;jump if set
;* ...                         ;otherwise do something else
;*************************************************************************
#ifndef _REGDEF_INC_
#define _REGDEF_INC_
; ***** SPECIFY DEVICE ***************************************************
;.device ATA5702M322
SIGNATURE_000       EQU 0x1e
SIGNATURE_001       EQU 0x95
SIGNATURE_002       EQU 0x69
; ***** I/O REGISTER DEFINITIONS *****************************************
; NOTE:
; Definitions marked "MEMORY MAPPED"are extended I/O ports
; and cannot be used with IN/OUT instructions
GPIOR0       EQU 0x00
PRR1       EQU 0x01
PRR2       EQU 0x02
PINB       EQU 0x03
DDRB       EQU 0x04
PORTB       EQU 0x05
PINC       EQU 0x06
DDRC       EQU 0x07
PORTC       EQU 0x08
PIND       EQU 0x09
DDRD       EQU 0x0a
PORTD       EQU 0x0b
TPCR2       EQU 0x0c
TPFR       EQU 0x0d
MCUCR       EQU 0x0e
FSCR       EQU 0x0f
T1CR       EQU 0x11
T2CR       EQU 0x12
T3CR       EQU 0x13
T4CR       EQU 0x14
LTCMR       EQU 0x15
EECR2       EQU 0x16
PHTCR       EQU 0x17
LDFFL       EQU 0x18
LDFD       EQU 0x19
PRR0       EQU 0x1a
PHFR       EQU 0x1b
LFFR       EQU 0x1c
AESCR       EQU 0x1d
AESSR       EQU 0x1e
EECR       EQU 0x1f
EEDR       EQU 0x20
EEARL       EQU 0x21
EEARH       EQU 0x22
EEPR0       EQU 0x23
GPIOR1       EQU 0x24
GPIOR2       EQU 0x25
PCICR       EQU 0x26
EIMSK       EQU 0x27
EIFR       EQU 0x28
LDFCKSW       EQU 0x29
VMSCR       EQU 0x2a
MCUSR       EQU 0x2b
SPCR       EQU 0x2c
SPSR       EQU 0x2d
SPDR       EQU 0x2e
LFCR0       EQU 0x2f
LFCR1       EQU 0x30
DWDR       EQU 0x31
T0IFR       EQU 0x32
SPMCSR       EQU 0x37
SMCR       EQU 0x38
TPSR       EQU 0x39
LFCR2       EQU 0x3a
LFCR3       EQU 0x3b
SPL       EQU 0x3d
SPH       EQU 0x3e
SREG       EQU 0x3f
FSEN       EQU 0x60       ; MEMORY MAPPED
FSFCR       EQU 0x61       ; MEMORY MAPPED
GACDIVL       EQU 0x62       ; MEMORY MAPPED
GACDIVH       EQU 0x63       ; MEMORY MAPPED
FFREQ1L       EQU 0x64       ; MEMORY MAPPED
FFREQ1M       EQU 0x65       ; MEMORY MAPPED
FFREQ1H       EQU 0x66       ; MEMORY MAPPED
FFREQ2L       EQU 0x67       ; MEMORY MAPPED
FFREQ2M       EQU 0x68       ; MEMORY MAPPED
FFREQ2H       EQU 0x69       ; MEMORY MAPPED
BBTE2       EQU 0x6a       ; MEMORY MAPPED
EICRA       EQU 0x6b       ; MEMORY MAPPED
PCMSK0       EQU 0x6c       ; MEMORY MAPPED
PCMSK1       EQU 0x6d       ; MEMORY MAPPED
WDTCR       EQU 0x6e       ; MEMORY MAPPED
T1CNT       EQU 0x6f       ; MEMORY MAPPED
T1COR       EQU 0x70       ; MEMORY MAPPED
T1MR       EQU 0x71       ; MEMORY MAPPED
T1IMR       EQU 0x72       ; MEMORY MAPPED
T2CNT       EQU 0x73       ; MEMORY MAPPED
T2COR       EQU 0x74       ; MEMORY MAPPED
T2MR       EQU 0x75       ; MEMORY MAPPED
T2IMR       EQU 0x76       ; MEMORY MAPPED
T3CNTL       EQU 0x77       ; MEMORY MAPPED
T3CNTH       EQU 0x78       ; MEMORY MAPPED
T3CORL       EQU 0x79       ; MEMORY MAPPED
T3CORH       EQU 0x7a       ; MEMORY MAPPED
T3ICRL       EQU 0x7b       ; MEMORY MAPPED
T3ICRH       EQU 0x7c       ; MEMORY MAPPED
T3MRA       EQU 0x7d       ; MEMORY MAPPED
T3MRB       EQU 0x7e       ; MEMORY MAPPED
T3IMR       EQU 0x7f       ; MEMORY MAPPED
T4CNTL       EQU 0x80       ; MEMORY MAPPED
T4CNTH       EQU 0x81       ; MEMORY MAPPED
T4CORL       EQU 0x82       ; MEMORY MAPPED
T4CORH       EQU 0x83       ; MEMORY MAPPED
T4ICRL       EQU 0x84       ; MEMORY MAPPED
T4ICRH       EQU 0x85       ; MEMORY MAPPED
T4MRA       EQU 0x86       ; MEMORY MAPPED
T4MRB       EQU 0x87       ; MEMORY MAPPED
T4IMR       EQU 0x88       ; MEMORY MAPPED
T5TEMP       EQU 0x89       ; MEMORY MAPPED
T5OCRL       EQU 0x8a       ; MEMORY MAPPED
T5OCRH       EQU 0x8b       ; MEMORY MAPPED
T5CCR       EQU 0x8c       ; MEMORY MAPPED
T5CNTL       EQU 0x8d       ; MEMORY MAPPED
T5CNTH       EQU 0x8e       ; MEMORY MAPPED
T5IMR       EQU 0x8f       ; MEMORY MAPPED
LFCALR1       EQU 0x90       ; MEMORY MAPPED
LFCALR2       EQU 0x91       ; MEMORY MAPPED
LFCALR3       EQU 0x92       ; MEMORY MAPPED
LFCALR4       EQU 0x93       ; MEMORY MAPPED
LFCALR5       EQU 0x94       ; MEMORY MAPPED
LFCALR6       EQU 0x95       ; MEMORY MAPPED
LFCALR7       EQU 0x96       ; MEMORY MAPPED
LFCALR8       EQU 0x97       ; MEMORY MAPPED
LFCALR9       EQU 0x98       ; MEMORY MAPPED
LFCALR10       EQU 0x99       ; MEMORY MAPPED
LFCALR11       EQU 0x9a       ; MEMORY MAPPED
LFCALR12       EQU 0x9b       ; MEMORY MAPPED
LFCALR13       EQU 0x9c       ; MEMORY MAPPED
LFCALR14       EQU 0x9d       ; MEMORY MAPPED
LFCALR15       EQU 0x9e       ; MEMORY MAPPED
LFCALR16       EQU 0x9f       ; MEMORY MAPPED
LFCALR17       EQU 0xa0       ; MEMORY MAPPED
LFCALR18       EQU 0xa1       ; MEMORY MAPPED
LFCALR19       EQU 0xa2       ; MEMORY MAPPED
LFCALR20       EQU 0xa3       ; MEMORY MAPPED
LFCALR21       EQU 0xa4       ; MEMORY MAPPED
LFCALR22       EQU 0xa5       ; MEMORY MAPPED
LFCALR23       EQU 0xa6       ; MEMORY MAPPED
LFCALR24       EQU 0xa7       ; MEMORY MAPPED
LFCALR25       EQU 0xa8       ; MEMORY MAPPED
LFCALR26       EQU 0xa9       ; MEMORY MAPPED
LFCALR27       EQU 0xaa       ; MEMORY MAPPED
LFCALR28       EQU 0xab       ; MEMORY MAPPED
LFCALR29       EQU 0xac       ; MEMORY MAPPED
LFCALR30       EQU 0xad       ; MEMORY MAPPED
LFCALR31       EQU 0xae       ; MEMORY MAPPED
LFCALR32       EQU 0xaf       ; MEMORY MAPPED
LFCALR33       EQU 0xb0       ; MEMORY MAPPED
LFCALR34       EQU 0xb1       ; MEMORY MAPPED
LFCALR35       EQU 0xb2       ; MEMORY MAPPED
LFCALR36       EQU 0xb3       ; MEMORY MAPPED
LFCALR37       EQU 0xb4       ; MEMORY MAPPED
LFCALR38       EQU 0xb5       ; MEMORY MAPPED
LFCALR39       EQU 0xb6       ; MEMORY MAPPED
LFCALR40       EQU 0xb7       ; MEMORY MAPPED
LFCALR41       EQU 0xb8       ; MEMORY MAPPED
LFCALR42       EQU 0xb9       ; MEMORY MAPPED
LFCALR43       EQU 0xba       ; MEMORY MAPPED
LFCALR44       EQU 0xbb       ; MEMORY MAPPED
LFCALR45       EQU 0xbc       ; MEMORY MAPPED
LFCALR46       EQU 0xbd       ; MEMORY MAPPED
LFCALR47       EQU 0xbe       ; MEMORY MAPPED
LFCALR48       EQU 0xbf       ; MEMORY MAPPED
LFCALR49       EQU 0xc0       ; MEMORY MAPPED
LFCALR50       EQU 0xc1       ; MEMORY MAPPED
LFCALR51       EQU 0xc2       ; MEMORY MAPPED
LFCALR52       EQU 0xc3       ; MEMORY MAPPED
LFCALR53       EQU 0xc4       ; MEMORY MAPPED
XFUSE       EQU 0xc5       ; MEMORY MAPPED
MRCCAL       EQU 0xc6       ; MEMORY MAPPED
FRCCAL       EQU 0xc7       ; MEMORY MAPPED
RCTCAL       EQU 0xc8       ; MEMORY MAPPED
CMSR       EQU 0xc9       ; MEMORY MAPPED
CMOCR       EQU 0xca       ; MEMORY MAPPED
SUPFR       EQU 0xcb       ; MEMORY MAPPED
SUPCR       EQU 0xcc       ; MEMORY MAPPED
SUPCA1       EQU 0xcd       ; MEMORY MAPPED
SUPCA2       EQU 0xce       ; MEMORY MAPPED
SUPCA3       EQU 0xcf       ; MEMORY MAPPED
SUPCA4       EQU 0xd0       ; MEMORY MAPPED
CALRDY       EQU 0xd1       ; MEMORY MAPPED
DFS       EQU 0xd2       ; MEMORY MAPPED
DFL       EQU 0xd5       ; MEMORY MAPPED
DFWP       EQU 0xd6       ; MEMORY MAPPED
DFRP       EQU 0xd7       ; MEMORY MAPPED
DFD       EQU 0xd8       ; MEMORY MAPPED
DFI       EQU 0xd9       ; MEMORY MAPPED
DFC       EQU 0xda       ; MEMORY MAPPED
SFS       EQU 0xdb       ; MEMORY MAPPED
SFL       EQU 0xdc       ; MEMORY MAPPED
SFWP       EQU 0xdd       ; MEMORY MAPPED
SFRP       EQU 0xde       ; MEMORY MAPPED
SFD       EQU 0xdf       ; MEMORY MAPPED
SFI       EQU 0xe0       ; MEMORY MAPPED
SFC       EQU 0xe1       ; MEMORY MAPPED
SSMCR       EQU 0xe2       ; MEMORY MAPPED
GTCCR       EQU 0xe3       ; MEMORY MAPPED
SSMFBR       EQU 0xe4       ; MEMORY MAPPED
SSMRR       EQU 0xe5       ; MEMORY MAPPED
SSMSR       EQU 0xe6       ; MEMORY MAPPED
SSMIFR       EQU 0xe7       ; MEMORY MAPPED
SSMIMR       EQU 0xe8       ; MEMORY MAPPED
MSMSTR       EQU 0xe9       ; MEMORY MAPPED
SSMSTR       EQU 0xea       ; MEMORY MAPPED
VXMCTRL       EQU 0xeb       ; MEMORY MAPPED
MSMCR1       EQU 0xec       ; MEMORY MAPPED
MSMCR2       EQU 0xed       ; MEMORY MAPPED
MSMCR3       EQU 0xee       ; MEMORY MAPPED
MSMCR4       EQU 0xef       ; MEMORY MAPPED
SP2CR       EQU 0xf7       ; MEMORY MAPPED
SP2DR       EQU 0xf8       ; MEMORY MAPPED
SP2SR       EQU 0xf9       ; MEMORY MAPPED
TRCIDL       EQU 0xfc       ; MEMORY MAPPED
TRCIDH       EQU 0xfd       ; MEMORY MAPPED
TRCDR       EQU 0xff       ; MEMORY MAPPED
FESR       EQU 0x100       ; MEMORY MAPPED
FEEN1       EQU 0x101       ; MEMORY MAPPED
FEEN2       EQU 0x102       ; MEMORY MAPPED
FELNA       EQU 0x103       ; MEMORY MAPPED
FEAT       EQU 0x104       ; MEMORY MAPPED
FEPAC       EQU 0x105       ; MEMORY MAPPED
FEVCT       EQU 0x106       ; MEMORY MAPPED
FEBT       EQU 0x107       ; MEMORY MAPPED
FEMS       EQU 0x108       ; MEMORY MAPPED
FETN4       EQU 0x109       ; MEMORY MAPPED
FECR       EQU 0x10a       ; MEMORY MAPPED
FEVCO       EQU 0x10b       ; MEMORY MAPPED
FEALR       EQU 0x10c       ; MEMORY MAPPED
FEANT       EQU 0x10d       ; MEMORY MAPPED
FEBIA       EQU 0x10e       ; MEMORY MAPPED
SPARE1       EQU 0x10f       ; MEMORY MAPPED
SPARE2       EQU 0x110       ; MEMORY MAPPED
SPARE3       EQU 0x111       ; MEMORY MAPPED
SPARE4       EQU 0x112       ; MEMORY MAPPED
CLKOD       EQU 0x115       ; MEMORY MAPPED
CLKOCR       EQU 0x116       ; MEMORY MAPPED
FETE1       EQU 0x11c       ; MEMORY MAPPED
FETE2       EQU 0x11d       ; MEMORY MAPPED
FETE3       EQU 0x11e       ; MEMORY MAPPED
FETD       EQU 0x11f       ; MEMORY MAPPED
TMFSM       EQU 0x120       ; MEMORY MAPPED
TMCRCL       EQU 0x121       ; MEMORY MAPPED
TMCRCH       EQU 0x122       ; MEMORY MAPPED
TMCSB       EQU 0x123       ; MEMORY MAPPED
TMCIL       EQU 0x124       ; MEMORY MAPPED
TMCIH       EQU 0x125       ; MEMORY MAPPED
TMCPL       EQU 0x126       ; MEMORY MAPPED
TMCPH       EQU 0x127       ; MEMORY MAPPED
TMSHR       EQU 0x128       ; MEMORY MAPPED
TMTLL       EQU 0x129       ; MEMORY MAPPED
TMTLH       EQU 0x12a       ; MEMORY MAPPED
TMSSC       EQU 0x12b       ; MEMORY MAPPED
TMSR       EQU 0x12c       ; MEMORY MAPPED
TMCR2       EQU 0x12d       ; MEMORY MAPPED
TMCR1       EQU 0x12e       ; MEMORY MAPPED
LFDSR1       EQU 0x130       ; MEMORY MAPPED
LFDSR2       EQU 0x131       ; MEMORY MAPPED
LFDSR3       EQU 0x132       ; MEMORY MAPPED
LFDSR4       EQU 0x133       ; MEMORY MAPPED
LFDSR5       EQU 0x134       ; MEMORY MAPPED
LFDSR6       EQU 0x135       ; MEMORY MAPPED
LFDSR7       EQU 0x136       ; MEMORY MAPPED
LFDSR8       EQU 0x137       ; MEMORY MAPPED
LFDSR9       EQU 0x138       ; MEMORY MAPPED
LFDSR10       EQU 0x139       ; MEMORY MAPPED
LFDSR11       EQU 0x13a       ; MEMORY MAPPED
EEPR1       EQU 0x13b       ; MEMORY MAPPED
EEPR2       EQU 0x13c       ; MEMORY MAPPED
EEPR3       EQU 0x13d       ; MEMORY MAPPED
CRCCR       EQU 0x145       ; MEMORY MAPPED
CRCDOR       EQU 0x146       ; MEMORY MAPPED
LFSRCTM       EQU 0x151       ; MEMORY MAPPED
DBCR       EQU 0x152       ; MEMORY MAPPED
DBTC       EQU 0x153       ; MEMORY MAPPED
DBENB       EQU 0x154       ; MEMORY MAPPED
DBENC       EQU 0x155       ; MEMORY MAPPED
DBGSW       EQU 0x156       ; MEMORY MAPPED
SFFR       EQU 0x157       ; MEMORY MAPPED
SFIR       EQU 0x158       ; MEMORY MAPPED
T2IFR       EQU 0x159       ; MEMORY MAPPED
PGMST       EQU 0x15a       ; MEMORY MAPPED
EEST       EQU 0x15b       ; MEMORY MAPPED
LFSRCTL       EQU 0x15c       ; MEMORY MAPPED
PCIFR       EQU 0x161       ; MEMORY MAPPED
T0CR       EQU 0x162       ; MEMORY MAPPED
DBEND       EQU 0x164       ; MEMORY MAPPED
TPCR1       EQU 0x165       ; MEMORY MAPPED
TPIMR       EQU 0x166       ; MEMORY MAPPED
TPDCR1       EQU 0x167       ; MEMORY MAPPED
TPDCR2       EQU 0x168       ; MEMORY MAPPED
TPDCR3       EQU 0x169       ; MEMORY MAPPED
TPDCR4       EQU 0x16a       ; MEMORY MAPPED
TPDCR5       EQU 0x16b       ; MEMORY MAPPED
TPECR1       EQU 0x16c       ; MEMORY MAPPED
TPECR2       EQU 0x16d       ; MEMORY MAPPED
TPECR3       EQU 0x16e       ; MEMORY MAPPED
TPECR4       EQU 0x16f       ; MEMORY MAPPED
TPECMR       EQU 0x170       ; MEMORY MAPPED
TPCR3       EQU 0x171       ; MEMORY MAPPED
TPCR4       EQU 0x172       ; MEMORY MAPPED
TPCR5       EQU 0x173       ; MEMORY MAPPED
TPCALR1       EQU 0x175       ; MEMORY MAPPED
TPCALR2       EQU 0x176       ; MEMORY MAPPED
TPCALR3       EQU 0x177       ; MEMORY MAPPED
TPCALR4       EQU 0x178       ; MEMORY MAPPED
TPCALR5       EQU 0x179       ; MEMORY MAPPED
TPCALR6       EQU 0x17a       ; MEMORY MAPPED
TPCALR7       EQU 0x17b       ; MEMORY MAPPED
TPCALR8       EQU 0x17c       ; MEMORY MAPPED
TPCALR9       EQU 0x17d       ; MEMORY MAPPED
TPCALR10       EQU 0x17e       ; MEMORY MAPPED
AESDPR       EQU 0x17f       ; MEMORY MAPPED
AESKR       EQU 0x180       ; MEMORY MAPPED
AESDR       EQU 0x181       ; MEMORY MAPPED
GPIOR3       EQU 0x182       ; MEMORY MAPPED
GPIOR4       EQU 0x183       ; MEMORY MAPPED
GPIOR5       EQU 0x184       ; MEMORY MAPPED
GPIOR6       EQU 0x185       ; MEMORY MAPPED
GPIOR7       EQU 0x186       ; MEMORY MAPPED
GPIOR8       EQU 0x187       ; MEMORY MAPPED
PHBCRR       EQU 0x188       ; MEMORY MAPPED
LFCPR       EQU 0x18e       ; MEMORY MAPPED
LFIMR       EQU 0x18f       ; MEMORY MAPPED
PHID00       EQU 0x190       ; MEMORY MAPPED
PHID01       EQU 0x191       ; MEMORY MAPPED
PHID02       EQU 0x192       ; MEMORY MAPPED
PHID03       EQU 0x193       ; MEMORY MAPPED
PHID0L       EQU 0x194       ; MEMORY MAPPED
PHID10       EQU 0x195       ; MEMORY MAPPED
PHID11       EQU 0x196       ; MEMORY MAPPED
PHID12       EQU 0x197       ; MEMORY MAPPED
PHID13       EQU 0x198       ; MEMORY MAPPED
PHID1L       EQU 0x199       ; MEMORY MAPPED
PHIDFR       EQU 0x19a       ; MEMORY MAPPED
LFSYSY0       EQU 0x19b       ; MEMORY MAPPED
LFSYSY1       EQU 0x19c       ; MEMORY MAPPED
LFSYSY2       EQU 0x19d       ; MEMORY MAPPED
LFSYSY3       EQU 0x19e       ; MEMORY MAPPED
LFSYLE       EQU 0x19f       ; MEMORY MAPPED
LFSTOP       EQU 0x1a0       ; MEMORY MAPPED
LTCOR       EQU 0x1a1       ; MEMORY MAPPED
T1IFR       EQU 0x1a2       ; MEMORY MAPPED
PHTBLR       EQU 0x1a4       ; MEMORY MAPPED
PHDFR       EQU 0x1a5       ; MEMORY MAPPED
LTEMR       EQU 0x1a6       ; MEMORY MAPPED
LFQC3       EQU 0x1a7       ; MEMORY MAPPED
LFQC2       EQU 0x1a8       ; MEMORY MAPPED
LFQC1       EQU 0x1a9       ; MEMORY MAPPED
TW2BR       EQU 0x1aa       ; MEMORY MAPPED
TW2CR       EQU 0x1ab       ; MEMORY MAPPED
TW2SR       EQU 0x1ac       ; MEMORY MAPPED
TW2DR       EQU 0x1ad       ; MEMORY MAPPED
TW2AR       EQU 0x1ae       ; MEMORY MAPPED
TW2AMR       EQU 0x1af       ; MEMORY MAPPED
RSCR       EQU 0x1b0       ; MEMORY MAPPED
RSSR       EQU 0x1b1       ; MEMORY MAPPED
RSMS1R       EQU 0x1b2       ; MEMORY MAPPED
RSMS2R       EQU 0x1b3       ; MEMORY MAPPED
RSFR       EQU 0x1b4       ; MEMORY MAPPED
RSCALIB       EQU 0x1b6       ; MEMORY MAPPED
RSDLYR       EQU 0x1b7       ; MEMORY MAPPED
RSRES1L       EQU 0x1b8       ; MEMORY MAPPED
RSRES1H       EQU 0x1b9       ; MEMORY MAPPED
RSRES2L       EQU 0x1ba       ; MEMORY MAPPED
RSRES2H       EQU 0x1bb       ; MEMORY MAPPED
RSRES3L       EQU 0x1bc       ; MEMORY MAPPED
RSRES3H       EQU 0x1bd       ; MEMORY MAPPED
RSRES4L       EQU 0x1be       ; MEMORY MAPPED
RSRES4H       EQU 0x1bf       ; MEMORY MAPPED
RSSRCR       EQU 0x1c0       ; MEMORY MAPPED
SD12RR       EQU 0x1c1       ; MEMORY MAPPED
SD13RR       EQU 0x1c2       ; MEMORY MAPPED
SD23RR       EQU 0x1c3       ; MEMORY MAPPED
SD360R       EQU 0x1c4       ; MEMORY MAPPED
RSDBGR       EQU 0x1c5       ; MEMORY MAPPED
LDFS       EQU 0x1d1       ; MEMORY MAPPED
T4IFR       EQU 0x1d2       ; MEMORY MAPPED
LDFWP       EQU 0x1d3       ; MEMORY MAPPED
LDFRP       EQU 0x1d4       ; MEMORY MAPPED
T5IFR       EQU 0x1d5       ; MEMORY MAPPED
LDFIM       EQU 0x1d6       ; MEMORY MAPPED
LDFC       EQU 0x1d7       ; MEMORY MAPPED
PHIMR       EQU 0x1d8       ; MEMORY MAPPED
PHCRCR       EQU 0x1d9       ; MEMORY MAPPED
PHCSTL       EQU 0x1da       ; MEMORY MAPPED
PHCSTH       EQU 0x1db       ; MEMORY MAPPED
PHCRPL       EQU 0x1dc       ; MEMORY MAPPED
PHCRPH       EQU 0x1dd       ; MEMORY MAPPED
PHCSRL       EQU 0x1de       ; MEMORY MAPPED
PHCSRH       EQU 0x1df       ; MEMORY MAPPED
CRCDIR       EQU 0x1e0       ; MEMORY MAPPED
T3IFR       EQU 0x1e1       ; MEMORY MAPPED
CMCR       EQU 0x1e3       ; MEMORY MAPPED
CMIMR       EQU 0x1e4       ; MEMORY MAPPED
CLPR       EQU 0x1e5       ; MEMORY MAPPED
VMCR       EQU 0x1e6       ; MEMORY MAPPED
DBONDR       EQU 0x1e7       ; MEMORY MAPPED
CALRDYLF       EQU 0x1e8       ; MEMORY MAPPED
TW1BR       EQU 0x1e9       ; MEMORY MAPPED
TW1CR       EQU 0x1ea       ; MEMORY MAPPED
TW1SR       EQU 0x1eb       ; MEMORY MAPPED
TW1DR       EQU 0x1ec       ; MEMORY MAPPED
TW1AR       EQU 0x1ed       ; MEMORY MAPPED
TW1AMR       EQU 0x1ee       ; MEMORY MAPPED
PDSCR       EQU 0x1ef       ; MEMORY MAPPED
TMOCR       EQU 0x1f0       ; MEMORY MAPPED
SRCCAL       EQU 0x1f1       ; MEMORY MAPPED
SRCTCAL       EQU 0x1f2       ; MEMORY MAPPED
SUPCA5       EQU 0x1f3       ; MEMORY MAPPED
SUPCA6       EQU 0x1f4       ; MEMORY MAPPED
SUPCA7       EQU 0x1f5       ; MEMORY MAPPED
SUPCA8       EQU 0x1f6       ; MEMORY MAPPED
SUPCA9       EQU 0x1f7       ; MEMORY MAPPED
SUPCA10       EQU 0x1f8       ; MEMORY MAPPED
TPCALR11       EQU 0x1f9       ; MEMORY MAPPED
TPCALR12       EQU 0x1fa       ; MEMORY MAPPED
TPCALR13       EQU 0x1fb       ; MEMORY MAPPED
PMTER       EQU 0x1fe       ; MEMORY MAPPED
SRCCALL       EQU 0x1ff       ; MEMORY MAPPED
; ***** BIT DEFINITIONS **************************************************
; ***** AES **************************
; AESCR - AES Control Register
AESWK       EQU 0       ; AES Write Key
BM_AESWK    EQU (1<<AESWK)       

