camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
AESWD       EQU 1       ; AES Write Data
BM_AESWD    EQU (1<<AESWD)       

AESIM       EQU 2       ; AES Interrupt Mask
BM_AESIM    EQU (1<<AESIM)       

AESD       EQU 3       ; AES Direction
BM_AESD    EQU (1<<AESD)       

AESXOR       EQU 4       ; AES State XOR load
BM_AESXOR    EQU (1<<AESXOR)       

AESRES       EQU 5       ; AES Reset
BM_AESRES    EQU (1<<AESRES)       

AESLKM       EQU 6       ; AES Load Key Memory
BM_AESLKM    EQU (1<<AESLKM)       

AESE       EQU 7       ; AES Enable
BM_AESE    EQU (1<<AESE)       

; AESDPR - AES Data Pointer Register
AESDPR0       EQU 0       ; AES Data Pointer Register bit 0
BM_AESDPR0    EQU (1<<AESDPR0)       

AESDPR1       EQU 1       ; AES Data Pointer Register bit 1
BM_AESDPR1    EQU (1<<AESDPR1)       

AESDPR2       EQU 2       ; AES Data Pointer Register bit 2
BM_AESDPR2    EQU (1<<AESDPR2)       

AESDPR3       EQU 3       ; AES Data Pointer Register bit 3
BM_AESDPR3    EQU (1<<AESDPR3)       

; AESDR - AES Data Register
AESDR0       EQU 0       ; AES Data Register bit 0
BM_AESDR0    EQU (1<<AESDR0)       

AESDR1       EQU 1       ; AES Data Register bit 1
BM_AESDR1    EQU (1<<AESDR1)       

AESDR2       EQU 2       ; AES Data Register bit 2
BM_AESDR2    EQU (1<<AESDR2)       

AESDR3       EQU 3       ; AES Data Register bit 3
BM_AESDR3    EQU (1<<AESDR3)       

AESDR4       EQU 4       ; AES Data Register bit 4
BM_AESDR4    EQU (1<<AESDR4)       

AESDR5       EQU 5       ; AES Data Register bit 5
BM_AESDR5    EQU (1<<AESDR5)       

AESDR6       EQU 6       ; AES Data Register bit 6
BM_AESDR6    EQU (1<<AESDR6)       

AESDR7       EQU 7       ; AES Data Register bit 7
BM_AESDR7    EQU (1<<AESDR7)       

; AESKR - AES Key Register
AESKR0       EQU 0       ; AES Key Register bit 0
BM_AESKR0    EQU (1<<AESKR0)       

AESKR1       EQU 1       ; AES Key Register bit 1
BM_AESKR1    EQU (1<<AESKR1)       

AESKR2       EQU 2       ; AES Key Register bit 2
BM_AESKR2    EQU (1<<AESKR2)       

AESKR3       EQU 3       ; AES Key Register bit 3
BM_AESKR3    EQU (1<<AESKR3)       

AESKR4       EQU 4       ; AES Key Register bit 4
BM_AESKR4    EQU (1<<AESKR4)       

AESKR5       EQU 5       ; AES Key Register bit 5
BM_AESKR5    EQU (1<<AESKR5)       

AESKR6       EQU 6       ; AES Key Register bit 6
BM_AESKR6    EQU (1<<AESKR6)       

AESKR7       EQU 7       ; AES Key Register bit 7
BM_AESKR7    EQU (1<<AESKR7)       

; AESSR - AES Status Register
AESRF       EQU 0       ; AES Ready Flag
BM_AESRF    EQU (1<<AESRF)       

AESERF       EQU 7       ; AES Error Flag
BM_AESERF    EQU (1<<AESERF)       

; ***** CLK **************************
; CLKOCR - Clock output control Register
CLKOS0       EQU 0       ; Clock output source bit 0
BM_CLKOS0    EQU (1<<CLKOS0)       

CLKOS1       EQU 1       ; Clock output source bit 1
BM_CLKOS1    EQU (1<<CLKOS1)       

CLKOEN       EQU 2       ; Clock output driver enable
BM_CLKOEN    EQU (1<<CLKOEN)       

; CLKOD - Clock output divider settings Register
CLKOD0       EQU 0       ; Clock output divider bit 0
BM_CLKOD0    EQU (1<<CLKOD0)       

CLKOD1       EQU 1       ; Clock output divider bit 1
BM_CLKOD1    EQU (1<<CLKOD1)       

CLKOD2       EQU 2       ; Clock output divider bit 2
BM_CLKOD2    EQU (1<<CLKOD2)       

CLKOD3       EQU 3       ; Clock output divider bit 3
BM_CLKOD3    EQU (1<<CLKOD3)       

CLKOD4       EQU 4       ; Clock output divider bit 4
BM_CLKOD4    EQU (1<<CLKOD4)       

CLKOD5       EQU 5       ; Clock output divider bit 5
BM_CLKOD5    EQU (1<<CLKOD5)       

CLKOD6       EQU 6       ; Clock output divider bit 6
BM_CLKOD6    EQU (1<<CLKOD6)       

CLKOD7       EQU 7       ; Clock output divider bit 7
BM_CLKOD7    EQU (1<<CLKOD7)       

; CMOCR - Clock management override control register
FRCAO       EQU 0       ; FRC Always On
BM_FRCAO    EQU (1<<FRCAO)       

MRCAO       EQU 1       ; MRC Always On
BM_MRCAO    EQU (1<<MRCAO)       

FRCACT       EQU 2       ; FRC Active
BM_FRCACT    EQU (1<<FRCACT)       

; CMSR - Clock management status Register
ECF       EQU 0       ; External clock fail
BM_ECF    EQU (1<<ECF)       

; FRCCAL - Fast RC oscillator calibration Register
FRCCAL0       EQU 0       ; Fast RC oscillator calibration bit 0
BM_FRCCAL0    EQU (1<<FRCCAL0)       

FRCCAL1       EQU 1       ; Fast RC oscillator calibration bit 1
BM_FRCCAL1    EQU (1<<FRCCAL1)       

FRCCAL2       EQU 2       ; Fast RC oscillator calibration bit 2
BM_FRCCAL2    EQU (1<<FRCCAL2)       

FRCCAL3       EQU 3       ; Fast RC oscillator calibration bit 3
BM_FRCCAL3    EQU (1<<FRCCAL3)       

FRCCAL4       EQU 4       ; Fast RC oscillator calibration bit 4
BM_FRCCAL4    EQU (1<<FRCCAL4)       

; MRCCAL - Middle RC oscillator calibration Register
MRCCAL1       EQU 1       ; Middle RC oscillator calibration bit 1
BM_MRCCAL1    EQU (1<<MRCCAL1)       

MRCCAL2       EQU 2       ; Middle RC oscillator calibration bit 2
BM_MRCCAL2    EQU (1<<MRCCAL2)       

MRCCAL3       EQU 3       ; Middle RC oscillator calibration bit 3
BM_MRCCAL3    EQU (1<<MRCCAL3)       

MRCCAL4       EQU 4       ; Middle RC oscillator calibration bit 4
BM_MRCCAL4    EQU (1<<MRCCAL4)       

MRCCAL5       EQU 5       ; Middle RC oscillator calibration bit 5
BM_MRCCAL5    EQU (1<<MRCCAL5)       

MRCCAL6       EQU 6       ; Middle RC oscillator calibration bit 6
BM_MRCCAL6    EQU (1<<MRCCAL6)       

MRCCAL7       EQU 7       ; Middle RC oscillator calibration bit 7
BM_MRCCAL7    EQU (1<<MRCCAL7)       

; PRR0 - Power reduction Register 0
PRSPI       EQU 0       ; Power Reduction Serial Peripheral Interface
BM_PRSPI    EQU (1<<PRSPI)       

PRLFRS       EQU 1       ; Power Reduction LF RSSI
BM_PRLFRS    EQU (1<<PRLFRS)       

PRTXDC       EQU 2       ; Power Reduction Transmit DSP Control
BM_PRTXDC    EQU (1<<PRTXDC)       

PRCRC       EQU 3       ; Power Reduction CRC
BM_PRCRC    EQU (1<<PRCRC)       

PRVM       EQU 4       ; Power Reduction Voltage Monitor
BM_PRVM    EQU (1<<PRVM)       

