camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
PRCO       EQU 5       ; Power Reduction Clock Output
BM_PRCO    EQU (1<<PRCO)       

PRCU       EQU 6       ; Power Reduction Crypto Unit
BM_PRCU    EQU (1<<PRCU)       

PRTWI1       EQU 7       ; Power Reduction Two Wire Interface 1
BM_PRTWI1    EQU (1<<PRTWI1)       

; PRR1 - Power reduction Register 1
PRT1       EQU 0       ; Power Reduction Timer 1
BM_PRT1    EQU (1<<PRT1)       

PRT2       EQU 1       ; Power Reduction Timer 2
BM_PRT2    EQU (1<<PRT2)       

PRT3       EQU 2       ; Power Reduction Timer 3
BM_PRT3    EQU (1<<PRT3)       

PRT4       EQU 3       ; Power Reduction Timer 4
BM_PRT4    EQU (1<<PRT4)       

PRT5       EQU 4       ; Power Reduction Timer 5
BM_PRT5    EQU (1<<PRT5)       

PRLFR       EQU 5       ; Power Reduction LF Receiver
BM_PRLFR    EQU (1<<PRLFR)       

PRLFTP       EQU 6       ; Power Reduction LF Transponder
BM_PRLFTP    EQU (1<<PRLFTP)       

PRLFPH       EQU 7       ; Power Reduction LF Protocol Handler
BM_PRLFPH    EQU (1<<PRLFPH)       

; PRR2 - Power reduction register 2
PRSPI2       EQU 0       ; Power Reduction SPI2
BM_PRSPI2    EQU (1<<PRSPI2)       

PRTWI2       EQU 1       ; Power Reduction TWI2
BM_PRTWI2    EQU (1<<PRTWI2)       

PRSF       EQU 2       ; Power Reduction Support FIFO
BM_PRSF    EQU (1<<PRSF)       

PRDF       EQU 3       ; Power Reduction Data FIFO
BM_PRDF    EQU (1<<PRDF)       

PRR2_R4       EQU 4       ; 
BM_PRR2_R4    EQU (1<<PRR2_R4)       

PRR2_R5       EQU 5       ; 
BM_PRR2_R5    EQU (1<<PRR2_R5)       

PRTM       EQU 6       ; Power Reduction Tx Modulator
BM_PRTM    EQU (1<<PRTM)       

PRSSM       EQU 7       ; Power Reduction Sequencer State Machine
BM_PRSSM    EQU (1<<PRSSM)       

; XFUSE - 
; ***** CPU **************************
; CLPR - Clock Prescaler Register
CLKPS0       EQU 0       ; System Clock Prescaler Select bit 0
BM_CLKPS0    EQU (1<<CLKPS0)       

CLKPS1       EQU 1       ; System Clock Prescaler Select bit 1
BM_CLKPS1    EQU (1<<CLKPS1)       

CLKPS2       EQU 2       ; System Clock Prescaler Select bit 2
BM_CLKPS2    EQU (1<<CLKPS2)       

CLTPS0       EQU 3       ; Timer Clock Prescaler Select bit 0
BM_CLTPS0    EQU (1<<CLTPS0)       

CLTPS1       EQU 4       ; Timer Clock Prescaler Select bit 1
BM_CLTPS1    EQU (1<<CLTPS1)       

CLTPS2       EQU 5       ; Timer Clock Prescaler Select bit 2
BM_CLTPS2    EQU (1<<CLTPS2)       

CLPCE       EQU 7       ; Clock Prescaler Change Enable
BM_CLPCE    EQU (1<<CLPCE)       

; CMCR - Clock Management Control Register
CMM0       EQU 0       ; Clock Management Mode bit 0
BM_CMM0    EQU (1<<CMM0)       

CMM1       EQU 1       ; Clock Management Mode bit 1
BM_CMM1    EQU (1<<CMM1)       

CMM2       EQU 2       ; Clock Management Mode bit 2
BM_CMM2    EQU (1<<CMM2)       

CCS       EQU 3       ; Core Clock Select
BM_CCS    EQU (1<<CCS)       

CMONEN       EQU 6       ; Clock monitor enable
BM_CMONEN    EQU (1<<CMONEN)       

CMCCE       EQU 7       ; Clock management control change enable
BM_CMCCE    EQU (1<<CMCCE)       

; CMIMR - Clock interrupt mask Register
ECIE       EQU 0       ; External clock interrupt enable
BM_ECIE    EQU (1<<ECIE)       

; DWDR - Debug Wire Data Register
DWDR0       EQU 0       ; Debug Wire Data Register bit 0
BM_DWDR0    EQU (1<<DWDR0)       

DWDR1       EQU 1       ; Debug Wire Data Register bit 1
BM_DWDR1    EQU (1<<DWDR1)       

DWDR2       EQU 2       ; Debug Wire Data Register bit 2
BM_DWDR2    EQU (1<<DWDR2)       

DWDR3       EQU 3       ; Debug Wire Data Register bit 3
BM_DWDR3    EQU (1<<DWDR3)       

DWDR4       EQU 4       ; Debug Wire Data Register bit 4
BM_DWDR4    EQU (1<<DWDR4)       

DWDR5       EQU 5       ; Debug Wire Data Register bit 5
BM_DWDR5    EQU (1<<DWDR5)       

DWDR6       EQU 6       ; Debug Wire Data Register bit 6
BM_DWDR6    EQU (1<<DWDR6)       

DWDR7       EQU 7       ; Debug Wire Data Register bit 7
BM_DWDR7    EQU (1<<DWDR7)       

; MCUCR - MCU control Register
IVL0       EQU 0       ; Interrupt Vector Location bit 0
BM_IVL0    EQU (1<<IVL0)       

IVL1       EQU 1       ; Interrupt Vector Location bit 1
BM_IVL1    EQU (1<<IVL1)       

SPIIO       EQU 2       ; SPI Interrupt Only
BM_SPIIO    EQU (1<<SPIIO)       

ENPS       EQU 3       ; Enable Port Settings
BM_ENPS    EQU (1<<ENPS)       

PUD       EQU 4       ; Pull-up Resistors Disable
BM_PUD    EQU (1<<PUD)       

TRCCE       EQU 5       ; Trace Change Enable
BM_TRCCE    EQU (1<<TRCCE)       

TRCEN       EQU 6       ; Trace Enable
BM_TRCEN    EQU (1<<TRCEN)       

IVSEL       EQU 7       ; Interrupt Vector Select
BM_IVSEL    EQU (1<<IVSEL)       

; MCUSR - MCU Status Register
PORF       EQU 0       ; Power-On Reset Flag
BM_PORF    EQU (1<<PORF)       

EXTRF       EQU 1       ; External Reset Flag
BM_EXTRF    EQU (1<<EXTRF)       

MCUSR_R2       EQU 2       ; 
BM_MCUSR_R2    EQU (1<<MCUSR_R2)       

WDRF       EQU 3       ; Watchdog Reset Flag
BM_WDRF    EQU (1<<WDRF)       

TPRF       EQU 5       ; Transponder Reset Flag
BM_TPRF    EQU (1<<TPRF)       

MCUSR_R6       EQU 6       ; 
BM_MCUSR_R6    EQU (1<<MCUSR_R6)       

; SMCR - Sleep mode control Register
SE       EQU 0       ; Sleep Enable
BM_SE    EQU (1<<SE)       

SM0       EQU 1       ; Sleep Mode Select bit 0
BM_SM0    EQU (1<<SM0)       

SM1       EQU 2       ; Sleep Mode Select bit 1
BM_SM1    EQU (1<<SM1)       

SM2       EQU 3       ; Sleep Mode Select bit 2
BM_SM2    EQU (1<<SM2)       

; SPH - Stack Pointer High
SP8       EQU 0       ; Stack pointer bit 8
BM_SP8    EQU (1<<SP8)       

SP9       EQU 1       ; Stack pointer bit 9
BM_SP9    EQU (1<<SP9)       

SP10       EQU 2       ; Stack pointer bit 10
BM_SP10    EQU (1<<SP10)       

; SPL - Stack Pointer Low
SP0       EQU 0       ; Stack pointer bit 0
BM_SP0    EQU (1<<SP0)       

SP1       EQU 1       ; Stack pointer bit 1
BM_SP1    EQU (1<<SP1)       

SP2       EQU 2       ; Stack pointer bit 2
BM_SP2    EQU (1<<SP2)       

SP3       EQU 3       ; Stack pointer bit 3
BM_SP3    EQU (1<<SP3)       

