camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
SP4       EQU 4       ; Stack pointer bit 4
BM_SP4    EQU (1<<SP4)       

SP5       EQU 5       ; Stack pointer bit 5
BM_SP5    EQU (1<<SP5)       

SP6       EQU 6       ; Stack pointer bit 6
BM_SP6    EQU (1<<SP6)       

SP7       EQU 7       ; Stack pointer bit 7
BM_SP7    EQU (1<<SP7)       

; SPMCSR - Store Program Memory Control and Status Register
SELFPRGEN       EQU 0       ; Self Programming Enable
BM_SELFPRGEN    EQU (1<<SELFPRGEN)       

PGERS       EQU 1       ; Page Erase
BM_PGERS    EQU (1<<PGERS)       

PGWRT       EQU 2       ; Page Write
BM_PGWRT    EQU (1<<PGWRT)       

FLSEL0       EQU 3       ; Fuse Lockbit select Bit 0
BM_FLSEL0    EQU (1<<FLSEL0)       

FLSEL1       EQU 4       ; Fuse Lockbit select Bit 1
BM_FLSEL1    EQU (1<<FLSEL1)       

FLSEL2       EQU 5       ; Fuse Lockbit select Bit 2
BM_FLSEL2    EQU (1<<FLSEL2)       

RWWSB       EQU 6       ; Read-While-Write Section Busy
BM_RWWSB    EQU (1<<RWWSB)       

SPMIE       EQU 7       ; SPM Interrupt Enable
BM_SPMIE    EQU (1<<SPMIE)       

; SREG - Status Register
SREG_C       EQU 0       ; Carry Flag
BM_SREG_C    EQU (1<<SREG_C)       

SREG_Z       EQU 1       ; Zero Flag
BM_SREG_Z    EQU (1<<SREG_Z)       

SREG_N       EQU 2       ; Negative Flag
BM_SREG_N    EQU (1<<SREG_N)       

SREG_V       EQU 3       ; Two's Complement Overflow Flag
BM_SREG_V    EQU (1<<SREG_V)       

SREG_S       EQU 4       ; Sign Bit
BM_SREG_S    EQU (1<<SREG_S)       

SREG_H       EQU 5       ; Half Carry Flag
BM_SREG_H    EQU (1<<SREG_H)       

SREG_T       EQU 6       ; Bit Copy Storage
BM_SREG_T    EQU (1<<SREG_T)       

SREG_I       EQU 7       ; Global Interrupt Enable
BM_SREG_I    EQU (1<<SREG_I)       

; ***** CRC **************************
; CRCCR - CRC Control Register
CRCRS       EQU 0       ; CRC Data Register Reset
BM_CRCRS    EQU (1<<CRCRS)       

REFLI       EQU 1       ; Reflect Data Input Byte
BM_REFLI    EQU (1<<REFLI)       

REFLO       EQU 2       ; Reflect Data Output Byte
BM_REFLO    EQU (1<<REFLO)       

; CRCDIR - CRC Data Input Register
CRCDIR0       EQU 0       ; CRC Data Input Register bit 0
BM_CRCDIR0    EQU (1<<CRCDIR0)       

CRCDIR1       EQU 1       ; CRC Data Input Register bit 1
BM_CRCDIR1    EQU (1<<CRCDIR1)       

CRCDIR2       EQU 2       ; CRC Data Input Register bit 2
BM_CRCDIR2    EQU (1<<CRCDIR2)       

CRCDIR3       EQU 3       ; CRC Data Input Register bit 3
BM_CRCDIR3    EQU (1<<CRCDIR3)       

CRCDIR4       EQU 4       ; CRC Data Input Register bit 4
BM_CRCDIR4    EQU (1<<CRCDIR4)       

CRCDIR5       EQU 5       ; CRC Data Input Register bit 5
BM_CRCDIR5    EQU (1<<CRCDIR5)       

CRCDIR6       EQU 6       ; CRC Data Input Register bit 6
BM_CRCDIR6    EQU (1<<CRCDIR6)       

CRCDIR7       EQU 7       ; CRC Data Input Register bit 7
BM_CRCDIR7    EQU (1<<CRCDIR7)       

; CRCDOR - CRC Data Output Register
CRCDOR0       EQU 0       ; CRC Data Output Register bit 0
BM_CRCDOR0    EQU (1<<CRCDOR0)       

CRCDOR1       EQU 1       ; CRC Data Output Register bit 1
BM_CRCDOR1    EQU (1<<CRCDOR1)       

CRCDOR2       EQU 2       ; CRC Data Output Register bit 2
BM_CRCDOR2    EQU (1<<CRCDOR2)       

CRCDOR3       EQU 3       ; CRC Data Output Register bit 3
BM_CRCDOR3    EQU (1<<CRCDOR3)       

CRCDOR4       EQU 4       ; CRC Data Output Register bit 4
BM_CRCDOR4    EQU (1<<CRCDOR4)       

CRCDOR5       EQU 5       ; CRC Data Output Register bit 5
BM_CRCDOR5    EQU (1<<CRCDOR5)       

CRCDOR6       EQU 6       ; CRC Data Output Register bit 6
BM_CRCDOR6    EQU (1<<CRCDOR6)       

CRCDOR7       EQU 7       ; CRC Data Output Register bit 7
BM_CRCDOR7    EQU (1<<CRCDOR7)       

; ***** DEBOUNCE *********************
; DBCR - DeBounce Control Register
DBMD       EQU 0       ; Debounce Mode
BM_DBMD    EQU (1<<DBMD)       

DBCS       EQU 1       ; Debounce Clock Select
BM_DBCS    EQU (1<<DBCS)       

DBTMS       EQU 2       ; Debounce Timer Mask Select
BM_DBTMS    EQU (1<<DBTMS)       

DBHA       EQU 3       ; Debounce Handshake Active
BM_DBHA    EQU (1<<DBHA)       

; DBENB - DeBounce Enable Port B
DBENB0       EQU 0       ; DeBounce Enable Port B Pin 0
BM_DBENB0    EQU (1<<DBENB0)       

DBENB1       EQU 1       ; DeBounce Enable Port B Pin 1
BM_DBENB1    EQU (1<<DBENB1)       

DBENB2       EQU 2       ; DeBounce Enable Port B Pin 2
BM_DBENB2    EQU (1<<DBENB2)       

DBENB3       EQU 3       ; DeBounce Enable Port B Pin 3
BM_DBENB3    EQU (1<<DBENB3)       

DBENB4       EQU 4       ; DeBounce Enable Port B Pin 4
BM_DBENB4    EQU (1<<DBENB4)       

DBENB5       EQU 5       ; DeBounce Enable Port B Pin 5
BM_DBENB5    EQU (1<<DBENB5)       

DBENB6       EQU 6       ; DeBounce Enable Port B Pin 6
BM_DBENB6    EQU (1<<DBENB6)       

DBENB7       EQU 7       ; DeBounce Enable Port B Pin 7
BM_DBENB7    EQU (1<<DBENB7)       

; DBENC - DeBounce Enable Port C
DBENC0       EQU 0       ; DeBounce Enable Port C Pin 0
BM_DBENC0    EQU (1<<DBENC0)       

DBENC1       EQU 1       ; DeBounce Enable Port C Pin 1
BM_DBENC1    EQU (1<<DBENC1)       

DBENC2       EQU 2       ; DeBounce Enable Port C Pin 2
BM_DBENC2    EQU (1<<DBENC2)       

; DBEND - DeBounce Enable Port D
DBEND0       EQU 0       ; DeBounce Enable Port D Pin 0
BM_DBEND0    EQU (1<<DBEND0)       

DBEND1       EQU 1       ; DeBounce Enable Port D Pin 1
BM_DBEND1    EQU (1<<DBEND1)       

DBEND2       EQU 2       ; DeBounce Enable Port D Pin 2
BM_DBEND2    EQU (1<<DBEND2)       

DBEND3       EQU 3       ; DeBounce Enable Port D Pin 3
BM_DBEND3    EQU (1<<DBEND3)       

DBEND4       EQU 4       ; DeBounce Enable Port D Pin 4
BM_DBEND4    EQU (1<<DBEND4)       

DBEND5       EQU 5       ; DeBounce Enable Port D Pin 5
BM_DBEND5    EQU (1<<DBEND5)       

DBEND6       EQU 6       ; DeBounce Enable Port D Pin 6
BM_DBEND6    EQU (1<<DBEND6)       

DBEND7       EQU 7       ; DeBounce Enable Port D Pin 7
BM_DBEND7    EQU (1<<DBEND7)       

; DBTC - Debounce Timer Compare Register
DBTC0       EQU 0       ; Debounce Timer Compare bit 0
BM_DBTC0    EQU (1<<DBTC0)       

DBTC1       EQU 1       ; Debounce Timer Compare bit 1
BM_DBTC1    EQU (1<<DBTC1)       

DBTC2       EQU 2       ; Debounce Timer Compare bit 2
BM_DBTC2    EQU (1<<DBTC2)       

DBTC3       EQU 3       ; Debounce Timer Compare bit 3
BM_DBTC3    EQU (1<<DBTC3)       

DBTC4       EQU 4       ; Debounce Timer Compare bit 4
BM_DBTC4    EQU (1<<DBTC4)       

