camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
DBTC5       EQU 5       ; Debounce Timer Compare bit 5
BM_DBTC5    EQU (1<<DBTC5)       

DBTC6       EQU 6       ; Debounce Timer Compare bit 6
BM_DBTC6    EQU (1<<DBTC6)       

DBTC7       EQU 7       ; Debounce Timer Compare bit 7
BM_DBTC7    EQU (1<<DBTC7)       

; ***** DEBUG ************************
; DBGSW - Debugging Support Switch
DBGGS0       EQU 0       ; Debugging Support Group Select bit 0
BM_DBGGS0    EQU (1<<DBGGS0)       

DBGGS1       EQU 1       ; Debugging Support Group Select bit 1
BM_DBGGS1    EQU (1<<DBGGS1)       

DBGGS2       EQU 2       ; Debugging Support Group Select bit 2
BM_DBGGS2    EQU (1<<DBGGS2)       

DBGGS3       EQU 3       ; Debugging Support Group Select bit 3
BM_DBGGS3    EQU (1<<DBGGS3)       

CPBFOS0       EQU 4       ; CPU Busy Flag Output Select bit 0
BM_CPBFOS0    EQU (1<<CPBFOS0)       

CPBFOS1       EQU 5       ; CPU Busy Flag Output Select bit 1
BM_CPBFOS1    EQU (1<<CPBFOS1)       

CPBF       EQU 6       ; CPU Busy Flag
BM_CPBF    EQU (1<<CPBF)       

ATEST       EQU 7       ; Analog Test Pins Enable
BM_ATEST    EQU (1<<ATEST)       

; DBONDR - Downbond Test Register
BBESD       EQU 0       ; Bond BBESD
BM_BBESD    EQU (1<<BBESD)       

AGND_BB       EQU 1       ; Bond AGND BB
BM_AGND_BB    EQU (1<<AGND_BB)       

ISO_GND       EQU 2       ; Bond ISO SUBS3 GND
BM_ISO_GND    EQU (1<<ISO_GND)       

AGND_LF       EQU 3       ; Bond AGND LF
BM_AGND_LF    EQU (1<<AGND_LF)       

BTEST4       EQU 4       ; Bond Test 4
BM_BTEST4    EQU (1<<BTEST4)       

BTEST5       EQU 5       ; Bond Test 5
BM_BTEST5    EQU (1<<BTEST5)       

BTEST6       EQU 6       ; Bond Test 6
BM_BTEST6    EQU (1<<BTEST6)       

; TRCDR - Trace Data Register
TRCDR0       EQU 0       ; 
BM_TRCDR0    EQU (1<<TRCDR0)       

TRCDR1       EQU 1       ; 
BM_TRCDR1    EQU (1<<TRCDR1)       

TRCDR2       EQU 2       ; 
BM_TRCDR2    EQU (1<<TRCDR2)       

TRCDR3       EQU 3       ; 
BM_TRCDR3    EQU (1<<TRCDR3)       

TRCDR4       EQU 4       ; 
BM_TRCDR4    EQU (1<<TRCDR4)       

TRCDR5       EQU 5       ; 
BM_TRCDR5    EQU (1<<TRCDR5)       

TRCDR6       EQU 6       ; 
BM_TRCDR6    EQU (1<<TRCDR6)       

TRCDR7       EQU 7       ; 
BM_TRCDR7    EQU (1<<TRCDR7)       

; TRCIDH - Trace ID Register High byte
TRCID8       EQU 0       ; 
BM_TRCID8    EQU (1<<TRCID8)       

TRCID9       EQU 1       ; 
BM_TRCID9    EQU (1<<TRCID9)       

TRCID10       EQU 2       ; 
BM_TRCID10    EQU (1<<TRCID10)       

TRCID11       EQU 3       ; 
BM_TRCID11    EQU (1<<TRCID11)       

TRCID12       EQU 4       ; 
BM_TRCID12    EQU (1<<TRCID12)       

TRCID13       EQU 5       ; 
BM_TRCID13    EQU (1<<TRCID13)       

TRCID14       EQU 6       ; 
BM_TRCID14    EQU (1<<TRCID14)       

TRCID15       EQU 7       ; 
BM_TRCID15    EQU (1<<TRCID15)       

; TRCIDL - Trace ID Register Low byte
TRCID0       EQU 0       ; 
BM_TRCID0    EQU (1<<TRCID0)       

TRCID1       EQU 1       ; 
BM_TRCID1    EQU (1<<TRCID1)       

TRCID2       EQU 2       ; 
BM_TRCID2    EQU (1<<TRCID2)       

TRCID3       EQU 3       ; 
BM_TRCID3    EQU (1<<TRCID3)       

TRCID4       EQU 4       ; 
BM_TRCID4    EQU (1<<TRCID4)       

TRCID5       EQU 5       ; 
BM_TRCID5    EQU (1<<TRCID5)       

TRCID6       EQU 6       ; 
BM_TRCID6    EQU (1<<TRCID6)       

TRCID7       EQU 7       ; 
BM_TRCID7    EQU (1<<TRCID7)       

; ***** DFIFO ************************
; DFC - Data FIFO Configuration Register
DFFLC0       EQU 0       ; Data FIFO Fill-Level Configuration bit 0
BM_DFFLC0    EQU (1<<DFFLC0)       

DFFLC1       EQU 1       ; Data FIFO Fill-Level Configuration bit 1
BM_DFFLC1    EQU (1<<DFFLC1)       

DFFLC2       EQU 2       ; Data FIFO Fill-Level Configuration bit 2
BM_DFFLC2    EQU (1<<DFFLC2)       

DFFLC3       EQU 3       ; Data FIFO Fill-Level Configuration bit 3
BM_DFFLC3    EQU (1<<DFFLC3)       

DFFLC4       EQU 4       ; Data FIFO Fill-Level Configuration bit 4
BM_DFFLC4    EQU (1<<DFFLC4)       

DFFLC5       EQU 5       ; Data FIFO Fill-Level Configuration bit 5
BM_DFFLC5    EQU (1<<DFFLC5)       

DFDRA       EQU 7       ; Data FIFO Direct Read Access Operational Mode
BM_DFDRA    EQU (1<<DFDRA)       

; DFI - Data FIFO Interrupt Mask Register
DFFLIM       EQU 0       ; Data FIFO Fill-level Interrupt Mask
BM_DFFLIM    EQU (1<<DFFLIM)       

DFERIM       EQU 1       ; Data FIFO Error Interrupt Mask
BM_DFERIM    EQU (1<<DFERIM)       

; DFL - Data FIFO Fill Level Register
DFFLS0       EQU 0       ; Data FIFO Fill Level Status bit 0
BM_DFFLS0    EQU (1<<DFFLS0)       

DFFLS1       EQU 1       ; Data FIFO Fill Level Status bit 1
BM_DFFLS1    EQU (1<<DFFLS1)       

DFFLS2       EQU 2       ; Data FIFO Fill Level Status bit 2
BM_DFFLS2    EQU (1<<DFFLS2)       

DFFLS3       EQU 3       ; Data FIFO Fill Level Status bit 3
BM_DFFLS3    EQU (1<<DFFLS3)       

DFFLS4       EQU 4       ; Data FIFO Fill Level Status bit 4
BM_DFFLS4    EQU (1<<DFFLS4)       

DFFLS5       EQU 5       ; Data FIFO Fill Level Status bit 5
BM_DFFLS5    EQU (1<<DFFLS5)       

DFCLR       EQU 7       ; Data FIFO Clear
BM_DFCLR    EQU (1<<DFCLR)       

; DFRP - Data FIFO Read Pointer
DFRP0       EQU 0       ; Data FIFO Read Pointer bit 0
BM_DFRP0    EQU (1<<DFRP0)       

DFRP1       EQU 1       ; Data FIFO Read Pointer bit 1
BM_DFRP1    EQU (1<<DFRP1)       

DFRP2       EQU 2       ; Data FIFO Read Pointer bit 2
BM_DFRP2    EQU (1<<DFRP2)       

DFRP3       EQU 3       ; Data FIFO Read Pointer bit 3
BM_DFRP3    EQU (1<<DFRP3)       

DFRP4       EQU 4       ; Data FIFO Read Pointer bit 4
BM_DFRP4    EQU (1<<DFRP4)       

DFRP5       EQU 5       ; Data FIFO Read Pointer bit 5
BM_DFRP5    EQU (1<<DFRP5)       

; DFS - Data FIFO Status Register
DFFLRF       EQU 0       ; Data FIFO Fill-Level Reached Status Flag
BM_DFFLRF    EQU (1<<DFFLRF)       

DFUFL       EQU 1       ; Data FIFO Underflow Flag
BM_DFUFL    EQU (1<<DFUFL)       

DFOFL       EQU 2       ; Data FIFO Overflow Flag
BM_DFOFL    EQU (1<<DFOFL)       

; DFWP - Data FIFO Write Pointer
DFWP0       EQU 0       ; Data FIFO Write Pointer bit 0
BM_DFWP0    EQU (1<<DFWP0)       

DFWP1       EQU 1       ; Data FIFO Write Pointer bit 1
BM_DFWP1    EQU (1<<DFWP1)       

