camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
DFWP2       EQU 2       ; Data FIFO Write Pointer bit 2
BM_DFWP2    EQU (1<<DFWP2)       

DFWP3       EQU 3       ; Data FIFO Write Pointer bit 3
BM_DFWP3    EQU (1<<DFWP3)       

DFWP4       EQU 4       ; Data FIFO Write Pointer bit 4
BM_DFWP4    EQU (1<<DFWP4)       

DFWP5       EQU 5       ; Data FIFO Write Pointer bit 5
BM_DFWP5    EQU (1<<DFWP5)       

; ***** EEPROM ***********************
; EEARH - EEPROM Address Register High Byte
EEAR8       EQU 0       ; EEPROM Read/Write Address bit 8
BM_EEAR8    EQU (1<<EEAR8)       

EEAR9       EQU 1       ; EEPROM Read/Write Address bit 9
BM_EEAR9    EQU (1<<EEAR9)       

EEAR10       EQU 2       ; EEPROM Read/Write Address bit 10
BM_EEAR10    EQU (1<<EEAR10)       

EEAR11       EQU 3       ; EEPROM Read/Write Address bit 11
BM_EEAR11    EQU (1<<EEAR11)       

; EEARL - EEPROM Address Register Low Byte
EEAR0       EQU 0       ; EEPROM Read/Write Address bit 0
BM_EEAR0    EQU (1<<EEAR0)       

EEAR1       EQU 1       ; EEPROM Read/Write Address bit 1
BM_EEAR1    EQU (1<<EEAR1)       

EEAR2       EQU 2       ; EEPROM Read/Write Address bit 2
BM_EEAR2    EQU (1<<EEAR2)       

EEAR3       EQU 3       ; EEPROM Read/Write Address bit 3
BM_EEAR3    EQU (1<<EEAR3)       

EEAR4       EQU 4       ; EEPROM Read/Write Address bit 4
BM_EEAR4    EQU (1<<EEAR4)       

EEAR5       EQU 5       ; EEPROM Read/Write Address bit 5
BM_EEAR5    EQU (1<<EEAR5)       

EEAR6       EQU 6       ; EEPROM Read/Write Address bit 6
BM_EEAR6    EQU (1<<EEAR6)       

EEAR7       EQU 7       ; EEPROM Read/Write Address bit 7
BM_EEAR7    EQU (1<<EEAR7)       

; EECR - EEPROM Control Register
EERE       EQU 0       ; EEPROM Read Enable
BM_EERE    EQU (1<<EERE)       

EEWE       EQU 1       ; EEPROM Write Enable
BM_EEWE    EQU (1<<EEWE)       

EEMWE       EQU 2       ; EEPROM Master Write Enable
BM_EEMWE    EQU (1<<EEMWE)       

EERIE       EQU 3       ; EEPROM Ready Interrupt Enable
BM_EERIE    EQU (1<<EERIE)       

EEPM0       EQU 4       ; EEPROM Programming Mode bit 0
BM_EEPM0    EQU (1<<EEPM0)       

EEPM1       EQU 5       ; EEPROM Programming Mode bit 1
BM_EEPM1    EQU (1<<EEPM1)       

EEPAGE       EQU 6       ; EEPROM page access (multiple bytes access mode)
BM_EEPAGE    EQU (1<<EEPAGE)       

NVMBSY       EQU 7       ; Non-volatile memory busy
BM_NVMBSY    EQU (1<<NVMBSY)       

; EECR2 - EEPROM Control Register 2
EEBRE       EQU 0       ; EEPROM Burst Read Enable
BM_EEBRE    EQU (1<<EEBRE)       

E2CIM       EQU 1       ; EEPROM Error Code Correction Interrupt Mask
BM_E2CIM    EQU (1<<E2CIM)       

E2AVF       EQU 5       ; EEPROM Access Violation Flag
BM_E2AVF    EQU (1<<E2AVF)       

E2FF       EQU 6       ; EEPROM error Fault Flag bit
BM_E2FF    EQU (1<<E2FF)       

E2CF       EQU 7       ; EEPROM Error Correction Code Flag
BM_E2CF    EQU (1<<E2CF)       

; EEPR0 - EEPROM Protection Register 0
EEPS0WD       EQU 0       ; EEPROM Protection Section 0 Write Disable
BM_EEPS0WD    EQU (1<<EEPS0WD)       

EEPS0RD       EQU 1       ; EEPROM Protection Section 0 Read Disable
BM_EEPS0RD    EQU (1<<EEPS0RD)       

EEPS1WD       EQU 2       ; EEPROM Protection Section 1 Write Disable
BM_EEPS1WD    EQU (1<<EEPS1WD)       

EEPS1RD       EQU 3       ; EEPROM Protection Section 1 Read Disable
BM_EEPS1RD    EQU (1<<EEPS1RD)       

EEPS2WD       EQU 4       ; EEPROM Protection Section 2 Write Disable
BM_EEPS2WD    EQU (1<<EEPS2WD)       

EEPS2RD       EQU 5       ; EEPROM Protection Section 2 Read Disable
BM_EEPS2RD    EQU (1<<EEPS2RD)       

EEPS3WD       EQU 6       ; EEPROM Protection Section 3 Write Disable
BM_EEPS3WD    EQU (1<<EEPS3WD)       

EEPS3RD       EQU 7       ; EEPROM Protection Section 3 Read Disable
BM_EEPS3RD    EQU (1<<EEPS3RD)       

; EEPR1 - EEPROM Protection Register 1
EEPS4WD       EQU 0       ; EEPROM Protection Section 4 Write Disable
BM_EEPS4WD    EQU (1<<EEPS4WD)       

EEPS4RD       EQU 1       ; EEPROM Protection Section 4 Read Disable
BM_EEPS4RD    EQU (1<<EEPS4RD)       

EEPS5WD       EQU 2       ; EEPROM Protection Section 5 Write Disable
BM_EEPS5WD    EQU (1<<EEPS5WD)       

EEPS5RD       EQU 3       ; EEPROM Protection Section 5 Read Disable
BM_EEPS5RD    EQU (1<<EEPS5RD)       

EEPS6WD       EQU 4       ; EEPROM Protection Section 6 Write Disable
BM_EEPS6WD    EQU (1<<EEPS6WD)       

EEPS6RD       EQU 5       ; EEPROM Protection Section 6 Read Disable
BM_EEPS6RD    EQU (1<<EEPS6RD)       

EEPS7WD       EQU 6       ; EEPROM Protection Section 7 Write Disable
BM_EEPS7WD    EQU (1<<EEPS7WD)       

EEPS7RD       EQU 7       ; EEPROM Protection Section 7 Read Disable
BM_EEPS7RD    EQU (1<<EEPS7RD)       

; EEPR2 - EEPROM Protection Register 2
EEPS8WD       EQU 0       ; EEPROM Protection Section 8 Write Disable
BM_EEPS8WD    EQU (1<<EEPS8WD)       

EEPS8RD       EQU 1       ; EEPROM Protection Section 8 Read Disable
BM_EEPS8RD    EQU (1<<EEPS8RD)       

EEPS9WD       EQU 2       ; EEPROM Protection Section 9 Write Disable
BM_EEPS9WD    EQU (1<<EEPS9WD)       

EEPS9RD       EQU 3       ; EEPROM Protection Section 9 Read Disable
BM_EEPS9RD    EQU (1<<EEPS9RD)       

EEPS10WD       EQU 4       ; EEPROM Protection Section 10 Write Disableble
BM_EEPS10WD    EQU (1<<EEPS10WD)       

EEPS10RD       EQU 5       ; EEPROM Protection Section 10 Read Disable
BM_EEPS10RD    EQU (1<<EEPS10RD)       

EEPS11WD       EQU 6       ; EEPROM Protection Section 11 Write Disable
BM_EEPS11WD    EQU (1<<EEPS11WD)       

EEPS11RD       EQU 7       ; EEPROM Protection Section 11 Read Disable
BM_EEPS11RD    EQU (1<<EEPS11RD)       

; EEPR3 - EEPROM Protection Register 3
EEPS12WD       EQU 0       ; EEPROM Protection Section 12 Write Disable
BM_EEPS12WD    EQU (1<<EEPS12WD)       

EEPS12RD       EQU 1       ; EEPROM Protection Section 12 Read Disable
BM_EEPS12RD    EQU (1<<EEPS12RD)       

; ***** FE ***************************
; FEALR - Front-End Antenna Level Detector Range
RNGE0       EQU 0       ; Range of the ANT_TUNE level detector bit 0
BM_RNGE0    EQU (1<<RNGE0)       

RNGE1       EQU 1       ; Range of the ANT_TUNE level detector bit 1
BM_RNGE1    EQU (1<<RNGE1)       

; FEANT - Front-End Antenna
LVLC0       EQU 0       ; antenna signal LeVeL bit 0
BM_LVLC0    EQU (1<<LVLC0)       

LVLC1       EQU 1       ; antenna signal LeVeL bit 1
BM_LVLC1    EQU (1<<LVLC1)       

LVLC2       EQU 2       ; antenna signal LeVeL bit 2
BM_LVLC2    EQU (1<<LVLC2)       

LVLC3       EQU 3       ; antenna signal LeVeL bit 3
BM_LVLC3    EQU (1<<LVLC3)       

; FEAT - Front-End Antenna Tuning
ANTN0       EQU 0       ; Antenna Tuning bit 0
BM_ANTN0    EQU (1<<ANTN0)       

