camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
ANTN1       EQU 1       ; Antenna Tuning bit 1
BM_ANTN1    EQU (1<<ANTN1)       

ANTN2       EQU 2       ; Antenna Tuning bit 2
BM_ANTN2    EQU (1<<ANTN2)       

ANTN3       EQU 3       ; Antenna Tuning bit 3
BM_ANTN3    EQU (1<<ANTN3)       

; FEBIA - Reserved
FEBIA_R0       EQU 0       ; 
BM_FEBIA_R0    EQU (1<<FEBIA_R0)       

FEBIA_R1       EQU 1       ; 
BM_FEBIA_R1    EQU (1<<FEBIA_R1)       

FEBIA_R2       EQU 2       ; 
BM_FEBIA_R2    EQU (1<<FEBIA_R2)       

FEBIA_R3       EQU 3       ; 
BM_FEBIA_R3    EQU (1<<FEBIA_R3)       

FEBIA_R4       EQU 4       ; 
BM_FEBIA_R4    EQU (1<<FEBIA_R4)       

FEBIA_R5       EQU 5       ; 
BM_FEBIA_R5    EQU (1<<FEBIA_R5)       

FEBIA_R6       EQU 6       ; 
BM_FEBIA_R6    EQU (1<<FEBIA_R6)       

FEBIA_R7       EQU 7       ; 
BM_FEBIA_R7    EQU (1<<FEBIA_R7)       

; FEBT - Front-End RC Tuning Register
CTN20       EQU 0       ; Capacitor Tuning bit 0
BM_CTN20    EQU (1<<CTN20)       

CTN21       EQU 1       ; Capacitor Tuning bit 1
BM_CTN21    EQU (1<<CTN21)       

RTN20       EQU 2       ; Resistor Tuning bit 0
BM_RTN20    EQU (1<<RTN20)       

RTN21       EQU 3       ; Resistor Tuning bit 1
BM_RTN21    EQU (1<<RTN21)       

; FECR - Front-End Control Register
LBNHB       EQU 0       ; Select Low-Band Not High-Band
BM_LBNHB    EQU (1<<LBNHB)       

S4N3       EQU 1       ; Select 433 Not 315MHz Band
BM_S4N3    EQU (1<<S4N3)       

FECR_R2       EQU 2       ; 
BM_FECR_R2    EQU (1<<FECR_R2)       

FECR_R3       EQU 3       ; 
BM_FECR_R3    EQU (1<<FECR_R3)       

PLCKG       EQU 4       ; PLL Lock Detect Gate
BM_PLCKG    EQU (1<<PLCKG)       

ANPS       EQU 5       ; ASK Not DPSK Switch
BM_ANPS    EQU (1<<ANPS)       

; FEEN1 - Front-End Enable Register 1
PLEN       EQU 0       ; PLL enable
BM_PLEN    EQU (1<<PLEN)       

PLCAL       EQU 1       ; PLL calibration mode
BM_PLCAL    EQU (1<<PLCAL)       

XTOEN       EQU 2       ; Cristal Oscillator enable
BM_XTOEN    EQU (1<<XTOEN)       

FEEN1_R3       EQU 3       ; 
BM_FEEN1_R3    EQU (1<<FEEN1_R3)       

FEEN1_R4       EQU 4       ; 
BM_FEEN1_R4    EQU (1<<FEEN1_R4)       

FEEN1_R5       EQU 5       ; 
BM_FEEN1_R5    EQU (1<<FEEN1_R5)       

PLSP1       EQU 6       ; PLL Speedup 1
BM_PLSP1    EQU (1<<PLSP1)       

ATEN       EQU 7       ; Antenna Tuning Enable
BM_ATEN    EQU (1<<ATEN)       

; FEEN2 - Front-End Enable Register 2
FEEN2_R0       EQU 0       ; 
BM_FEEN2_R0    EQU (1<<FEEN2_R0)       

FEEN2_R1       EQU 1       ; 
BM_FEEN2_R1    EQU (1<<FEEN2_R1)       

PAEN       EQU 2       ; Power Amplifier enable
BM_PAEN    EQU (1<<PAEN)       

FEEN2_R3       EQU 3       ; 
BM_FEEN2_R3    EQU (1<<FEEN2_R3)       

PLPEN       EQU 4       ; PLL Post En IQ divider
BM_PLPEN    EQU (1<<PLPEN)       

FEEN2_R5       EQU 5       ; 
BM_FEEN2_R5    EQU (1<<FEEN2_R5)       

CPBIA       EQU 6       ; Cap Array Bias
BM_CPBIA    EQU (1<<CPBIA)       

FEEN2_R7       EQU 7       ; 
BM_FEEN2_R7    EQU (1<<FEEN2_R7)       

; FELNA - Reserved
FELNA_R0       EQU 0       ; 
BM_FELNA_R0    EQU (1<<FELNA_R0)       

FELNA_R1       EQU 1       ; 
BM_FELNA_R1    EQU (1<<FELNA_R1)       

FELNA_R2       EQU 2       ; 
BM_FELNA_R2    EQU (1<<FELNA_R2)       

FELNA_R3       EQU 3       ; 
BM_FELNA_R3    EQU (1<<FELNA_R3)       

FELNA_R4       EQU 4       ; 
BM_FELNA_R4    EQU (1<<FELNA_R4)       

FELNA_R5       EQU 5       ; 
BM_FELNA_R5    EQU (1<<FELNA_R5)       

FELNA_R6       EQU 6       ; 
BM_FELNA_R6    EQU (1<<FELNA_R6)       

FELNA_R7       EQU 7       ; 
BM_FELNA_R7    EQU (1<<FELNA_R7)       

; FEMS - Front-End Main and Swallow Control Register
PLLS0       EQU 0       ; PLL Swallow bit 0
BM_PLLS0    EQU (1<<PLLS0)       

PLLS1       EQU 1       ; PLL Swallow bit 1
BM_PLLS1    EQU (1<<PLLS1)       

PLLS2       EQU 2       ; PLL Swallow bit 2
BM_PLLS2    EQU (1<<PLLS2)       

PLLS3       EQU 3       ; PLL Swallow bit 3
BM_PLLS3    EQU (1<<PLLS3)       

PLLM0       EQU 4       ; PLL Mode bit 0
BM_PLLM0    EQU (1<<PLLM0)       

PLLM1       EQU 5       ; PLL Mode bit 1
BM_PLLM1    EQU (1<<PLLM1)       

PLLM2       EQU 6       ; PLL Mode bit 2
BM_PLLM2    EQU (1<<PLLM2)       

PLLM3       EQU 7       ; PLL Mode bit 3
BM_PLLM3    EQU (1<<PLLM3)       

; FEPAC - Front-End Power Amplifier Control Register
PACR0       EQU 0       ; Power Amplifier Control Register bit 0
BM_PACR0    EQU (1<<PACR0)       

PACR1       EQU 1       ; Power Amplifier Control Register bit 1
BM_PACR1    EQU (1<<PACR1)       

PACR2       EQU 2       ; Power Amplifier Control Register bit 2
BM_PACR2    EQU (1<<PACR2)       

PACR3       EQU 3       ; Power Amplifier Control Register bit 3
BM_PACR3    EQU (1<<PACR3)       

PACR4       EQU 4       ; Power Amplifier Control Register bit 4
BM_PACR4    EQU (1<<PACR4)       

PACR5       EQU 5       ; Power Amplifier Control Register bit 5
BM_PACR5    EQU (1<<PACR5)       

PACR6       EQU 6       ; Power Amplifier Control Register bit 6
BM_PACR6    EQU (1<<PACR6)       

PACR7       EQU 7       ; Power Amplifier Control Register bit 7
BM_PACR7    EQU (1<<PACR7)       

; FESR - Front-End Status Register
XRDY       EQU 2       ; XTO ready
BM_XRDY    EQU (1<<XRDY)       

PLCK       EQU 3       ; PLL locked
BM_PLCK    EQU (1<<PLCK)       

ANTS       EQU 4       ; Antenna saturated
BM_ANTS    EQU (1<<ANTS)       

; FETD - Front-End Test Data Register
FETM0       EQU 0       ; 
BM_FETM0    EQU (1<<FETM0)       

FETM1       EQU 1       ; 
BM_FETM1    EQU (1<<FETM1)       

FETM2       EQU 2       ; 
BM_FETM2    EQU (1<<FETM2)       

FETM3       EQU 3       ; 
BM_FETM3    EQU (1<<FETM3)       

FETM4       EQU 4       ; 
BM_FETM4    EQU (1<<FETM4)       

FETM5       EQU 5       ; 
BM_FETM5    EQU (1<<FETM5)       

FETM6       EQU 6       ; 
BM_FETM6    EQU (1<<FETM6)       

FETM7       EQU 7       ; 
BM_FETM7    EQU (1<<FETM7)       

; FETE1 - Front-End Test Enable Register 1
ADCT       EQU 0       ; 
BM_ADCT    EQU (1<<ADCT)       

XTOT       EQU 1       ; 
BM_XTOT    EQU (1<<XTOT)       

LNLT       EQU 2       ; 
BM_LNLT    EQU (1<<LNLT)       

LNHT       EQU 3       ; 
BM_LNHT    EQU (1<<LNHT)       

PATE       EQU 4       ; 
BM_PATE    EQU (1<<PATE)       

AMPT       EQU 5       ; 
BM_AMPT    EQU (1<<AMPT)       

VCOT       EQU 6       ; 
BM_VCOT    EQU (1<<VCOT)       

ANTN       EQU 7       ; 
BM_ANTN    EQU (1<<ANTN)       

; FETE2 - Front-End Test Enable Register 2
RCCT       EQU 0       ; 
BM_RCCT    EQU (1<<RCCT)       

PPFT       EQU 1       ; 
BM_PPFT    EQU (1<<PPFT)       

LFT       EQU 2       ; 
BM_LFT    EQU (1<<LFT)       

CPT       EQU 3       ; 
BM_CPT    EQU (1<<CPT)       

PFDT       EQU 4       ; 
BM_PFDT    EQU (1<<PFDT)       

DADCT       EQU 5       ; 
BM_DADCT    EQU (1<<DADCT)       

PRET       EQU 6       ; 
BM_PRET    EQU (1<<PRET)       

SWALT       EQU 7       ; 
BM_SWALT    EQU (1<<SWALT)       

; FETE3 - Front-End Test Enable Register 3
BIOUT       EQU 0       ; 
BM_BIOUT    EQU (1<<BIOUT)       

