camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
RMPTST       EQU 1       ; 
BM_RMPTST    EQU (1<<RMPTST)       

FETE3_R2       EQU 2       ; 
BM_FETE3_R2    EQU (1<<FETE3_R2)       

FETE3_R3       EQU 3       ; 
BM_FETE3_R3    EQU (1<<FETE3_R3)       

FETE3_R4       EQU 4       ; 
BM_FETE3_R4    EQU (1<<FETE3_R4)       

FETE3_R5       EQU 5       ; 
BM_FETE3_R5    EQU (1<<FETE3_R5)       

FETE3_R6       EQU 6       ; 
BM_FETE3_R6    EQU (1<<FETE3_R6)       

FETE3_R7       EQU 7       ; 
BM_FETE3_R7    EQU (1<<FETE3_R7)       

; FETN4 - Front-End RC Tuning 4bit Register
CTN40       EQU 0       ; 4 bit Capacitor Tuning bit 0
BM_CTN40    EQU (1<<CTN40)       

CTN41       EQU 1       ; 4 bit Capacitor Tuning bit 1
BM_CTN41    EQU (1<<CTN41)       

CTN42       EQU 2       ; 4 bit Capacitor Tuning bit 2
BM_CTN42    EQU (1<<CTN42)       

CTN43       EQU 3       ; 4 bit Capacitor Tuning bit 3
BM_CTN43    EQU (1<<CTN43)       

RTN40       EQU 4       ; 4 bit Resistor Tuning bit 0
BM_RTN40    EQU (1<<RTN40)       

RTN41       EQU 5       ; 4 bit Resistor Tuning bit 1
BM_RTN41    EQU (1<<RTN41)       

RTN42       EQU 6       ; 4 bit Resistor Tuning bit 2
BM_RTN42    EQU (1<<RTN42)       

RTN43       EQU 7       ; 4 bit Resistor Tuning bit 3
BM_RTN43    EQU (1<<RTN43)       

; FEVCO - Front-End VCO and PLL control
CPCC0       EQU 0       ; Charge pump current control bit 0
BM_CPCC0    EQU (1<<CPCC0)       

CPCC1       EQU 1       ; Charge pump current control bit 1
BM_CPCC1    EQU (1<<CPCC1)       

CPCC2       EQU 2       ; Charge pump current control bit 2
BM_CPCC2    EQU (1<<CPCC2)       

CPCC3       EQU 3       ; Charge pump current control bit 3
BM_CPCC3    EQU (1<<CPCC3)       

VCOB0       EQU 4       ; VCO Bias bit 0
BM_VCOB0    EQU (1<<VCOB0)       

VCOB1       EQU 5       ; VCO Bias bit 1
BM_VCOB1    EQU (1<<VCOB1)       

VCOB2       EQU 6       ; VCO Bias bit 2
BM_VCOB2    EQU (1<<VCOB2)       

VCOB3       EQU 7       ; VCO Bias bit 3
BM_VCOB3    EQU (1<<VCOB3)       

; FEVCT - Front-End VCO Tuning Register
FEVCT0       EQU 0       ; Front-End VCO Tuning Register bit 0
BM_FEVCT0    EQU (1<<FEVCT0)       

FEVCT1       EQU 1       ; Front-End VCO Tuning Register bit 1
BM_FEVCT1    EQU (1<<FEVCT1)       

FEVCT2       EQU 2       ; Front-End VCO Tuning Register bit 2
BM_FEVCT2    EQU (1<<FEVCT2)       

FEVCT3       EQU 3       ; Front-End VCO Tuning Register bit 3
BM_FEVCT3    EQU (1<<FEVCT3)       

FEVCT_R4       EQU 4       ; 
BM_FEVCT_R4    EQU (1<<FEVCT_R4)       

FEVCT_R5       EQU 5       ; 
BM_FEVCT_R5    EQU (1<<FEVCT_R5)       

FEVCT_R6       EQU 6       ; 
BM_FEVCT_R6    EQU (1<<FEVCT_R6)       

FEVCT_R7       EQU 7       ; 
BM_FEVCT_R7    EQU (1<<FEVCT_R7)       

; SPARE1 - Front-End Spare Register 1
SPARE10       EQU 0       ; 
BM_SPARE10    EQU (1<<SPARE10)       

SPARE11       EQU 1       ; 
BM_SPARE11    EQU (1<<SPARE11)       

SPARE12       EQU 2       ; 
BM_SPARE12    EQU (1<<SPARE12)       

SPARE13       EQU 3       ; 
BM_SPARE13    EQU (1<<SPARE13)       

SPARE14       EQU 4       ; 
BM_SPARE14    EQU (1<<SPARE14)       

SPARE15       EQU 5       ; 
BM_SPARE15    EQU (1<<SPARE15)       

SPARE16       EQU 6       ; 
BM_SPARE16    EQU (1<<SPARE16)       

SPARE17       EQU 7       ; 
BM_SPARE17    EQU (1<<SPARE17)       

; SPARE2 - Front-End Spare Register 2
SPARE20       EQU 0       ; 
BM_SPARE20    EQU (1<<SPARE20)       

SPARE21       EQU 1       ; 
BM_SPARE21    EQU (1<<SPARE21)       

SPARE22       EQU 2       ; 
BM_SPARE22    EQU (1<<SPARE22)       

SPARE23       EQU 3       ; 
BM_SPARE23    EQU (1<<SPARE23)       

SPARE24       EQU 4       ; 
BM_SPARE24    EQU (1<<SPARE24)       

SPARE25       EQU 5       ; 
BM_SPARE25    EQU (1<<SPARE25)       

SPARE26       EQU 6       ; 
BM_SPARE26    EQU (1<<SPARE26)       

SPARE27       EQU 7       ; 
BM_SPARE27    EQU (1<<SPARE27)       

; SPARE3 - Front-End Spare Register 3
SPARE30       EQU 0       ; 
BM_SPARE30    EQU (1<<SPARE30)       

SPARE31       EQU 1       ; 
BM_SPARE31    EQU (1<<SPARE31)       

SPARE32       EQU 2       ; 
BM_SPARE32    EQU (1<<SPARE32)       

SPARE33       EQU 3       ; 
BM_SPARE33    EQU (1<<SPARE33)       

SPARE34       EQU 4       ; 
BM_SPARE34    EQU (1<<SPARE34)       

SPARE35       EQU 5       ; 
BM_SPARE35    EQU (1<<SPARE35)       

SPARE36       EQU 6       ; 
BM_SPARE36    EQU (1<<SPARE36)       

SPARE37       EQU 7       ; 
BM_SPARE37    EQU (1<<SPARE37)       

; SPARE4 - Front-End Spare Register 4
SPARE40       EQU 0       ; 
BM_SPARE40    EQU (1<<SPARE40)       

SPARE41       EQU 1       ; 
BM_SPARE41    EQU (1<<SPARE41)       

SPARE42       EQU 2       ; 
BM_SPARE42    EQU (1<<SPARE42)       

SPARE43       EQU 3       ; 
BM_SPARE43    EQU (1<<SPARE43)       

SPARE44       EQU 4       ; 
BM_SPARE44    EQU (1<<SPARE44)       

SPARE45       EQU 5       ; 
BM_SPARE45    EQU (1<<SPARE45)       

SPARE46       EQU 6       ; 
BM_SPARE46    EQU (1<<SPARE46)       

SPARE47       EQU 7       ; 
BM_SPARE47    EQU (1<<SPARE47)       

; ***** GPIOREGS_DVCC ****************
; GPIOR0 - General Purpose I/O Register 0
GPIOR00       EQU 0       ; 
BM_GPIOR00    EQU (1<<GPIOR00)       

GPIOR01       EQU 1       ; 
BM_GPIOR01    EQU (1<<GPIOR01)       

GPIOR02       EQU 2       ; 
BM_GPIOR02    EQU (1<<GPIOR02)       

GPIOR03       EQU 3       ; 
BM_GPIOR03    EQU (1<<GPIOR03)       

GPIOR04       EQU 4       ; 
BM_GPIOR04    EQU (1<<GPIOR04)       

GPIOR05       EQU 5       ; 
BM_GPIOR05    EQU (1<<GPIOR05)       

GPIOR06       EQU 6       ; 
BM_GPIOR06    EQU (1<<GPIOR06)       

GPIOR07       EQU 7       ; 
BM_GPIOR07    EQU (1<<GPIOR07)       

; GPIOR1 - General Purpose I/O Register 1
GPIOR10       EQU 0       ; 
BM_GPIOR10    EQU (1<<GPIOR10)       

GPIOR11       EQU 1       ; 
BM_GPIOR11    EQU (1<<GPIOR11)       

GPIOR12       EQU 2       ; 
BM_GPIOR12    EQU (1<<GPIOR12)       

GPIOR13       EQU 3       ; 
BM_GPIOR13    EQU (1<<GPIOR13)       

GPIOR14       EQU 4       ; 
BM_GPIOR14    EQU (1<<GPIOR14)       

GPIOR15       EQU 5       ; 
BM_GPIOR15    EQU (1<<GPIOR15)       

GPIOR16       EQU 6       ; 
BM_GPIOR16    EQU (1<<GPIOR16)       

