camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
GPIOR17       EQU 7       ; 
BM_GPIOR17    EQU (1<<GPIOR17)       

; GPIOR2 - General Purpose I/O Register 2
GPIOR20       EQU 0       ; 
BM_GPIOR20    EQU (1<<GPIOR20)       

GPIOR21       EQU 1       ; 
BM_GPIOR21    EQU (1<<GPIOR21)       

GPIOR22       EQU 2       ; 
BM_GPIOR22    EQU (1<<GPIOR22)       

GPIOR23       EQU 3       ; 
BM_GPIOR23    EQU (1<<GPIOR23)       

GPIOR24       EQU 4       ; 
BM_GPIOR24    EQU (1<<GPIOR24)       

GPIOR25       EQU 5       ; 
BM_GPIOR25    EQU (1<<GPIOR25)       

GPIOR26       EQU 6       ; 
BM_GPIOR26    EQU (1<<GPIOR26)       

GPIOR27       EQU 7       ; 
BM_GPIOR27    EQU (1<<GPIOR27)       

; ***** GPIOREGS_LFVCC ***************
; GPIOR3 - General Purpose I/O Register 3
GPIOR30       EQU 0       ; 
BM_GPIOR30    EQU (1<<GPIOR30)       

GPIOR31       EQU 1       ; 
BM_GPIOR31    EQU (1<<GPIOR31)       

GPIOR32       EQU 2       ; 
BM_GPIOR32    EQU (1<<GPIOR32)       

GPIOR33       EQU 3       ; 
BM_GPIOR33    EQU (1<<GPIOR33)       

GPIOR34       EQU 4       ; 
BM_GPIOR34    EQU (1<<GPIOR34)       

GPIOR35       EQU 5       ; 
BM_GPIOR35    EQU (1<<GPIOR35)       

GPIOR36       EQU 6       ; 
BM_GPIOR36    EQU (1<<GPIOR36)       

GPIOR37       EQU 7       ; 
BM_GPIOR37    EQU (1<<GPIOR37)       

; GPIOR4 - General Purpose I/O Register 4
GPIOR40       EQU 0       ; 
BM_GPIOR40    EQU (1<<GPIOR40)       

GPIOR41       EQU 1       ; 
BM_GPIOR41    EQU (1<<GPIOR41)       

GPIOR42       EQU 2       ; 
BM_GPIOR42    EQU (1<<GPIOR42)       

GPIOR43       EQU 3       ; 
BM_GPIOR43    EQU (1<<GPIOR43)       

GPIOR44       EQU 4       ; 
BM_GPIOR44    EQU (1<<GPIOR44)       

GPIOR45       EQU 5       ; 
BM_GPIOR45    EQU (1<<GPIOR45)       

GPIOR46       EQU 6       ; 
BM_GPIOR46    EQU (1<<GPIOR46)       

GPIOR47       EQU 7       ; 
BM_GPIOR47    EQU (1<<GPIOR47)       

; GPIOR5 - General Purpose I/O Register 5
GPIOR50       EQU 0       ; 
BM_GPIOR50    EQU (1<<GPIOR50)       

GPIOR51       EQU 1       ; 
BM_GPIOR51    EQU (1<<GPIOR51)       

GPIOR52       EQU 2       ; 
BM_GPIOR52    EQU (1<<GPIOR52)       

GPIOR53       EQU 3       ; 
BM_GPIOR53    EQU (1<<GPIOR53)       

GPIOR54       EQU 4       ; 
BM_GPIOR54    EQU (1<<GPIOR54)       

GPIOR55       EQU 5       ; 
BM_GPIOR55    EQU (1<<GPIOR55)       

GPIOR56       EQU 6       ; 
BM_GPIOR56    EQU (1<<GPIOR56)       

GPIOR57       EQU 7       ; 
BM_GPIOR57    EQU (1<<GPIOR57)       

; GPIOR6 - General Purpose I/O Register 6
GPIOR60       EQU 0       ; 
BM_GPIOR60    EQU (1<<GPIOR60)       

GPIOR61       EQU 1       ; 
BM_GPIOR61    EQU (1<<GPIOR61)       

GPIOR62       EQU 2       ; 
BM_GPIOR62    EQU (1<<GPIOR62)       

GPIOR63       EQU 3       ; 
BM_GPIOR63    EQU (1<<GPIOR63)       

GPIOR64       EQU 4       ; 
BM_GPIOR64    EQU (1<<GPIOR64)       

GPIOR65       EQU 5       ; 
BM_GPIOR65    EQU (1<<GPIOR65)       

GPIOR66       EQU 6       ; 
BM_GPIOR66    EQU (1<<GPIOR66)       

GPIOR67       EQU 7       ; 
BM_GPIOR67    EQU (1<<GPIOR67)       

; GPIOR7 - General Purpose I/O Register 7
GPIOR70       EQU 0       ; 
BM_GPIOR70    EQU (1<<GPIOR70)       

GPIOR71       EQU 1       ; 
BM_GPIOR71    EQU (1<<GPIOR71)       

GPIOR72       EQU 2       ; 
BM_GPIOR72    EQU (1<<GPIOR72)       

GPIOR73       EQU 3       ; 
BM_GPIOR73    EQU (1<<GPIOR73)       

GPIOR74       EQU 4       ; 
BM_GPIOR74    EQU (1<<GPIOR74)       

GPIOR75       EQU 5       ; 
BM_GPIOR75    EQU (1<<GPIOR75)       

GPIOR76       EQU 6       ; 
BM_GPIOR76    EQU (1<<GPIOR76)       

GPIOR77       EQU 7       ; 
BM_GPIOR77    EQU (1<<GPIOR77)       

; GPIOR8 - General Purpose I/O Register 8
GPIOR80       EQU 0       ; 
BM_GPIOR80    EQU (1<<GPIOR80)       

GPIOR81       EQU 1       ; 
BM_GPIOR81    EQU (1<<GPIOR81)       

GPIOR82       EQU 2       ; 
BM_GPIOR82    EQU (1<<GPIOR82)       

GPIOR83       EQU 3       ; 
BM_GPIOR83    EQU (1<<GPIOR83)       

GPIOR84       EQU 4       ; 
BM_GPIOR84    EQU (1<<GPIOR84)       

GPIOR85       EQU 5       ; 
BM_GPIOR85    EQU (1<<GPIOR85)       

GPIOR86       EQU 6       ; 
BM_GPIOR86    EQU (1<<GPIOR86)       

GPIOR87       EQU 7       ; 
BM_GPIOR87    EQU (1<<GPIOR87)       

; ***** INT **************************
; EICRA - External Interrupt control Register
ISC00       EQU 0       ; Interrupt Sense Control 0 bit 0
BM_ISC00    EQU (1<<ISC00)       

ISC01       EQU 1       ; Interrupt Sense Control 0 bit 1
BM_ISC01    EQU (1<<ISC01)       

ISC10       EQU 2       ; Interrupt Sense Control 1 bit 0
BM_ISC10    EQU (1<<ISC10)       

ISC11       EQU 3       ; Interrupt Sense Control 1 bit 1
BM_ISC11    EQU (1<<ISC11)       

; EIFR - External Interrupt Flag Register
INTF0       EQU 0       ; External Interrupt Flag 0
BM_INTF0    EQU (1<<INTF0)       

INTF1       EQU 1       ; External Interrupt Flag 1
BM_INTF1    EQU (1<<INTF1)       

; EIMSK - External Interrupt Mask Register
INT0       EQU 0       ; External Interrupt Request 0 Enable
BM_INT0    EQU (1<<INT0)       

INT1       EQU 1       ; External Interrupt Request 1 Enable
BM_INT1    EQU (1<<INT1)       

; PCICR - Pin change Interrupt control Register
PCIE0       EQU 0       ; Pin Change Interrupt Enable 0
BM_PCIE0    EQU (1<<PCIE0)       

PCIE1       EQU 1       ; Pin Change Interrupt Enable 1
BM_PCIE1    EQU (1<<PCIE1)       

; PCIFR - Pin change Interrupt flag Register
PCIF0       EQU 0       ; Pin Change Interrupt Flag 0
BM_PCIF0    EQU (1<<PCIF0)       

PCIF1       EQU 1       ; Pin Change Interrupt Flag 1
BM_PCIF1    EQU (1<<PCIF1)       

; PCMSK0 - Pin change Mask Register 0
PCINT0       EQU 0       ; Pin Change Enable Mask bit 0
BM_PCINT0    EQU (1<<PCINT0)       

PCINT1       EQU 1       ; Pin Change Enable Mask bit 1
BM_PCINT1    EQU (1<<PCINT1)       

PCINT2       EQU 2       ; Pin Change Enable Mask bit 2
BM_PCINT2    EQU (1<<PCINT2)       

PCINT3       EQU 3       ; Pin Change Enable Mask bit 3
BM_PCINT3    EQU (1<<PCINT3)       

PCINT4       EQU 4       ; Pin Change Enable Mask bit 4
BM_PCINT4    EQU (1<<PCINT4)       

PCINT5       EQU 5       ; Pin Change Enable Mask bit 5
BM_PCINT5    EQU (1<<PCINT5)       

PCINT6       EQU 6       ; Pin Change Enable Mask bit 6
BM_PCINT6    EQU (1<<PCINT6)       

PCINT7       EQU 7       ; Pin Change Enable Mask bit 7
BM_PCINT7    EQU (1<<PCINT7)       

; PCMSK1 - Pin change Mask Register 1
PCINT8       EQU 0       ; Pin Change Enable Mask bit 8
BM_PCINT8    EQU (1<<PCINT8)       

