camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
PCINT9       EQU 1       ; Pin Change Enable Mask bit 9
BM_PCINT9    EQU (1<<PCINT9)       

PCINT10       EQU 2       ; Pin Change Enable Mask bit 10
BM_PCINT10    EQU (1<<PCINT10)       

PCINT11       EQU 3       ; Pin Change Enable Mask bit 11
BM_PCINT11    EQU (1<<PCINT11)       

PCINT12       EQU 4       ; Pin Change Enable Mask bit 12
BM_PCINT12    EQU (1<<PCINT12)       

PCINT13       EQU 5       ; Pin Change Enable Mask bit 13
BM_PCINT13    EQU (1<<PCINT13)       

PCINT14       EQU 6       ; Pin Change Enable Mask bit 14
BM_PCINT14    EQU (1<<PCINT14)       

PCINT15       EQU 7       ; Pin Change Enable Mask bit 15
BM_PCINT15    EQU (1<<PCINT15)       

; ***** LED **************************
; PDSCR - Pad Driver Strength Control Register
PDSC0       EQU 0       ; Pad Driver Strength Control bit 0
BM_PDSC0    EQU (1<<PDSC0)       

PDSC1       EQU 1       ; Pad Driver Strength Control bit 1
BM_PDSC1    EQU (1<<PDSC1)       

PDSC2       EQU 2       ; Pad Driver Strength Control bit 2
BM_PDSC2    EQU (1<<PDSC2)       

PDSC3       EQU 3       ; Pad Driver Strength Control bit 3
BM_PDSC3    EQU (1<<PDSC3)       

PDSC4       EQU 4       ; Pad Driver Strength Control bit 4
BM_PDSC4    EQU (1<<PDSC4)       

STBTEST       EQU 5       ; Standby Test Enable
BM_STBTEST    EQU (1<<STBTEST)       

RSSISEL       EQU 6       ; Testmode Enable for RSSI Measurement
BM_RSSISEL    EQU (1<<RSSISEL)       

ATBSEL       EQU 7       ; Analog Testbus Select
BM_ATBSEL    EQU (1<<ATBSEL)       

; ***** LF_FIFO **********************
; LDFC - LF Data FIFO Configuration Register
LDFFLC0       EQU 0       ; LF Data FIFO Fill-Level Configuration bit 0
BM_LDFFLC0    EQU (1<<LDFFLC0)       

LDFFLC1       EQU 1       ; LF Data FIFO Fill-Level Configuration bit 1
BM_LDFFLC1    EQU (1<<LDFFLC1)       

LDFFLC2       EQU 2       ; LF Data FIFO Fill-Level Configuration bit 2
BM_LDFFLC2    EQU (1<<LDFFLC2)       

LDFFLC3       EQU 3       ; LF Data FIFO Fill-Level Configuration bit 3
BM_LDFFLC3    EQU (1<<LDFFLC3)       

LDFFLC4       EQU 4       ; LF Data FIFO Fill-Level Configuration bit 4
BM_LDFFLC4    EQU (1<<LDFFLC4)       

LDFFLC5       EQU 5       ; LF Data FIFO Fill-Level Configuration bit 5
BM_LDFFLC5    EQU (1<<LDFFLC5)       

LDFMSB       EQU 6       ; LF Data FIFO MSB alignment bit
BM_LDFMSB    EQU (1<<LDFMSB)       

; LDFCKSW - LF Data FIFO Clock Switch Register
LDFSCSW       EQU 0       ; LF Data FIFO Synchronous Clock Switch
BM_LDFSCSW    EQU (1<<LDFSCSW)       

LDFSCKS       EQU 1       ; LF Data FIFO Synchronous Clock Status
BM_LDFSCKS    EQU (1<<LDFSCKS)       

; LDFFL - LF Data FIFO Fill Level Register
LDFFL0       EQU 0       ; LF Data Fifo Fill Level bit 0
BM_LDFFL0    EQU (1<<LDFFL0)       

LDFFL1       EQU 1       ; LF Data Fifo Fill Level bit 1
BM_LDFFL1    EQU (1<<LDFFL1)       

LDFFL2       EQU 2       ; LF Data Fifo Fill Level bit 2
BM_LDFFL2    EQU (1<<LDFFL2)       

LDFFL3       EQU 3       ; LF Data Fifo Fill Level bit 3
BM_LDFFL3    EQU (1<<LDFFL3)       

LDFFL4       EQU 4       ; LF Data Fifo Fill Level bit 4
BM_LDFFL4    EQU (1<<LDFFL4)       

LDFFL5       EQU 5       ; LF Data Fifo Fill Level bit 5
BM_LDFFL5    EQU (1<<LDFFL5)       

LDFCLR       EQU 7       ; LF Data FIFO Clear
BM_LDFCLR    EQU (1<<LDFCLR)       

; LDFIM - LF Data FIFO Interrupt Mask Register
LDFFLIM       EQU 0       ; LF Data FIFO Fill-level Interrupt Mask
BM_LDFFLIM    EQU (1<<LDFFLIM)       

LDFEIM       EQU 1       ; LF Data FIFO Error Interrupt Mask
BM_LDFEIM    EQU (1<<LDFEIM)       

; LDFRP - LF Data FIFO Read Pointer
LDFRP0       EQU 0       ; LF Data FIFO Read Pointer bit 0
BM_LDFRP0    EQU (1<<LDFRP0)       

LDFRP1       EQU 1       ; LF Data FIFO Read Pointer bit 1
BM_LDFRP1    EQU (1<<LDFRP1)       

LDFRP2       EQU 2       ; LF Data FIFO Read Pointer bit 2
BM_LDFRP2    EQU (1<<LDFRP2)       

LDFRP3       EQU 3       ; LF Data FIFO Read Pointer bit 3
BM_LDFRP3    EQU (1<<LDFRP3)       

LDFRP4       EQU 4       ; LF Data FIFO Read Pointer bit 4
BM_LDFRP4    EQU (1<<LDFRP4)       

LDFRP5       EQU 5       ; PH FIFO Read Pointer bit 5
BM_LDFRP5    EQU (1<<LDFRP5)       

; LDFS - LF Data FIFO Status Register
LDFFLR       EQU 0       ; LF Data FIFO Fill-Level Reached flag
BM_LDFFLR    EQU (1<<LDFFLR)       

LDFUF       EQU 1       ; LF Data FIFO UnderFlow flag
BM_LDFUF    EQU (1<<LDFUF)       

LDFOF       EQU 2       ; LF Data FIFO OverFlow flag
BM_LDFOF    EQU (1<<LDFOF)       

; LDFWP - LF Data FIFO Write Pointer
LDFWP0       EQU 0       ; LF Data FIFO Write Pointer bit 0
BM_LDFWP0    EQU (1<<LDFWP0)       

LDFWP1       EQU 1       ; LF Data FIFO Write Pointer bit 1
BM_LDFWP1    EQU (1<<LDFWP1)       

LDFWP2       EQU 2       ; LF Data FIFO Write Pointer bit 2
BM_LDFWP2    EQU (1<<LDFWP2)       

LDFWP3       EQU 3       ; LF Data FIFO Write Pointer bit 3
BM_LDFWP3    EQU (1<<LDFWP3)       

LDFWP4       EQU 4       ; LF Data FIFO Write Pointer bit 4
BM_LDFWP4    EQU (1<<LDFWP4)       

LDFWP5       EQU 5       ; LF Data FIFO Write Pointer bit 5
BM_LDFWP5    EQU (1<<LDFWP5)       

; ***** LF_PROTOCOL_HANDLER **********
; PHBCRR - Protocol Handler Bit Counter Read Register
PHBCR0       EQU 0       ; Protocol Handler Bit Counter Read bit 0
BM_PHBCR0    EQU (1<<PHBCR0)       

PHBCR1       EQU 1       ; Protocol Handler Bit Counter Read bit 1
BM_PHBCR1    EQU (1<<PHBCR1)       

PHBCR2       EQU 2       ; Protocol Handler Bit Counter Read bit 2
BM_PHBCR2    EQU (1<<PHBCR2)       

PHBCR3       EQU 3       ; Protocol Handler Bit Counter Read bit 3
BM_PHBCR3    EQU (1<<PHBCR3)       

PHBCR4       EQU 4       ; Protocol Handler Bit Counter Read bit 4
BM_PHBCR4    EQU (1<<PHBCR4)       

PHBCR5       EQU 5       ; Protocol Handler Bit Counter Read bit 5
BM_PHBCR5    EQU (1<<PHBCR5)       

PHBCR6       EQU 6       ; Protocol Handler Bit Counter Read bit 6
BM_PHBCR6    EQU (1<<PHBCR6)       

PHBCR7       EQU 7       ; Protocol Handler Bit Counter Read bit 7
BM_PHBCR7    EQU (1<<PHBCR7)       

