camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
; PHCRCR - Protocol Handler CRC Control Register
CRCFR       EQU 2       ; CRC ID Frame
BM_CRCFR    EQU (1<<CRCFR)       

CRCSE0       EQU 4       ; CRC size bit 0
BM_CRCSE0    EQU (1<<CRCSE0)       

CRCSE1       EQU 5       ; CRC size bit 1
BM_CRCSE1    EQU (1<<CRCSE1)       

CRCEN       EQU 7       ; CRC Enable
BM_CRCEN    EQU (1<<CRCEN)       

; PHCRPH - PH CRC Polynomial High Byte Register
PHCRP8       EQU 0       ; 
BM_PHCRP8    EQU (1<<PHCRP8)       

PHCRP9       EQU 1       ; 
BM_PHCRP9    EQU (1<<PHCRP9)       

PHCRP10       EQU 2       ; 
BM_PHCRP10    EQU (1<<PHCRP10)       

PHCRP11       EQU 3       ; 
BM_PHCRP11    EQU (1<<PHCRP11)       

PHCRP12       EQU 4       ; 
BM_PHCRP12    EQU (1<<PHCRP12)       

PHCRP13       EQU 5       ; 
BM_PHCRP13    EQU (1<<PHCRP13)       

PHCRP14       EQU 6       ; 
BM_PHCRP14    EQU (1<<PHCRP14)       

PHCRP15       EQU 7       ; 
BM_PHCRP15    EQU (1<<PHCRP15)       

; PHCRPL - PH CRC Polynomial Low Byte Register
PHCRP0       EQU 0       ; 
BM_PHCRP0    EQU (1<<PHCRP0)       

PHCRP1       EQU 1       ; 
BM_PHCRP1    EQU (1<<PHCRP1)       

PHCRP2       EQU 2       ; 
BM_PHCRP2    EQU (1<<PHCRP2)       

PHCRP3       EQU 3       ; 
BM_PHCRP3    EQU (1<<PHCRP3)       

PHCRP4       EQU 4       ; 
BM_PHCRP4    EQU (1<<PHCRP4)       

PHCRP5       EQU 5       ; 
BM_PHCRP5    EQU (1<<PHCRP5)       

PHCRP6       EQU 6       ; 
BM_PHCRP6    EQU (1<<PHCRP6)       

PHCRP7       EQU 7       ; 
BM_PHCRP7    EQU (1<<PHCRP7)       

; PHCSRH - PH CRC Checksum High Byte Register
PHCSR8       EQU 0       ; 
BM_PHCSR8    EQU (1<<PHCSR8)       

PHCSR9       EQU 1       ; 
BM_PHCSR9    EQU (1<<PHCSR9)       

PHCSR10       EQU 2       ; 
BM_PHCSR10    EQU (1<<PHCSR10)       

PHCSR11       EQU 3       ; 
BM_PHCSR11    EQU (1<<PHCSR11)       

PHCSR12       EQU 4       ; 
BM_PHCSR12    EQU (1<<PHCSR12)       

PHCSR13       EQU 5       ; 
BM_PHCSR13    EQU (1<<PHCSR13)       

PHCSR14       EQU 6       ; 
BM_PHCSR14    EQU (1<<PHCSR14)       

PHCSR15       EQU 7       ; 
BM_PHCSR15    EQU (1<<PHCSR15)       

; PHCSRL - PH CRC Checksum Low Byte Register
PHCSR0       EQU 0       ; 
BM_PHCSR0    EQU (1<<PHCSR0)       

PHCSR1       EQU 1       ; 
BM_PHCSR1    EQU (1<<PHCSR1)       

PHCSR2       EQU 2       ; 
BM_PHCSR2    EQU (1<<PHCSR2)       

PHCSR3       EQU 3       ; 
BM_PHCSR3    EQU (1<<PHCSR3)       

PHCSR4       EQU 4       ; 
BM_PHCSR4    EQU (1<<PHCSR4)       

PHCSR5       EQU 5       ; 
BM_PHCSR5    EQU (1<<PHCSR5)       

PHCSR6       EQU 6       ; 
BM_PHCSR6    EQU (1<<PHCSR6)       

PHCSR7       EQU 7       ; 
BM_PHCSR7    EQU (1<<PHCSR7)       

; PHCSTH - PH CRC Start Value High Byte Register
PHCST8       EQU 0       ; 
BM_PHCST8    EQU (1<<PHCST8)       

PHCST9       EQU 1       ; 
BM_PHCST9    EQU (1<<PHCST9)       

PHCST10       EQU 2       ; 
BM_PHCST10    EQU (1<<PHCST10)       

PHCST11       EQU 3       ; 
BM_PHCST11    EQU (1<<PHCST11)       

PHCST12       EQU 4       ; 
BM_PHCST12    EQU (1<<PHCST12)       

PHCST13       EQU 5       ; 
BM_PHCST13    EQU (1<<PHCST13)       

PHCST14       EQU 6       ; 
BM_PHCST14    EQU (1<<PHCST14)       

PHCST15       EQU 7       ; 
BM_PHCST15    EQU (1<<PHCST15)       

; PHCSTL - PH CRC Start Value Low Byte Register
PHCST0       EQU 0       ; 
BM_PHCST0    EQU (1<<PHCST0)       

PHCST1       EQU 1       ; 
BM_PHCST1    EQU (1<<PHCST1)       

PHCST2       EQU 2       ; 
BM_PHCST2    EQU (1<<PHCST2)       

PHCST3       EQU 3       ; 
BM_PHCST3    EQU (1<<PHCST3)       

PHCST4       EQU 4       ; 
BM_PHCST4    EQU (1<<PHCST4)       

PHCST5       EQU 5       ; 
BM_PHCST5    EQU (1<<PHCST5)       

PHCST6       EQU 6       ; 
BM_PHCST6    EQU (1<<PHCST6)       

PHCST7       EQU 7       ; 
BM_PHCST7    EQU (1<<PHCST7)       

; PHDFR - Protocol Handler Data Frame end Register
PHDF0       EQU 0       ; Protocol Handler Data Frame end bit 0
BM_PHDF0    EQU (1<<PHDF0)       

PHDF1       EQU 1       ; Protocol Handler Data Frame end bit 1
BM_PHDF1    EQU (1<<PHDF1)       

PHDF2       EQU 2       ; Protocol Handler Data Frame end bit 2
BM_PHDF2    EQU (1<<PHDF2)       

PHDF3       EQU 3       ; Protocol Handler Data Frame end bit 3
BM_PHDF3    EQU (1<<PHDF3)       

PHDF4       EQU 4       ; Protocol Handler Data Frame end bit 4
BM_PHDF4    EQU (1<<PHDF4)       

PHDF5       EQU 5       ; Protocol Handler Data Frame end bit 5
BM_PHDF5    EQU (1<<PHDF5)       

PHDF6       EQU 6       ; Protocol Handler Data Frame end bit 6
BM_PHDF6    EQU (1<<PHDF6)       

PHDF7       EQU 7       ; Protocol Handler Data Frame end bit 7
BM_PHDF7    EQU (1<<PHDF7)       

; PHFR - Protocol Handler Flag Register
CRCEF       EQU 0       ; PH CRC Error Status Flag
BM_CRCEF    EQU (1<<CRCEF)       

PHTBLF       EQU 1       ; Protocol Handler Telegram Bit Length Flag
BM_PHTBLF    EQU (1<<PHTBLF)       

PHDFF       EQU 2       ; Protocol Handler Date Frame Flag
BM_PHDFF    EQU (1<<PHDFF)       

PHIDFF       EQU 3       ; Protocol Handler ID Frame Flag
BM_PHIDFF    EQU (1<<PHIDFF)       

PHID0F       EQU 4       ; Protocol Handler IDentifier 0 Flag
BM_PHID0F    EQU (1<<PHID0F)       

PHID1F       EQU 5       ; Protocol Handler IDentifier 1 Flag
BM_PHID1F    EQU (1<<PHID1F)       

; PHID0L - PH Identifier 0 Length Register
ID0FS0       EQU 0       ; Identifier 0 Frame Select bit 0
BM_ID0FS0    EQU (1<<ID0FS0)       

ID0FS1       EQU 1       ; Identifier 0 Frame Select bit 1
BM_ID0FS1    EQU (1<<ID0FS1)       

ID0FS2       EQU 2       ; Identifier 0 Frame Select bit 2
BM_ID0FS2    EQU (1<<ID0FS2)       

ID0FS3       EQU 3       ; Identifier 0 Frame Select bit 3
BM_ID0FS3    EQU (1<<ID0FS3)       

ID0FS4       EQU 4       ; Identifier 0 Frame Select bit 4
BM_ID0FS4    EQU (1<<ID0FS4)       

ID0FS5       EQU 5       ; Identifier 0 Frame Select bit 5
BM_ID0FS5    EQU (1<<ID0FS5)       

; PHID1L - PH Identifier 1 Length Register
ID1FS0       EQU 0       ; Identifier 0 Frame Select bit 0
BM_ID1FS0    EQU (1<<ID1FS0)       

ID1FS1       EQU 1       ; Identifier 0 Frame Select bit 1
BM_ID1FS1    EQU (1<<ID1FS1)       

ID1FS2       EQU 2       ; Identifier 0 Frame Select bit 2
BM_ID1FS2    EQU (1<<ID1FS2)       

