camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
ID1FS3       EQU 3       ; Identifier 0 Frame Select bit 3
BM_ID1FS3    EQU (1<<ID1FS3)       

ID1FS4       EQU 4       ; Identifier 0 Frame Select bit 4
BM_ID1FS4    EQU (1<<ID1FS4)       

ID1FS5       EQU 5       ; Identifier 0 Frame Select bit 5
BM_ID1FS5    EQU (1<<ID1FS5)       

; PHIDFR - Protocol Handler ID Frame Register
RDFS0       EQU 0       ; 
BM_RDFS0    EQU (1<<RDFS0)       

RDFS1       EQU 1       ; 
BM_RDFS1    EQU (1<<RDFS1)       

RDFS2       EQU 2       ; 
BM_RDFS2    EQU (1<<RDFS2)       

RDFS3       EQU 3       ; 
BM_RDFS3    EQU (1<<RDFS3)       

RDFS4       EQU 4       ; 
BM_RDFS4    EQU (1<<RDFS4)       

RDFS5       EQU 5       ; 
BM_RDFS5    EQU (1<<RDFS5)       

RDFS6       EQU 6       ; 
BM_RDFS6    EQU (1<<RDFS6)       

RDFS7       EQU 7       ; 
BM_RDFS7    EQU (1<<RDFS7)       

; PHIMR - Protocol Handler Interrupt Mask Register
PHTBLIM       EQU 1       ; Protocol Handler Telegram Bit Length Interrupt Mask
BM_PHTBLIM    EQU (1<<PHTBLIM)       

PHDFIM       EQU 2       ; Protocol Handler Date Frame Interrupt Mask
BM_PHDFIM    EQU (1<<PHDFIM)       

PHIDFIM       EQU 3       ; Protocol Handler ID Frame Interrupt Mask
BM_PHIDFIM    EQU (1<<PHIDFIM)       

PHID0IM       EQU 4       ; Protocol Handler IDentifier 0 Interrupt Mask
BM_PHID0IM    EQU (1<<PHID0IM)       

PHID1IM       EQU 5       ; Protocol Handler IDentifier 1 Interrupt Mask
BM_PHID1IM    EQU (1<<PHID1IM)       

; PHTBLR - Protocol Handler Telegram Bit Length Register
PHTBL0       EQU 0       ; 
BM_PHTBL0    EQU (1<<PHTBL0)       

PHTBL1       EQU 1       ; 
BM_PHTBL1    EQU (1<<PHTBL1)       

PHTBL2       EQU 2       ; 
BM_PHTBL2    EQU (1<<PHTBL2)       

PHTBL3       EQU 3       ; 
BM_PHTBL3    EQU (1<<PHTBL3)       

PHTBL4       EQU 4       ; 
BM_PHTBL4    EQU (1<<PHTBL4)       

PHTBL5       EQU 5       ; 
BM_PHTBL5    EQU (1<<PHTBL5)       

PHTBL6       EQU 6       ; 
BM_PHTBL6    EQU (1<<PHTBL6)       

PHTBL7       EQU 7       ; 
BM_PHTBL7    EQU (1<<PHTBL7)       

; PHTCR - PH Telegram Configuration Register
FRFIFO       EQU 5       ; ID Frame stored in FIFO
BM_FRFIFO    EQU (1<<FRFIFO)       

CPM       EQU 6       ; Continuous Pattern Mode
BM_CPM    EQU (1<<CPM)       

CSM       EQU 7       ; Continue or Single receive Mode
BM_CSM    EQU (1<<CSM)       

; ***** LF_RECEIVER ******************
; LFCR0 - LF Receiver Control Register 0
LFCE1       EQU 0       ; LF Receiver Channel 1 Enable
BM_LFCE1    EQU (1<<LFCE1)       

LFCE2       EQU 1       ; LF Receiver Channel 2 Enable
BM_LFCE2    EQU (1<<LFCE2)       

LFCE3       EQU 2       ; LF Receiver Channel 3 Enable
BM_LFCE3    EQU (1<<LFCE3)       

LFBR0       EQU 3       ; LF Receiver Bit Rate bit 0
BM_LFBR0    EQU (1<<LFBR0)       

LFBR1       EQU 4       ; LF Receiver Bit Rate bit 1
BM_LFBR1    EQU (1<<LFBR1)       

LFMG       EQU 5       ; LF Receiver Maximum Gain Select
BM_LFMG    EQU (1<<LFMG)       

LFRRT0       EQU 6       ; LF Receiver Reset Time select bit 0
BM_LFRRT0    EQU (1<<LFRRT0)       

LFRRT1       EQU 7       ; LF Receiver Reset Time select bit 1
BM_LFRRT1    EQU (1<<LFRRT1)       

; LFCR1 - LF Receiver Control Register 1
RSST0       EQU 0       ; RSSI Startup TIme bit 0
BM_RSST0    EQU (1<<RSST0)       

RSST1       EQU 1       ; RSSI Startup TIme bit 1
BM_RSST1    EQU (1<<RSST1)       

LFFM1       EQU 2       ; LF Function Mode bit 1
BM_LFFM1    EQU (1<<LFFM1)       

ARMDE       EQU 3       ; Analog Reset Manchester Detector Enable
BM_ARMDE    EQU (1<<ARMDE)       

FLLEN       EQU 4       ; FLL Enable
BM_FLLEN    EQU (1<<FLLEN)       

ADTHEN       EQU 5       ; Adapt Threshold Enable
BM_ADTHEN    EQU (1<<ADTHEN)       

LFPEEN       EQU 6       ; LF Port Event Enable
BM_LFPEEN    EQU (1<<LFPEEN)       

LFRE       EQU 7       ; LF Receiver Enable
BM_LFRE    EQU (1<<LFRE)       

; LFCR2 - LF Receiver Control Register 2
LFSEN0       EQU 0       ; LF Sensitivity Mode bit 0
BM_LFSEN0    EQU (1<<LFSEN0)       

LFSEN1       EQU 1       ; LF Sensitivity Mode bit 1
BM_LFSEN1    EQU (1<<LFSEN1)       

LFDAMP       EQU 2       ; LF coil Damping level select
BM_LFDAMP    EQU (1<<LFDAMP)       

LFVC0       EQU 5       ; LF Velocity Control bit 0
BM_LFVC0    EQU (1<<LFVC0)       

LFVC1       EQU 6       ; LF Velocity Control bit 1
BM_LFVC1    EQU (1<<LFVC1)       

LFVC2       EQU 7       ; LF Velocity Control bit 2
BM_LFVC2    EQU (1<<LFVC2)       

; LFCR3 - LF Receiver Control Register 3
LFRCTEN       EQU 0       ; LF RC Trim Enable
BM_LFRCTEN    EQU (1<<LFRCTEN)       

LFRCPCEN       EQU 1       ; LF RC Pump Continuous Enable
BM_LFRCPCEN    EQU (1<<LFRCPCEN)       

LFRCPM       EQU 2       ; LF RC Pump mode Enable
BM_LFRCPM    EQU (1<<LFRCPM)       

LFTON       EQU 3       ; LF On Time with Activated Standby Mode
BM_LFTON    EQU (1<<LFTON)       

LFTS0       EQU 4       ; LF Standby Time
BM_LFTS0    EQU (1<<LFTS0)       

LFTS1       EQU 5       ; LF Standby Time
BM_LFTS1    EQU (1<<LFTS1)       

LFTS2       EQU 6       ; LF Standby Time
BM_LFTS2    EQU (1<<LFTS2)       

LFSBEN       EQU 7       ; LF Standby mode Enable
BM_LFSBEN    EQU (1<<LFSBEN)       

; LFDSR1 - LF Receiver Decoder Setting Register 1
LOTHA0       EQU 0       ; Low Threshold A bit 0
BM_LOTHA0    EQU (1<<LOTHA0)       

LOTHA1       EQU 1       ; Low Threshold A bit 1
BM_LOTHA1    EQU (1<<LOTHA1)       

HITHA0       EQU 2       ; High Threshold A bit 0
BM_HITHA0    EQU (1<<HITHA0)       

HITHA1       EQU 3       ; High Threshold A bit 1
BM_HITHA1    EQU (1<<HITHA1)       

CTTHA0       EQU 4       ; Count Threshold A bit 0
BM_CTTHA0    EQU (1<<CTTHA0)       

CTTHA1       EQU 5       ; Count Threshold A bit 1
BM_CTTHA1    EQU (1<<CTTHA1)       

; LFDSR11 - Low Frequency Decoder Setting Register 11
TINITA0       EQU 0       ; Time Init A bit 0
BM_TINITA0    EQU (1<<TINITA0)       

TINITA1       EQU 1       ; Time Init A bit 1
BM_TINITA1    EQU (1<<TINITA1)       

TINITA2       EQU 2       ; Time Init A bit 2
BM_TINITA2    EQU (1<<TINITA2)       

