camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
TINITA3       EQU 3       ; Time Init A bit 3
BM_TINITA3    EQU (1<<TINITA3)       

TINITB0       EQU 4       ; Time Init B bit 0
BM_TINITB0    EQU (1<<TINITB0)       

TINITB1       EQU 5       ; Time Init B bit 1
BM_TINITB1    EQU (1<<TINITB1)       

TINITB2       EQU 6       ; Time Init B bit 2
BM_TINITB2    EQU (1<<TINITB2)       

TINITB3       EQU 7       ; Time Init B bit 3
BM_TINITB3    EQU (1<<TINITB3)       

; LFDSR2 - LF Receiver Decoder Setting Register 2
LOTHB0       EQU 0       ; Low Threshold B bit 0
BM_LOTHB0    EQU (1<<LOTHB0)       

LOTHB1       EQU 1       ; Low Threshold B bit 1
BM_LOTHB1    EQU (1<<LOTHB1)       

HITHB0       EQU 2       ; High Threshold B bit 0
BM_HITHB0    EQU (1<<HITHB0)       

HITHB1       EQU 3       ; High Threshold B bit 1
BM_HITHB1    EQU (1<<HITHB1)       

CTTHB0       EQU 4       ; Count Threshold B bit 0
BM_CTTHB0    EQU (1<<CTTHB0)       

CTTHB1       EQU 5       ; Count Threshold B bit 1
BM_CTTHB1    EQU (1<<CTTHB1)       

; LFDSR3 - LF Receiver Decoder Setting Register 3
PBDTH0       EQU 0       ; Preburst Detection Threshold bit 0
BM_PBDTH0    EQU (1<<PBDTH0)       

PBDTH1       EQU 1       ; Preburst Detection Threshold bit 1
BM_PBDTH1    EQU (1<<PBDTH1)       

QCTH0       EQU 3       ; Quality Check Threshold bit 0
BM_QCTH0    EQU (1<<QCTH0)       

QCTH1       EQU 4       ; Quality Check Threshold bit 1
BM_QCTH1    EQU (1<<QCTH1)       

QCTH2       EQU 5       ; Quality Check Threshold bit 2
BM_QCTH2    EQU (1<<QCTH2)       

; LFDSR4 - LF Receiver Decoder Setting Register 4
SDTHA0       EQU 0       ; Sync Detection Threshold A bit 0
BM_SDTHA0    EQU (1<<SDTHA0)       

SDTHA1       EQU 1       ; Sync Detection Threshold A bit 1
BM_SDTHA1    EQU (1<<SDTHA1)       

SDTHA2       EQU 2       ; Sync Detection Threshold A bit 2
BM_SDTHA2    EQU (1<<SDTHA2)       

SCTHA0       EQU 3       ; Sync Count Threshold A bit 0
BM_SCTHA0    EQU (1<<SCTHA0)       

SCTHA1       EQU 4       ; Sync Count Threshold A bit 1
BM_SCTHA1    EQU (1<<SCTHA1)       

SCTHA2       EQU 5       ; Sync Count Threshold A bit 2
BM_SCTHA2    EQU (1<<SCTHA2)       

SRSTC0       EQU 6       ; Sync Restart Control bit 0
BM_SRSTC0    EQU (1<<SRSTC0)       

SRSTC1       EQU 7       ; Sync Restart Control bit 1
BM_SRSTC1    EQU (1<<SRSTC1)       

; LFFR - LF Receiver Flag Register
LFSYDF       EQU 0       ; LF Synchronization Detect Flag
BM_LFSYDF    EQU (1<<LFSYDF)       

LFDEF       EQU 1       ; LF Decoder Error Flag
BM_LFDEF    EQU (1<<LFDEF)       

LFEOF       EQU 2       ; LF End of Telegram Flag
BM_LFEOF    EQU (1<<LFEOF)       

LFTOF       EQU 3       ; LF telegram Time Out Flag
BM_LFTOF    EQU (1<<LFTOF)       

LFSD       EQU 6       ; LF Signal Detect
BM_LFSD    EQU (1<<LFSD)       

LFES       EQU 7       ; LF Envelope Signal
BM_LFES    EQU (1<<LFES)       

; LFIMR - LF Receiver Interrupt Mask Register
LFSYDIM       EQU 0       ; LF Synchronization Detected Interrupt Mask
BM_LFSYDIM    EQU (1<<LFSYDIM)       

LFDEIM       EQU 1       ; LF Decoder Error Interrupt Mask
BM_LFDEIM    EQU (1<<LFDEIM)       

LFEOIM       EQU 2       ; LF End Of telegram Interrupt Mask
BM_LFEOIM    EQU (1<<LFEOIM)       

; LFQC1 - LF Receiver Channel 1 Quality Faktor Register
LFQS10       EQU 0       ; LF resistor select channel 1 bit 0
BM_LFQS10    EQU (1<<LFQS10)       

LFQS11       EQU 1       ; LF resistor select channel 1 bit 1
BM_LFQS11    EQU (1<<LFQS11)       

LFQS12       EQU 2       ; LF resistor select channel 1 bit 2
BM_LFQS12    EQU (1<<LFQS12)       

LFQS13       EQU 3       ; LF resistor select channel 1 bit 3
BM_LFQS13    EQU (1<<LFQS13)       

LFCS10       EQU 4       ; LF capacitor select channel 1 bit 0
BM_LFCS10    EQU (1<<LFCS10)       

LFCS11       EQU 5       ; LF capacitor select channel 1 bit 1
BM_LFCS11    EQU (1<<LFCS11)       

LFCS12       EQU 6       ; LF capacitor select channel 1 bit 2
BM_LFCS12    EQU (1<<LFCS12)       

LFCS13       EQU 7       ; LF capacitor select channel 1 bit 3
BM_LFCS13    EQU (1<<LFCS13)       

; LFQC2 - LF Receiver Channel 2 Quality Faktor Register
LFQS20       EQU 0       ; LF resistor select channel 2 bit 0
BM_LFQS20    EQU (1<<LFQS20)       

LFQS21       EQU 1       ; LF resistor select channel 2 bit 1
BM_LFQS21    EQU (1<<LFQS21)       

LFQS22       EQU 2       ; LF resistor select channel 2 bit 2
BM_LFQS22    EQU (1<<LFQS22)       

LFQS23       EQU 3       ; LF resistor select channel 2 bit 3
BM_LFQS23    EQU (1<<LFQS23)       

LFCS20       EQU 4       ; LF capacitor select channel 2 bit 0
BM_LFCS20    EQU (1<<LFCS20)       

LFCS21       EQU 5       ; LF capacitor select channel 2 bit 1
BM_LFCS21    EQU (1<<LFCS21)       

LFCS22       EQU 6       ; LF capacitor select channel 2 bit 2
BM_LFCS22    EQU (1<<LFCS22)       

LFCS23       EQU 7       ; LF capacitor select channel 2 bit 3
BM_LFCS23    EQU (1<<LFCS23)       

; LFQC3 - LF Receiver Channel 3 Quality Faktor Register
LFQS30       EQU 0       ; LF resistor select channel 3 bit 0
BM_LFQS30    EQU (1<<LFQS30)       

LFQS31       EQU 1       ; LF resistor select channel 3 bit 1
BM_LFQS31    EQU (1<<LFQS31)       

LFQS32       EQU 2       ; LF resistor select channel 3 bit 2
BM_LFQS32    EQU (1<<LFQS32)       

LFQS33       EQU 3       ; LF resistor select channel 3 bit 3
BM_LFQS33    EQU (1<<LFQS33)       

LFCS30       EQU 4       ; LF capacitor select channel 3 bit 0
BM_LFCS30    EQU (1<<LFCS30)       

LFCS31       EQU 5       ; LF capacitor select channel 3 bit 1
BM_LFCS31    EQU (1<<LFCS31)       

LFCS32       EQU 6       ; LF capacitor select channel 3 bit 2
BM_LFCS32    EQU (1<<LFCS32)       

LFCS33       EQU 7       ; LF capacitor select channel 3 bit 3
BM_LFCS33    EQU (1<<LFCS33)       

; LFSTOP - LF Receiver Stop Bit Register
LFSTSY0       EQU 0       ; LF Stop Bits Symbols bit 0
BM_LFSTSY0    EQU (1<<LFSTSY0)       

LFSTSY1       EQU 1       ; LF Stop Bits Symbols bit 1
BM_LFSTSY1    EQU (1<<LFSTSY1)       

LFSTSY2       EQU 2       ; LF Stop Bits Symbols bit 2
BM_LFSTSY2    EQU (1<<LFSTSY2)       

LFSTSY3       EQU 3       ; LF Stop Bits Symbols bit 3
BM_LFSTSY3    EQU (1<<LFSTSY3)       

LFSTL0       EQU 4       ; LF Stop Bits Length bit 0
BM_LFSTL0    EQU (1<<LFSTL0)       

LFSTL1       EQU 5       ; LF Stop Bits Length bit 1
BM_LFSTL1    EQU (1<<LFSTL1)       

LFSTL2       EQU 6       ; LF Stop Bits Length bit 2
BM_LFSTL2    EQU (1<<LFSTL2)       

