camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
; LFSYLE - LF Receiver Synchronization Length Register
LFSYLE0       EQU 0       ; 
BM_LFSYLE0    EQU (1<<LFSYLE0)       

LFSYLE1       EQU 1       ; 
BM_LFSYLE1    EQU (1<<LFSYLE1)       

LFSYLE2       EQU 2       ; 
BM_LFSYLE2    EQU (1<<LFSYLE2)       

LFSYLE3       EQU 3       ; 
BM_LFSYLE3    EQU (1<<LFSYLE3)       

LFSYLE4       EQU 4       ; 
BM_LFSYLE4    EQU (1<<LFSYLE4)       

LFSYLE5       EQU 5       ; 
BM_LFSYLE5    EQU (1<<LFSYLE5)       

; ***** LF_RSSI **********************
; RSCALIB - RSSI Calibration Register
RSCALIB0       EQU 0       ; RSSI Calibration Bit 0
BM_RSCALIB0    EQU (1<<RSCALIB0)       

RSCALIB1       EQU 1       ; RSSI Calibration Bit 1
BM_RSCALIB1    EQU (1<<RSCALIB1)       

RSCALIB2       EQU 2       ; RSSI Calibration Bit 2
BM_RSCALIB2    EQU (1<<RSCALIB2)       

RSCALIB3       EQU 3       ; RSSI Calibration Bit 3
BM_RSCALIB3    EQU (1<<RSCALIB3)       

RSCALIB4       EQU 4       ; RSSI Calibration Bit 4
BM_RSCALIB4    EQU (1<<RSCALIB4)       

RSCALIB5       EQU 5       ; RSSI Calibration Bit 5
BM_RSCALIB5    EQU (1<<RSCALIB5)       

RSCALIB6       EQU 6       ; RSSI Calibration Bit 6
BM_RSCALIB6    EQU (1<<RSCALIB6)       

RSCALIB7       EQU 7       ; RSSI Calibration Bit 7
BM_RSCALIB7    EQU (1<<RSCALIB7)       

; RSCR - RSSI Control Register
RSSDEN       EQU 0       ; RSSI Sign Detection Enable Bit
BM_RSSDEN    EQU (1<<RSSDEN)       

RSOS       EQU 1       ; RSSI Operation Start Bit
BM_RSOS    EQU (1<<RSOS)       

RSEOR       EQU 2       ; RSSI End Operation Request Bit
BM_RSEOR    EQU (1<<RSEOR)       

RSOFM       EQU 3       ; RSSI Operation Flag Mask Bit
BM_RSOFM    EQU (1<<RSOFM)       

RSMODE0       EQU 4       ; RSSI Mode Bit 0
BM_RSMODE0    EQU (1<<RSMODE0)       

RSMODE1       EQU 5       ; RSSI Mode Bit 1
BM_RSMODE1    EQU (1<<RSMODE1)       

RSRES       EQU 7       ; RSSI Reset Bit
BM_RSRES    EQU (1<<RSRES)       

; RSDBGR - RSSI Debug Register
RSSANA       EQU 0       ; RSSI Set Analog Bit
BM_RSSANA    EQU (1<<RSSANA)       

RSINFM       EQU 2       ; RSSI Infinity Measurement Bit
BM_RSINFM    EQU (1<<RSINFM)       

RSFPD       EQU 3       ; RSSI Fix Pre-Divider Bit
BM_RSFPD    EQU (1<<RSFPD)       

RSHOME       EQU 4       ; RSSI Hold Measurement Bit
BM_RSHOME    EQU (1<<RSHOME)       

RSDBGS0       EQU 5       ; RSSI Debug Select Bit 0
BM_RSDBGS0    EQU (1<<RSDBGS0)       

RSDBGS1       EQU 6       ; RSSI Debug Select Bit 1
BM_RSDBGS1    EQU (1<<RSDBGS1)       

RSDBGEN       EQU 7       ; RSSI Debug Enable Bit
BM_RSDBGEN    EQU (1<<RSDBGEN)       

; RSDLYR - RSSI Delay Register
RSTRD0       EQU 0       ; RSSI Tracking Delay Bit 0
BM_RSTRD0    EQU (1<<RSTRD0)       

RSTRD1       EQU 1       ; RSSI Tracking Delay Bit 1
BM_RSTRD1    EQU (1<<RSTRD1)       

RSTRD2       EQU 2       ; RSSI Tracking Delay Bit 2
BM_RSTRD2    EQU (1<<RSTRD2)       

RSTRD3       EQU 3       ; RSSI Tracking Delay Bit 3
BM_RSTRD3    EQU (1<<RSTRD3)       

RSTRD4       EQU 4       ; RSSI Tracking Delay Bit 4
BM_RSTRD4    EQU (1<<RSTRD4)       

RSTRD5       EQU 5       ; RSSI Tracking Delay Bit 5
BM_RSTRD5    EQU (1<<RSTRD5)       

RSRD0       EQU 6       ; RSSI Range Delay Bit 0
BM_RSRD0    EQU (1<<RSRD0)       

RSRD1       EQU 7       ; RSSI Range Delay Bit 1
BM_RSRD1    EQU (1<<RSRD1)       

; RSFR - RSSI Flag Register
RSOOR1       EQU 0       ; RSSI Out of Range Channel 1 Bit
BM_RSOOR1    EQU (1<<RSOOR1)       

RSOOR2       EQU 1       ; RSSI Out of Range Channel 2 Bit
BM_RSOOR2    EQU (1<<RSOOR2)       

RSOOR3       EQU 2       ; RSSI Out of Range Channel 3 Bit
BM_RSOOR3    EQU (1<<RSOOR3)       

RSOFF       EQU 3       ; RSSI Operation Finish Flag Bit
BM_RSOFF    EQU (1<<RSOFF)       

RSAOOR1       EQU 5       ; RSSI Averaging Out of Range Channel 1 Bit
BM_RSAOOR1    EQU (1<<RSAOOR1)       

RSAOOR2       EQU 6       ; RSSI Averaging Out of Range Channel 2 Bit
BM_RSAOOR2    EQU (1<<RSAOOR2)       

RSAOOR3       EQU 7       ; RSSI Averaging Out of Range Channel 3 Bit
BM_RSAOOR3    EQU (1<<RSAOOR3)       

; RSMS1R - RSSI Measurement Setting 1 Register
RSCH1E       EQU 0       ; RSSI Channel 1 Enable Bit
BM_RSCH1E    EQU (1<<RSCH1E)       

RSCH2E       EQU 1       ; RSSI Channel 2 Enable Bit
BM_RSCH2E    EQU (1<<RSCH2E)       

RSCH3E       EQU 2       ; RSSI Channel 3 Enable Bit
BM_RSCH3E    EQU (1<<RSCH3E)       

RSINTM       EQU 3       ; RSSI internal Measurement Bit
BM_RSINTM    EQU (1<<RSINTM)       

RSSTIM       EQU 4       ; RSSI Stimulus Bit
BM_RSSTIM    EQU (1<<RSSTIM)       

RSCMS       EQU 5       ; RSSI Current Mode Select Bit
BM_RSCMS    EQU (1<<RSCMS)       

RSSSV       EQU 6       ; RSSI Show Sample Value Bit
BM_RSSSV    EQU (1<<RSSSV)       

RSSCAL       EQU 7       ; RSSI Set Calibration Bit
BM_RSSCAL    EQU (1<<RSSCAL)       

; RSMS2R - RSSI Measurement Setting 2 Register
RSSADR0       EQU 0       ; RSSI Sample Address Bit 0
BM_RSSADR0    EQU (1<<RSSADR0)       

RSSADR1       EQU 1       ; RSSI Sample Address Bit 1
BM_RSSADR1    EQU (1<<RSSADR1)       

RSSADR2       EQU 2       ; RSSI Sample Address Bit 2
BM_RSSADR2    EQU (1<<RSSADR2)       

RSSADR3       EQU 3       ; RSSI Sample Address Bit 3
BM_RSSADR3    EQU (1<<RSSADR3)       

RSAVGS0       EQU 4       ; RSSI Average Select Bit 0
BM_RSAVGS0    EQU (1<<RSAVGS0)       

RSAVGS1       EQU 5       ; RSSI Average Select Bit 1
BM_RSAVGS1    EQU (1<<RSAVGS1)       

RSAVGS2       EQU 6       ; RSSI Average Select Bit 2
BM_RSAVGS2    EQU (1<<RSAVGS2)       

RSAVGS3       EQU 7       ; RSSI Average Select Bit 3
BM_RSAVGS3    EQU (1<<RSAVGS3)       

; RSRES1H - RSSI Result 1 High Byte Register
RSRES1H0       EQU 0       ; RSSI Result 1 High Byte Bit 0
BM_RSRES1H0    EQU (1<<RSRES1H0)       

RSRES1H1       EQU 1       ; RSSI Result 1 High Byte Bit 1
BM_RSRES1H1    EQU (1<<RSRES1H1)       

RSRES1H2       EQU 2       ; RSSI Result 1 High Byte Bit 2
BM_RSRES1H2    EQU (1<<RSRES1H2)       

RSRES1H3       EQU 3       ; RSSI Result 1 High Byte Bit 3
BM_RSRES1H3    EQU (1<<RSRES1H3)       

RSRES1H4       EQU 4       ; RSSI Result 1 High Byte Bit 4
BM_RSRES1H4    EQU (1<<RSRES1H4)       

RSRES1H5       EQU 5       ; RSSI Result 1 High Byte Bit 5
BM_RSRES1H5    EQU (1<<RSRES1H5)       

RSRES1H6       EQU 6       ; RSSI Result 1 High Byte Bit 6
BM_RSRES1H6    EQU (1<<RSRES1H6)       

RSRES1H7       EQU 7       ; RSSI Result 1 High Byte Bit 7
BM_RSRES1H7    EQU (1<<RSRES1H7)       

; RSRES1L - RSSI Result 1 Low Byte Register
RSRES1L0       EQU 0       ; RSSI Result 1 Low Byte Bit 0
BM_RSRES1L0    EQU (1<<RSRES1L0)       

