camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
RSRES1L1       EQU 1       ; RSSI Result 1 Low Byte Bit 1
BM_RSRES1L1    EQU (1<<RSRES1L1)       

RSRES1L2       EQU 2       ; RSSI Result 1 Low Byte Bit 2
BM_RSRES1L2    EQU (1<<RSRES1L2)       

RSRES1L3       EQU 3       ; RSSI Result 1 Low Byte Bit 3
BM_RSRES1L3    EQU (1<<RSRES1L3)       

RSRES1L4       EQU 4       ; RSSI Result 1 Low Byte Bit 4
BM_RSRES1L4    EQU (1<<RSRES1L4)       

RSRES1L5       EQU 5       ; RSSI Result 1 Low Byte Bit 5
BM_RSRES1L5    EQU (1<<RSRES1L5)       

RSRES1L6       EQU 6       ; RSSI Result 1 Low Byte Bit 6
BM_RSRES1L6    EQU (1<<RSRES1L6)       

RSRES1L7       EQU 7       ; RSSI Result 1 Low Byte Bit 7
BM_RSRES1L7    EQU (1<<RSRES1L7)       

; RSRES2H - RSSI Result 2 High Byte Register
RSRES2H0       EQU 0       ; RSSI Result 2 High Byte Bit 0
BM_RSRES2H0    EQU (1<<RSRES2H0)       

RSRES2H1       EQU 1       ; RSSI Result 2 High Byte Bit 1
BM_RSRES2H1    EQU (1<<RSRES2H1)       

RSRES2H2       EQU 2       ; RSSI Result 2 High Byte Bit 2
BM_RSRES2H2    EQU (1<<RSRES2H2)       

RSRES2H3       EQU 3       ; RSSI Result 2 High Byte Bit 3
BM_RSRES2H3    EQU (1<<RSRES2H3)       

RSRES2H4       EQU 4       ; RSSI Result 2 High Byte Bit 4
BM_RSRES2H4    EQU (1<<RSRES2H4)       

RSRES2H5       EQU 5       ; RSSI Result 2 High Byte Bit 5
BM_RSRES2H5    EQU (1<<RSRES2H5)       

RSRES2H6       EQU 6       ; RSSI Result 2 High Byte Bit 6
BM_RSRES2H6    EQU (1<<RSRES2H6)       

RSRES2H7       EQU 7       ; RSSI Result 2 High Byte Bit 7
BM_RSRES2H7    EQU (1<<RSRES2H7)       

; RSRES2L - RSSI Result 2 Low Byte Register
RSRES2L0       EQU 0       ; RSSI Result 2 Low Byte Bit 0
BM_RSRES2L0    EQU (1<<RSRES2L0)       

RSRES2L1       EQU 1       ; RSSI Result 2 Low Byte Bit 1
BM_RSRES2L1    EQU (1<<RSRES2L1)       

RSRES2L2       EQU 2       ; RSSI Result 2 Low Byte Bit 2
BM_RSRES2L2    EQU (1<<RSRES2L2)       

RSRES2L3       EQU 3       ; RSSI Result 2 Low Byte Bit 3
BM_RSRES2L3    EQU (1<<RSRES2L3)       

RSRES2L4       EQU 4       ; RSSI Result 2 Low Byte Bit 4
BM_RSRES2L4    EQU (1<<RSRES2L4)       

RSRES2L5       EQU 5       ; RSSI Result 2 Low Byte Bit 5
BM_RSRES2L5    EQU (1<<RSRES2L5)       

RSRES2L6       EQU 6       ; RSSI Result 2 Low Byte Bit 6
BM_RSRES2L6    EQU (1<<RSRES2L6)       

RSRES2L7       EQU 7       ; RSSI Result 2 Low Byte Bit 7
BM_RSRES2L7    EQU (1<<RSRES2L7)       

; RSRES3H - RSSI Result 3 High Byte Register
RSRES3H0       EQU 0       ; RSSI Result 3 High Byte Bit 0
BM_RSRES3H0    EQU (1<<RSRES3H0)       

RSRES3H1       EQU 1       ; RSSI Result 3 High Byte Bit 1
BM_RSRES3H1    EQU (1<<RSRES3H1)       

RSRES3H2       EQU 2       ; RSSI Result 3 High Byte Bit 2
BM_RSRES3H2    EQU (1<<RSRES3H2)       

RSRES3H3       EQU 3       ; RSSI Result 3 High Byte Bit 3
BM_RSRES3H3    EQU (1<<RSRES3H3)       

RSRES3H4       EQU 4       ; RSSI Result 3 High Byte Bit 4
BM_RSRES3H4    EQU (1<<RSRES3H4)       

RSRES3H5       EQU 5       ; RSSI Result 3 High Byte Bit 5
BM_RSRES3H5    EQU (1<<RSRES3H5)       

RSRES3H6       EQU 6       ; RSSI Result 3 High Byte Bit 6
BM_RSRES3H6    EQU (1<<RSRES3H6)       

RSRES3H7       EQU 7       ; RSSI Result 3 High Byte Bit 7
BM_RSRES3H7    EQU (1<<RSRES3H7)       

; RSRES3L - RSSI Result 3 Low Byte Register
RSRES3L0       EQU 0       ; RSSI Result 3 Low Byte Bit 0
BM_RSRES3L0    EQU (1<<RSRES3L0)       

RSRES3L1       EQU 1       ; RSSI Result 3 Low Byte Bit 1
BM_RSRES3L1    EQU (1<<RSRES3L1)       

RSRES3L2       EQU 2       ; RSSI Result 3 Low Byte Bit 2
BM_RSRES3L2    EQU (1<<RSRES3L2)       

RSRES3L3       EQU 3       ; RSSI Result 3 Low Byte Bit 3
BM_RSRES3L3    EQU (1<<RSRES3L3)       

RSRES3L4       EQU 4       ; RSSI Result 3 Low Byte Bit 4
BM_RSRES3L4    EQU (1<<RSRES3L4)       

RSRES3L5       EQU 5       ; RSSI Result 3 Low Byte Bit 5
BM_RSRES3L5    EQU (1<<RSRES3L5)       

RSRES3L6       EQU 6       ; RSSI Result 3 Low Byte Bit 6
BM_RSRES3L6    EQU (1<<RSRES3L6)       

RSRES3L7       EQU 7       ; RSSI Result 3 Low Byte Bit 7
BM_RSRES3L7    EQU (1<<RSRES3L7)       

; RSRES4H - RSSI Result 4 High Byte Register
RSRES4H0       EQU 0       ; RSSI Result 4 High Byte Bit 0
BM_RSRES4H0    EQU (1<<RSRES4H0)       

RSRES4H1       EQU 1       ; RSSI Result 4 High Byte Bit 1
BM_RSRES4H1    EQU (1<<RSRES4H1)       

RSRES4H2       EQU 2       ; RSSI Result 4 High Byte Bit 2
BM_RSRES4H2    EQU (1<<RSRES4H2)       

RSRES4H3       EQU 3       ; RSSI Result 4 High Byte Bit 3
BM_RSRES4H3    EQU (1<<RSRES4H3)       

RSRES4H4       EQU 4       ; RSSI Result 4 High Byte Bit 4
BM_RSRES4H4    EQU (1<<RSRES4H4)       

RSRES4H5       EQU 5       ; RSSI Result 4 High Byte Bit 5
BM_RSRES4H5    EQU (1<<RSRES4H5)       

RSRES4H6       EQU 6       ; RSSI Result 4 High Byte Bit 6
BM_RSRES4H6    EQU (1<<RSRES4H6)       

RSRES4H7       EQU 7       ; RSSI Result 4 High Byte Bit 7
BM_RSRES4H7    EQU (1<<RSRES4H7)       

; RSRES4L - RSSI Result 4 Low Byte Register
RSRES4L0       EQU 0       ; RSSI Result 4 Low Byte Bit 0
BM_RSRES4L0    EQU (1<<RSRES4L0)       

RSRES4L1       EQU 1       ; RSSI Result 4 Low Byte Bit 1
BM_RSRES4L1    EQU (1<<RSRES4L1)       

RSRES4L2       EQU 2       ; RSSI Result 4 Low Byte Bit 2
BM_RSRES4L2    EQU (1<<RSRES4L2)       

RSRES4L3       EQU 3       ; RSSI Result 4 Low Byte Bit 3
BM_RSRES4L3    EQU (1<<RSRES4L3)       

RSRES4L4       EQU 4       ; RSSI Result 4 Low Byte Bit 4
BM_RSRES4L4    EQU (1<<RSRES4L4)       

RSRES4L5       EQU 5       ; RSSI Result 4 Low Byte Bit 5
BM_RSRES4L5    EQU (1<<RSRES4L5)       

RSRES4L6       EQU 6       ; RSSI Result 4 Low Byte Bit 6
BM_RSRES4L6    EQU (1<<RSRES4L6)       

RSRES4L7       EQU 7       ; RSSI Result 4 Low Byte Bit 7
BM_RSRES4L7    EQU (1<<RSRES4L7)       

; RSSR - RSSI Status Register
RSRDY       EQU 0       ; RSSI Ready Bit
BM_RSRDY    EQU (1<<RSRDY)       

RSSVLD       EQU 1       ; RSSI Sample Valid Bit
BM_RSSVLD    EQU (1<<RSSVLD)       

; RSSRCR - RSSI SRC Calibration Register
SRCMODE0       EQU 0       ; RSSI SRC Calibration Mode Bit 0
BM_SRCMODE0    EQU (1<<SRCMODE0)       

SRCMODE1       EQU 1       ; RSSI SRC Calibration Mode Bit 1
BM_SRCMODE1    EQU (1<<SRCMODE1)       

