camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
SRCMIN0       EQU 2       ; RSSI SRC Minimum Value Bit 0
BM_SRCMIN0    EQU (1<<SRCMIN0)       

SRCMIN1       EQU 3       ; RSSI SRC Minimum Value Bit 1
BM_SRCMIN1    EQU (1<<SRCMIN1)       

SRCCLR       EQU 4       ; RSSI SRC Clear Bit
BM_SRCCLR    EQU (1<<SRCCLR)       

SRCSTEP0       EQU 6       ; RSSI SRC Step Bit 0
BM_SRCSTEP0    EQU (1<<SRCSTEP0)       

SRCSTEP1       EQU 7       ; RSSI SRC Step Bit 1
BM_SRCSTEP1    EQU (1<<SRCSTEP1)       

; SD12RR - Sign Detection Channel 1 vs 2 Result Register
SD12RR0       EQU 0       ; Sign Detection Channel 1 vs 2 Result Bit 0
BM_SD12RR0    EQU (1<<SD12RR0)       

SD12RR1       EQU 1       ; Sign Detection Channel 1 vs 2 Result Bit 1
BM_SD12RR1    EQU (1<<SD12RR1)       

SD12RR2       EQU 2       ; Sign Detection Channel 1 vs 2 Result Bit 2
BM_SD12RR2    EQU (1<<SD12RR2)       

SD12RR3       EQU 3       ; Sign Detection Channel 1 vs 2 Result Bit 3
BM_SD12RR3    EQU (1<<SD12RR3)       

SD12RR4       EQU 4       ; Sign Detection Channel 1 vs 2 Result Bit 4
BM_SD12RR4    EQU (1<<SD12RR4)       

SD12RR5       EQU 5       ; Sign Detection Channel 1 vs 2 Result Bit 5
BM_SD12RR5    EQU (1<<SD12RR5)       

SD12RR6       EQU 6       ; Sign Detection Channel 1 vs 2 Result Bit 6
BM_SD12RR6    EQU (1<<SD12RR6)       

SD12RR7       EQU 7       ; Sign Detection Channel 1 vs 2 Result Bit 7
BM_SD12RR7    EQU (1<<SD12RR7)       

; SD13RR - Sign Detection Channel 1 vs 3 Result Register
SD13RR0       EQU 0       ; Sign Detection Channel 1 vs 3 Result Bit 0
BM_SD13RR0    EQU (1<<SD13RR0)       

SD13RR1       EQU 1       ; Sign Detection Channel 1 vs 3 Result Bit 1
BM_SD13RR1    EQU (1<<SD13RR1)       

SD13RR2       EQU 2       ; Sign Detection Channel 1 vs 3 Result Bit 2
BM_SD13RR2    EQU (1<<SD13RR2)       

SD13RR3       EQU 3       ; Sign Detection Channel 1 vs 3 Result Bit 3
BM_SD13RR3    EQU (1<<SD13RR3)       

SD13RR4       EQU 4       ; Sign Detection Channel 1 vs 3 Result Bit 4
BM_SD13RR4    EQU (1<<SD13RR4)       

SD13RR5       EQU 5       ; Sign Detection Channel 1 vs 3 Result Bit 5
BM_SD13RR5    EQU (1<<SD13RR5)       

SD13RR6       EQU 6       ; Sign Detection Channel 1 vs 3 Result Bit 6
BM_SD13RR6    EQU (1<<SD13RR6)       

SD13RR7       EQU 7       ; Sign Detection Channel 1 vs 3 Result Bit 7
BM_SD13RR7    EQU (1<<SD13RR7)       

; SD23RR - Sign Detection Channel 2 vs 3 Result Register
SD23RR0       EQU 0       ; Sign Detection Channel 2 vs 3 Result Bit 0
BM_SD23RR0    EQU (1<<SD23RR0)       

SD23RR1       EQU 1       ; Sign Detection Channel 2 vs 3 Result Bit 1
BM_SD23RR1    EQU (1<<SD23RR1)       

SD23RR2       EQU 2       ; Sign Detection Channel 2 vs 3 Result Bit 2
BM_SD23RR2    EQU (1<<SD23RR2)       

SD23RR3       EQU 3       ; Sign Detection Channel 2 vs 3 Result Bit 3
BM_SD23RR3    EQU (1<<SD23RR3)       

SD23RR4       EQU 4       ; Sign Detection Channel 2 vs 3 Result Bit 4
BM_SD23RR4    EQU (1<<SD23RR4)       

SD23RR5       EQU 5       ; Sign Detection Channel 2 vs 3 Result Bit 5
BM_SD23RR5    EQU (1<<SD23RR5)       

SD23RR6       EQU 6       ; Sign Detection Channel 2 vs 3 Result Bit 6
BM_SD23RR6    EQU (1<<SD23RR6)       

SD23RR7       EQU 7       ; Sign Detection Channel 2 vs 3 Result Bit 7
BM_SD23RR7    EQU (1<<SD23RR7)       

; SD360R - Sign Detection 360 Degree Result Register
SD360R0       EQU 0       ; Sign Detection 360 Degree Result Bit 0
BM_SD360R0    EQU (1<<SD360R0)       

SD360R1       EQU 1       ; Sign Detection 360 Degree Result Bit 1
BM_SD360R1    EQU (1<<SD360R1)       

SD360R2       EQU 2       ; Sign Detection 360 Degree Result Bit 2
BM_SD360R2    EQU (1<<SD360R2)       

SD360R3       EQU 3       ; Sign Detection 360 Degree Result Bit 3
BM_SD360R3    EQU (1<<SD360R3)       

SD360R4       EQU 4       ; Sign Detection 360 Degree Result Bit 4
BM_SD360R4    EQU (1<<SD360R4)       

SD360R5       EQU 5       ; Sign Detection 360 Degree Result Bit 5
BM_SD360R5    EQU (1<<SD360R5)       

SD360R6       EQU 6       ; Sign Detection 360 Degree Result Bit 6
BM_SD360R6    EQU (1<<SD360R6)       

SD360R7       EQU 7       ; Sign Detection 360 Degree Result Bit 7
BM_SD360R7    EQU (1<<SD360R7)       

; ***** LF_TIMER *********************
; LTCMR - LF Timer Control Mode Register
LTPS0       EQU 0       ; LF Timer Prescaler Select bit 0
BM_LTPS0    EQU (1<<LTPS0)       

LTPS1       EQU 1       ; LF Timer Prescaler Select bit 1
BM_LTPS1    EQU (1<<LTPS1)       

LTPS2       EQU 2       ; LF Timer Prescaler Select bit 2
BM_LTPS2    EQU (1<<LTPS2)       

LTCRM       EQU 3       ; LF Timer Compare Reset Mask
BM_LTCRM    EQU (1<<LTCRM)       

LTCIM       EQU 4       ; LF Timer Compare Interrupt Mask
BM_LTCIM    EQU (1<<LTCIM)       

LTCM       EQU 5       ; LF Timer Continuous Mode
BM_LTCM    EQU (1<<LTCM)       

LTSM       EQU 6       ; LF Timer Start Mode
BM_LTSM    EQU (1<<LTSM)       

LTENA       EQU 7       ; LF Timer Enable
BM_LTENA    EQU (1<<LTENA)       

; LTCOR - LF Timer Compare Register
LTCOR0       EQU 0       ; 
BM_LTCOR0    EQU (1<<LTCOR0)       

LTCOR1       EQU 1       ; 
BM_LTCOR1    EQU (1<<LTCOR1)       

LTCOR2       EQU 2       ; 
BM_LTCOR2    EQU (1<<LTCOR2)       

LTCOR3       EQU 3       ; 
BM_LTCOR3    EQU (1<<LTCOR3)       

LTCOR4       EQU 4       ; 
BM_LTCOR4    EQU (1<<LTCOR4)       

LTCOR5       EQU 5       ; 
BM_LTCOR5    EQU (1<<LTCOR5)       

LTCOR6       EQU 6       ; 
BM_LTCOR6    EQU (1<<LTCOR6)       

LTCOR7       EQU 7       ; 
BM_LTCOR7    EQU (1<<LTCOR7)       

; LTEMR - LF Timer Event Mask Register
ID0EM       EQU 0       ; ID0 Event Mask
BM_ID0EM    EQU (1<<ID0EM)       

ID1EM       EQU 1       ; ID1 Event Mask
BM_ID1EM    EQU (1<<ID1EM)       

IDFEM       EQU 2       ; Identifier Frame Event Mask
BM_IDFEM    EQU (1<<IDFEM)       

DFEM       EQU 3       ; Data Frame end reached Event Mask
BM_DFEM    EQU (1<<DFEM)       

TBLEM       EQU 4       ; Telegram Bit Length reached Event Mask
BM_TBLEM    EQU (1<<TBLEM)       

FLEM       EQU 5       ; Fill Level reached Event Mask
BM_FLEM    EQU (1<<FLEM)       

EOFEM       EQU 6       ; End OF telegram Event Mask
BM_EOFEM    EQU (1<<EOFEM)       

LTCOF       EQU 7       ; LF Timer Compare Flag
BM_LTCOF    EQU (1<<LTCOF)       

; ***** LF_TRANSPONDER ***************
; TPCR1 - Transponder Control Register 1
TPQPLM       EQU 2       ; Transponder Quadrature Pulse Length Operation Modulation
BM_TPQPLM    EQU (1<<TPQPLM)       

TPBR       EQU 4       ; Transponder Bit Rate
BM_TPBR    EQU (1<<TPBR)       

TPDFCP0       EQU 5       ; Transponder Decoder Field Clock Prescaler value bit 0
BM_TPDFCP0    EQU (1<<TPDFCP0)       

TPDFCP1       EQU 6       ; Transponder Decoder Field Clock Prescaler value bit 1
BM_TPDFCP1    EQU (1<<TPDFCP1)       

TPMODE       EQU 7       ; Transponder Mode
BM_TPMODE    EQU (1<<TPMODE)       

