camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
; TPCR2 - Transponder Control 2 Register
TPMA       EQU 0       ; Transponder Mode Acknowledge
BM_TPMA    EQU (1<<TPMA)       

TPMOD       EQU 1       ; Transponder Modulation
BM_TPMOD    EQU (1<<TPMOD)       

TPPSD       EQU 2       ; Transponder Power Switch Disable
BM_TPPSD    EQU (1<<TPPSD)       

TPD       EQU 3       ; Transponder Disable
BM_TPD    EQU (1<<TPD)       

TPNFTO       EQU 4       ; Transponder No Field Timeout enable
BM_TPNFTO    EQU (1<<TPNFTO)       

TPWDLV0       EQU 5       ; Transponder watch dog value for No Field timeout (with SRC clk) bit 0
BM_TPWDLV0    EQU (1<<TPWDLV0)       

TPWDLV1       EQU 6       ; Transponder watch dog value for No Field timeout (with SRC clk) bit 1
BM_TPWDLV1    EQU (1<<TPWDLV1)       

; TPCR3 - Transponder Control Register 3
TPTD       EQU 0       ; Transponder Transmit Data
BM_TPTD    EQU (1<<TPTD)       

TPRD       EQU 1       ; Transponder Receive Data
BM_TPRD    EQU (1<<TPRD)       

TPTLIW       EQU 2       ; Transponder Transmit Listen Window
BM_TPTLIW    EQU (1<<TPTLIW)       

TPRCD       EQU 5       ; Transponder Reception Continuous Damping
BM_TPRCD    EQU (1<<TPRCD)       

; TPCR4 - Transponder Control Register 4
TPBCCS0       EQU 0       ; Transponder Battery Charge Current Select bit 0
BM_TPBCCS0    EQU (1<<TPBCCS0)       

TPBCCS1       EQU 1       ; Transponder Battery Charge Current Select bit 1
BM_TPBCCS1    EQU (1<<TPBCCS1)       

TPBCCS2       EQU 2       ; Transponder Battery Charge Current Select bit 2
BM_TPBCCS2    EQU (1<<TPBCCS2)       

TPBCCS3       EQU 3       ; Transponder Battery Charge Current Select bit 3
BM_TPBCCS3    EQU (1<<TPBCCS3)       

TPBCM       EQU 4       ; Transponder Battery Charge Mode
BM_TPBCM    EQU (1<<TPBCM)       

; TPCR5 - Transponder Control Register 5
TPMUD0       EQU 0       ; Transponder Modulation Undamped Level Select bit 0
BM_TPMUD0    EQU (1<<TPMUD0)       

TPMUD1       EQU 1       ; Transponder Modulation Undamped Level Select bit 1
BM_TPMUD1    EQU (1<<TPMUD1)       

TPMUD2       EQU 2       ; Transponder Modulation Undamped Level Select bit 2
BM_TPMUD2    EQU (1<<TPMUD2)       

TPMD0       EQU 4       ; Transponder Modulation Damping Select bit 0
BM_TPMD0    EQU (1<<TPMD0)       

TPMD1       EQU 5       ; Transponder Modulation Damping Select bit 1
BM_TPMD1    EQU (1<<TPMD1)       

TPMD2       EQU 6       ; Transponder Modulation Damping Select bit 2
BM_TPMD2    EQU (1<<TPMD2)       

; TPECMR - Transponder Encoder Mode Register
TPECM10       EQU 0       ; Transponder Encoder Mode 1 bit 0
BM_TPECM10    EQU (1<<TPECM10)       

TPECM11       EQU 1       ; Transponder Encoder Mode 1 bit 1
BM_TPECM11    EQU (1<<TPECM11)       

TPECM20       EQU 2       ; Transponder Encoder Mode 2 bit 0
BM_TPECM20    EQU (1<<TPECM20)       

TPECM21       EQU 3       ; Transponder Encoder Mode 2 bit 1
BM_TPECM21    EQU (1<<TPECM21)       

TPECM30       EQU 4       ; Transponder Encoder Mode 3 bit 0
BM_TPECM30    EQU (1<<TPECM30)       

TPECM31       EQU 5       ; Transponder Encoder Mode 3 bit 1
BM_TPECM31    EQU (1<<TPECM31)       

TPECM40       EQU 6       ; Transponder Encoder Mode 4 bit 0
BM_TPECM40    EQU (1<<TPECM40)       

TPECM41       EQU 7       ; Transponder Encoder Mode 4 bit 1
BM_TPECM41    EQU (1<<TPECM41)       

; TPFR - Transponder Flag Register
TPF       EQU 0       ; Transponder Flag
BM_TPF    EQU (1<<TPF)       

TPFTF       EQU 1       ; Transponder Field Timeout Flag
BM_TPFTF    EQU (1<<TPFTF)       

TPNFTF       EQU 2       ; Transponder No Field Timeout Flag
BM_TPNFTF    EQU (1<<TPNFTF)       

TPBERF       EQU 3       ; Transponder Bit Error Flag
BM_TPBERF    EQU (1<<TPBERF)       

; TPIMR - Transponder Interrupt Mask Register
TPIM       EQU 0       ; Transponder Interrupt Mask
BM_TPIM    EQU (1<<TPIM)       

TPFTIM       EQU 1       ; Transponder Field Timeout Interrupt Mask
BM_TPFTIM    EQU (1<<TPFTIM)       

TPNFTIM       EQU 2       ; Transponder No Field Timeout Interrupt Mask
BM_TPNFTIM    EQU (1<<TPNFTIM)       

TPBERIM       EQU 3       ; Transponder Bit Error Interrupt Mask
BM_TPBERIM    EQU (1<<TPBERIM)       

; TPSR - Transponder Status Register
TPA       EQU 0       ; Transponder Active
BM_TPA    EQU (1<<TPA)       

TPGAP       EQU 1       ; Transponder GAP Signal
BM_TPGAP    EQU (1<<TPGAP)       

TPPSW       EQU 2       ; Transponder Power Switch
BM_TPPSW    EQU (1<<TPPSW)       

TPBCOK       EQU 3       ; Transponder Battery Charge OK
BM_TPBCOK    EQU (1<<TPBCOK)       

; ***** MEM **************************
; EEST - EEPROM Status Register
EESYN0       EQU 0       ; EEPROM Syndrome bit 0
BM_EESYN0    EQU (1<<EESYN0)       

EESYN1       EQU 1       ; EEPROM Syndrome bit 1
BM_EESYN1    EQU (1<<EESYN1)       

EESYN2       EQU 2       ; EEPROM Syndrome bit 2
BM_EESYN2    EQU (1<<EESYN2)       

EESYN3       EQU 3       ; EEPROM Syndrome bit 3
BM_EESYN3    EQU (1<<EESYN3)       

; PGMST - Program Memory Status Register
PGMSYN0       EQU 0       ; Program Memory Syndrome bit 0
BM_PGMSYN0    EQU (1<<PGMSYN0)       

PGMSYN1       EQU 1       ; Program Memory Syndrome bit 1
BM_PGMSYN1    EQU (1<<PGMSYN1)       

PGMSYN2       EQU 2       ; Program Memory Syndrome bit 2
BM_PGMSYN2    EQU (1<<PGMSYN2)       

PGMSYN3       EQU 3       ; Program Memory Syndrome bit 3
BM_PGMSYN3    EQU (1<<PGMSYN3)       

PGMSYN4       EQU 4       ; Program Memory Syndrome bit 4
BM_PGMSYN4    EQU (1<<PGMSYN4)       

; ***** PORTB ************************
; DDRB - Port B Data Direction Register
DDRB0       EQU 0       ; Port B Data Direction Register bit 0
BM_DDRB0    EQU (1<<DDRB0)       

DDRB1       EQU 1       ; Port B Data Direction Register bit 1
BM_DDRB1    EQU (1<<DDRB1)       

DDRB2       EQU 2       ; Port B Data Direction Register bit 2
BM_DDRB2    EQU (1<<DDRB2)       

DDRB3       EQU 3       ; Port B Data Direction Register bit 3
BM_DDRB3    EQU (1<<DDRB3)       

DDRB4       EQU 4       ; Port B Data Direction Register bit 4
BM_DDRB4    EQU (1<<DDRB4)       

