camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
DDRB5       EQU 5       ; Port B Data Direction Register bit 5
BM_DDRB5    EQU (1<<DDRB5)       

DDRB6       EQU 6       ; Port B Data Direction Register bit 6
BM_DDRB6    EQU (1<<DDRB6)       

DDRB7       EQU 7       ; Port B Data Direction Register bit 7
BM_DDRB7    EQU (1<<DDRB7)       

; PINB - Port B Input Pins
PINB0       EQU 0       ; Port B Input Pins bit 0
BM_PINB0    EQU (1<<PINB0)       

PINB1       EQU 1       ; Port B Input Pins bit 1
BM_PINB1    EQU (1<<PINB1)       

PINB2       EQU 2       ; Port B Input Pins bit 2
BM_PINB2    EQU (1<<PINB2)       

PINB3       EQU 3       ; Port B Input Pins bit 3
BM_PINB3    EQU (1<<PINB3)       

PINB4       EQU 4       ; Port B Input Pins bit 4
BM_PINB4    EQU (1<<PINB4)       

PINB5       EQU 5       ; Port B Input Pins bit 5
BM_PINB5    EQU (1<<PINB5)       

PINB6       EQU 6       ; Port B Input Pins bit 6
BM_PINB6    EQU (1<<PINB6)       

PINB7       EQU 7       ; Port B Input Pins bit 7
BM_PINB7    EQU (1<<PINB7)       

; PORTB - Port B Data Register
PORTB0       EQU 0       ; Port B Data Register bit 0
BM_PORTB0    EQU (1<<PORTB0)       

PB0       EQU 0       ; For compatibility
BM_PB0    EQU (1<<PB0)       

PORTB1       EQU 1       ; Port B Data Register bit 1
BM_PORTB1    EQU (1<<PORTB1)       

PB1       EQU 1       ; For compatibility
BM_PB1    EQU (1<<PB1)       

PORTB2       EQU 2       ; Port B Data Register bit 2
BM_PORTB2    EQU (1<<PORTB2)       

PB2       EQU 2       ; For compatibility
BM_PB2    EQU (1<<PB2)       

PORTB3       EQU 3       ; Port B Data Register bit 3
BM_PORTB3    EQU (1<<PORTB3)       

PB3       EQU 3       ; For compatibility
BM_PB3    EQU (1<<PB3)       

PORTB4       EQU 4       ; Port B Data Register bit 4
BM_PORTB4    EQU (1<<PORTB4)       

PB4       EQU 4       ; For compatibility
BM_PB4    EQU (1<<PB4)       

PORTB5       EQU 5       ; Port B Data Register bit 5
BM_PORTB5    EQU (1<<PORTB5)       

PB5       EQU 5       ; For compatibility
BM_PB5    EQU (1<<PB5)       

PORTB6       EQU 6       ; Port B Data Register bit 6
BM_PORTB6    EQU (1<<PORTB6)       

PB6       EQU 6       ; For compatibility
BM_PB6    EQU (1<<PB6)       

PORTB7       EQU 7       ; Port B Data Register bit 7
BM_PORTB7    EQU (1<<PORTB7)       

PB7       EQU 7       ; For compatibility
BM_PB7    EQU (1<<PB7)       

; ***** PORTC ************************
; DDRC - Port C Data Direction Register
DDRC0       EQU 0       ; Port C Data Direction Register bit 0
BM_DDRC0    EQU (1<<DDRC0)       

DDRC1       EQU 1       ; Port C Data Direction Register bit 1
BM_DDRC1    EQU (1<<DDRC1)       

DDRC2       EQU 2       ; Port C Data Direction Register bit 2
BM_DDRC2    EQU (1<<DDRC2)       

; PINC - Port C Input Pins
PINC0       EQU 0       ; Port C Input Pins bit 0
BM_PINC0    EQU (1<<PINC0)       

PINC1       EQU 1       ; Port C Input Pins bit 1
BM_PINC1    EQU (1<<PINC1)       

PINC2       EQU 2       ; Port C Input Pins bit 2
BM_PINC2    EQU (1<<PINC2)       

; PORTC - Port C Data Register
PORTC0       EQU 0       ; Port C Data Register bit 0
BM_PORTC0    EQU (1<<PORTC0)       

PC0       EQU 0       ; For compatibility
BM_PC0    EQU (1<<PC0)       

PORTC1       EQU 1       ; Port C Data Register bit 1
BM_PORTC1    EQU (1<<PORTC1)       

PC1       EQU 1       ; For compatibility
BM_PC1    EQU (1<<PC1)       

PORTC2       EQU 2       ; Port C Data Register bit 2
BM_PORTC2    EQU (1<<PORTC2)       

PC2       EQU 2       ; For compatibility
BM_PC2    EQU (1<<PC2)       

; ***** PORTD ************************
; DDRD - Port D Data Direction Register
DDRD0       EQU 0       ; Port D Data Direction Register bit 0
BM_DDRD0    EQU (1<<DDRD0)       

DDRD1       EQU 1       ; Port D Data Direction Register bit 1
BM_DDRD1    EQU (1<<DDRD1)       

DDRD2       EQU 2       ; Port D Data Direction Register bit 2
BM_DDRD2    EQU (1<<DDRD2)       

DDRD3       EQU 3       ; Port D Data Direction Register bit 3
BM_DDRD3    EQU (1<<DDRD3)       

DDRD4       EQU 4       ; Port D Data Direction Register bit 4
BM_DDRD4    EQU (1<<DDRD4)       

DDRD5       EQU 5       ; Port D Data Direction Register bit 5
BM_DDRD5    EQU (1<<DDRD5)       

DDRD6       EQU 6       ; Port D Data Direction Register bit 6
BM_DDRD6    EQU (1<<DDRD6)       

DDRD7       EQU 7       ; Port D Data Direction Register bit 7
BM_DDRD7    EQU (1<<DDRD7)       

; PIND - Port D Input Pins
PIND0       EQU 0       ; Port D Input Pins bit 0
BM_PIND0    EQU (1<<PIND0)       

PIND1       EQU 1       ; Port D Input Pins bit 1
BM_PIND1    EQU (1<<PIND1)       

PIND2       EQU 2       ; Port D Input Pins bit 2
BM_PIND2    EQU (1<<PIND2)       

PIND3       EQU 3       ; Port D Input Pins bit 3
BM_PIND3    EQU (1<<PIND3)       

PIND4       EQU 4       ; Port D Input Pins bit 4
BM_PIND4    EQU (1<<PIND4)       

PIND5       EQU 5       ; Port D Input Pins bit 5
BM_PIND5    EQU (1<<PIND5)       

PIND6       EQU 6       ; Port D Input Pins bit 6
BM_PIND6    EQU (1<<PIND6)       

PIND7       EQU 7       ; Port D Input Pins bit 7
BM_PIND7    EQU (1<<PIND7)       

; PORTD - Port D Data Register
PORTD0       EQU 0       ; Port D Data Register bit 0
BM_PORTD0    EQU (1<<PORTD0)       

PD0       EQU 0       ; For compatibility
BM_PD0    EQU (1<<PD0)       

PORTD1       EQU 1       ; Port D Data Register bit 1
BM_PORTD1    EQU (1<<PORTD1)       

PD1       EQU 1       ; For compatibility
BM_PD1    EQU (1<<PD1)       

PORTD2       EQU 2       ; Port D Data Register bit 2
BM_PORTD2    EQU (1<<PORTD2)       

PD2       EQU 2       ; For compatibility
BM_PD2    EQU (1<<PD2)       

PORTD3       EQU 3       ; Port D Data Register bit 3
BM_PORTD3    EQU (1<<PORTD3)       

PD3       EQU 3       ; For compatibility
BM_PD3    EQU (1<<PD3)       

PORTD4       EQU 4       ; Port D Data Register bit 4
BM_PORTD4    EQU (1<<PORTD4)       

PD4       EQU 4       ; For compatibility
BM_PD4    EQU (1<<PD4)       

PORTD5       EQU 5       ; Port D Data Register bit 5
BM_PORTD5    EQU (1<<PORTD5)       

