camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
PD5       EQU 5       ; For compatibility
BM_PD5    EQU (1<<PD5)       

PORTD6       EQU 6       ; Port D Data Register bit 6
BM_PORTD6    EQU (1<<PORTD6)       

PD6       EQU 6       ; For compatibility
BM_PD6    EQU (1<<PD6)       

PORTD7       EQU 7       ; Port D Data Register bit 7
BM_PORTD7    EQU (1<<PORTD7)       

PD7       EQU 7       ; For compatibility
BM_PD7    EQU (1<<PD7)       

; ***** SFIFO ************************
; SFC - Support FIFO Configuration Register
SFFLC0       EQU 0       ; Support FIFO Fill-Level Configuration bit 0
BM_SFFLC0    EQU (1<<SFFLC0)       

SFFLC1       EQU 1       ; Support FIFO Fill-Level Configuration bit 1
BM_SFFLC1    EQU (1<<SFFLC1)       

SFFLC2       EQU 2       ; Support FIFO Fill-Level Configuration bit 2
BM_SFFLC2    EQU (1<<SFFLC2)       

SFFLC3       EQU 3       ; Support FIFO Fill-Level Configuration bit 3
BM_SFFLC3    EQU (1<<SFFLC3)       

SFFLC4       EQU 4       ; Support FIFO Fill-Level Configuration bit 4
BM_SFFLC4    EQU (1<<SFFLC4)       

SFDRA       EQU 7       ; Support FIFO Direct Read Access Operational Mode
BM_SFDRA    EQU (1<<SFDRA)       

; SFI - Support FIFO Interrupt Mask Register
SFFLIM       EQU 0       ; Support FIFO Fill-level Interrupt Mask
BM_SFFLIM    EQU (1<<SFFLIM)       

SFERIM       EQU 1       ; Support FIFO Error Interrupt Mask
BM_SFERIM    EQU (1<<SFERIM)       

; SFL - Support FIFO Fill Level Register
SFFLS0       EQU 0       ; Support FIFO Fill Level Status bit 0
BM_SFFLS0    EQU (1<<SFFLS0)       

SFFLS1       EQU 1       ; Support FIFO Fill Level Status bit 1
BM_SFFLS1    EQU (1<<SFFLS1)       

SFFLS2       EQU 2       ; Support FIFO Fill Level Status bit 2
BM_SFFLS2    EQU (1<<SFFLS2)       

SFFLS3       EQU 3       ; Support FIFO Fill Level Status bit 3
BM_SFFLS3    EQU (1<<SFFLS3)       

SFFLS4       EQU 4       ; Support FIFO Fill Level Status bit 4
BM_SFFLS4    EQU (1<<SFFLS4)       

SFCLR       EQU 7       ; Support FIFO Clear
BM_SFCLR    EQU (1<<SFCLR)       

; SFRP - Support FIFO Read Pointer
SFRP0       EQU 0       ; Support FIFO Read Pointer bit 0
BM_SFRP0    EQU (1<<SFRP0)       

SFRP1       EQU 1       ; Support FIFO Read Pointer bit 1
BM_SFRP1    EQU (1<<SFRP1)       

SFRP2       EQU 2       ; Support FIFO Read Pointer bit 2
BM_SFRP2    EQU (1<<SFRP2)       

SFRP3       EQU 3       ; Support FIFO Read Pointer bit 3
BM_SFRP3    EQU (1<<SFRP3)       

SFRP4       EQU 4       ; Support FIFO Read Pointer bit 4
BM_SFRP4    EQU (1<<SFRP4)       

; SFS - Support FIFO Status Register
SFFLRF       EQU 0       ; Support FIFO Fill-Level Reached Status Flag
BM_SFFLRF    EQU (1<<SFFLRF)       

SFUFL       EQU 1       ; Support FIFO Underflow Flag
BM_SFUFL    EQU (1<<SFUFL)       

SFOFL       EQU 2       ; Support FIFO Overflow Flag
BM_SFOFL    EQU (1<<SFOFL)       

; SFWP - Support FIFO Write Pointer
SFWP0       EQU 0       ; Support FIFO Write Pointer bit 0
BM_SFWP0    EQU (1<<SFWP0)       

SFWP1       EQU 1       ; Support FIFO Write Pointer bit 1
BM_SFWP1    EQU (1<<SFWP1)       

SFWP2       EQU 2       ; Support FIFO Write Pointer bit 2
BM_SFWP2    EQU (1<<SFWP2)       

SFWP3       EQU 3       ; Support FIFO Write Pointer bit 3
BM_SFWP3    EQU (1<<SFWP3)       

SFWP4       EQU 4       ; Support FIFO Write Pointer bit 4
BM_SFWP4    EQU (1<<SFWP4)       

; ***** SPI **************************
; SFFR - SPI FIFO Fill Status Register
RFL0       EQU 0       ; Receive Buffer Fill Level bit 0
BM_RFL0    EQU (1<<RFL0)       

RFL1       EQU 1       ; Receive Buffer Fill Level bit 1
BM_RFL1    EQU (1<<RFL1)       

RFL2       EQU 2       ; Receive Buffer Fill Level bit 2
BM_RFL2    EQU (1<<RFL2)       

RFC       EQU 3       ; Rx Buffer Clear
BM_RFC    EQU (1<<RFC)       

TFL0       EQU 4       ; Transmit Buffer Fill Level bit 0
BM_TFL0    EQU (1<<TFL0)       

TFL1       EQU 5       ; Transmit Buffer Fill Level bit 1
BM_TFL1    EQU (1<<TFL1)       

TFL2       EQU 6       ; Transmit Buffer Fill Level bit 2
BM_TFL2    EQU (1<<TFL2)       

TFC       EQU 7       ; SPI Tx Buffer Clear
BM_TFC    EQU (1<<TFC)       

; SFIR - SPI FIFO Interrupt Register
RIL0       EQU 0       ; Receive Buffer Interrupt Level bit 0
BM_RIL0    EQU (1<<RIL0)       

RIL1       EQU 1       ; Receive Buffer Interrupt Level bit 1
BM_RIL1    EQU (1<<RIL1)       

RIL2       EQU 2       ; Receive Buffer Interrupt Level bit 2
BM_RIL2    EQU (1<<RIL2)       

SRIE       EQU 3       ; Rx Buffer Interrupt Enable
BM_SRIE    EQU (1<<SRIE)       

TIL0       EQU 4       ; Transmit Buffer Interrupt Level bit 0
BM_TIL0    EQU (1<<TIL0)       

TIL1       EQU 5       ; Transmit Buffer Interrupt Level bit 1
BM_TIL1    EQU (1<<TIL1)       

TIL2       EQU 6       ; Transmit Buffer Interrupt Level bit 2
BM_TIL2    EQU (1<<TIL2)       

STIE       EQU 7       ; SPI Rx Buffer Interrupt Enable
BM_STIE    EQU (1<<STIE)       

; SPCR - SPI control Register
SPR0       EQU 0       ; SPI Clock Rate Select 0
BM_SPR0    EQU (1<<SPR0)       

SPR1       EQU 1       ; SPI Clock Rate Select 1
BM_SPR1    EQU (1<<SPR1)       

CPHA       EQU 2       ; Clock Phase
BM_CPHA    EQU (1<<CPHA)       

CPOL       EQU 3       ; Clock Polarity
BM_CPOL    EQU (1<<CPOL)       

MSTR       EQU 4       ; Master/Slave Select
BM_MSTR    EQU (1<<MSTR)       

DORD       EQU 5       ; Data Order
BM_DORD    EQU (1<<DORD)       

SPE       EQU 6       ; SPI Enable
BM_SPE    EQU (1<<SPE)       

SPIE       EQU 7       ; Spe Interrupt Enable
BM_SPIE    EQU (1<<SPIE)       

; SPSR - SPI Status Register
SPI2X       EQU 0       ; Double SPI Speed Bit
BM_SPI2X    EQU (1<<SPI2X)       

RXIF       EQU 4       ; Rx Buffer Interrupt Flag
BM_RXIF    EQU (1<<RXIF)       

TXIF       EQU 5       ; Tx Buffer Interrupt Flag
BM_TXIF    EQU (1<<TXIF)       

SPIF       EQU 7       ; SPI Interrupt Flag
BM_SPIF    EQU (1<<SPIF)       

; ***** SPI2 *************************
; SP2CR - SPI2 control Register
SP2R0       EQU 0       ; SPI2 Clock Rate Select 0
BM_SP2R0    EQU (1<<SP2R0)       

SP2R1       EQU 1       ; SPI2 Clock Rate Select 1
BM_SP2R1    EQU (1<<SP2R1)       

CPHA2       EQU 2       ; Clock Phase
BM_CPHA2    EQU (1<<CPHA2)       

CPOL2       EQU 3       ; Clock Polarity
BM_CPOL2    EQU (1<<CPOL2)       

MSTR2       EQU 4       ; Master/Slave Select
BM_MSTR2    EQU (1<<MSTR2)       

DORD2       EQU 5       ; Data Order
BM_DORD2    EQU (1<<DORD2)       

SP2E       EQU 6       ; SPI2 Enable
BM_SP2E    EQU (1<<SP2E)       

SP2IE       EQU 7       ; Spi2 Interrupt Enable
BM_SP2IE    EQU (1<<SP2IE)       

