camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
; SP2SR - SPI2 Status Register
SPI22X       EQU 0       ; Double SPI2 Speed Bit
BM_SPI22X    EQU (1<<SPI22X)       

WCOL2       EQU 6       ; Write Colliion Flag
BM_WCOL2    EQU (1<<WCOL2)       

SP2IF       EQU 7       ; SPI2 Interrupt Flag
BM_SP2IF    EQU (1<<SP2IF)       

; ***** SSM **************************
; MSMCR1 - Master State Machine Control Register 1
MSMSM00       EQU 0       ; Master State Machine SubState Machine Select 0 bit 0
BM_MSMSM00    EQU (1<<MSMSM00)       

MSMSM01       EQU 1       ; Master State Machine SubState Machine Select 0 bit 1
BM_MSMSM01    EQU (1<<MSMSM01)       

MSMSM02       EQU 2       ; Master State Machine SubState Machine Select 0 bit 2
BM_MSMSM02    EQU (1<<MSMSM02)       

MSMSM03       EQU 3       ; Master State Machine SubState Machine Select 0 bit 3
BM_MSMSM03    EQU (1<<MSMSM03)       

MSMSM10       EQU 4       ; Master State Machine SubState Machine Select 1 bit 0
BM_MSMSM10    EQU (1<<MSMSM10)       

MSMSM11       EQU 5       ; Master State Machine SubState Machine Select 1 bit 1
BM_MSMSM11    EQU (1<<MSMSM11)       

MSMSM12       EQU 6       ; Master State Machine SubState Machine Select 1 bit 2
BM_MSMSM12    EQU (1<<MSMSM12)       

MSMSM13       EQU 7       ; Master State Machine SubState Machine Select 1 bit 3
BM_MSMSM13    EQU (1<<MSMSM13)       

; MSMCR2 - Master State Machine Control Register 2
MSMSM20       EQU 0       ; Master State Machine SubState Machine Select 2 bit 0
BM_MSMSM20    EQU (1<<MSMSM20)       

MSMSM21       EQU 1       ; Master State Machine SubState Machine Select 2 bit 1
BM_MSMSM21    EQU (1<<MSMSM21)       

MSMSM22       EQU 2       ; Master State Machine SubState Machine Select 2 bit 2
BM_MSMSM22    EQU (1<<MSMSM22)       

MSMSM23       EQU 3       ; Master State Machine SubState Machine Select 2 bit 3
BM_MSMSM23    EQU (1<<MSMSM23)       

MSMSM30       EQU 4       ; Master State Machine SubState Machine Select 3 bit 0
BM_MSMSM30    EQU (1<<MSMSM30)       

MSMSM31       EQU 5       ; Master State Machine SubState Machine Select 3 bit 1
BM_MSMSM31    EQU (1<<MSMSM31)       

MSMSM32       EQU 6       ; Master State Machine SubState Machine Select 3 bit 2
BM_MSMSM32    EQU (1<<MSMSM32)       

MSMSM33       EQU 7       ; Master State Machine SubState Machine Select 3 bit 3
BM_MSMSM33    EQU (1<<MSMSM33)       

; MSMCR3 - Master State Machine Control Register 3
MSMSM40       EQU 0       ; Master State Machine SubState Machine Select 4 bit 0
BM_MSMSM40    EQU (1<<MSMSM40)       

MSMSM41       EQU 1       ; Master State Machine SubState Machine Select 4 bit 1
BM_MSMSM41    EQU (1<<MSMSM41)       

MSMSM42       EQU 2       ; Master State Machine SubState Machine Select 4 bit 2
BM_MSMSM42    EQU (1<<MSMSM42)       

MSMSM43       EQU 3       ; Master State Machine SubState Machine Select 4 bit 3
BM_MSMSM43    EQU (1<<MSMSM43)       

MSMSM50       EQU 4       ; Master State Machine SubState Machine Select 5 bit 0
BM_MSMSM50    EQU (1<<MSMSM50)       

MSMSM51       EQU 5       ; Master State Machine SubState Machine Select 5 bit 1
BM_MSMSM51    EQU (1<<MSMSM51)       

MSMSM52       EQU 6       ; Master State Machine SubState Machine Select 5 bit 2
BM_MSMSM52    EQU (1<<MSMSM52)       

MSMSM53       EQU 7       ; Master State Machine SubState Machine Select 5 bit 3
BM_MSMSM53    EQU (1<<MSMSM53)       

; MSMCR4 - Master State Machine Control Register 4
MSMSM60       EQU 0       ; Master State Machine SubState Machine Select 6 bit 0
BM_MSMSM60    EQU (1<<MSMSM60)       

MSMSM61       EQU 1       ; Master State Machine SubState Machine Select 6 bit 1
BM_MSMSM61    EQU (1<<MSMSM61)       

MSMSM62       EQU 2       ; Master State Machine SubState Machine Select 6 bit 2
BM_MSMSM62    EQU (1<<MSMSM62)       

MSMSM63       EQU 3       ; Master State Machine SubState Machine Select 6 bit 3
BM_MSMSM63    EQU (1<<MSMSM63)       

MSMSM70       EQU 4       ; Master State Machine SubState Machine Select 7 bit 0
BM_MSMSM70    EQU (1<<MSMSM70)       

MSMSM71       EQU 5       ; Master State Machine SubState Machine Select 7 bit 1
BM_MSMSM71    EQU (1<<MSMSM71)       

MSMSM72       EQU 6       ; Master State Machine SubState Machine Select 7 bit 2
BM_MSMSM72    EQU (1<<MSMSM72)       

MSMSM73       EQU 7       ; Master State Machine SubState Machine Select 7 bit 3
BM_MSMSM73    EQU (1<<MSMSM73)       

; MSMSTR - Master State Machine state register
SSMMST0       EQU 0       ; Sequencer State Machine Master State bit 0
BM_SSMMST0    EQU (1<<SSMMST0)       

SSMMST1       EQU 1       ; Sequencer State Machine Master State bit 1
BM_SSMMST1    EQU (1<<SSMMST1)       

SSMMST2       EQU 2       ; Sequencer State Machine Master State bit 2
BM_SSMMST2    EQU (1<<SSMMST2)       

SSMMST3       EQU 3       ; Sequencer State Machine Master State bit 3
BM_SSMMST3    EQU (1<<SSMMST3)       

SSMMST4       EQU 4       ; Sequencer State Machine Master State bit 4
BM_SSMMST4    EQU (1<<SSMMST4)       

; SSMCR - SSM Control Register
SSMTGE       EQU 2       ; Sequencer State Machine Tx Gauss Enable
BM_SSMTGE    EQU (1<<SSMTGE)       

SSMTPE       EQU 3       ; Sequencer State Machine Tx Preemphasis Enable
BM_SSMTPE    EQU (1<<SSMTPE)       

SSMPVE       EQU 4       ; Sequencer State Machine PV Enable
BM_SSMPVE    EQU (1<<SSMPVE)       

SSMTAE       EQU 5       ; Sequencer State Machine Tx Ask-Shaping Enable
BM_SSMTAE    EQU (1<<SSMTAE)       

; SSMFBR - SSM Filter Bandwidth Register
SSMPLDT       EQU 5       ; Sequencer State Machine PLL Lock Delay Time
BM_SSMPLDT    EQU (1<<SSMPLDT)       

; SSMIFR - SSM Interrupt Flag Register
SSMIF       EQU 0       ; Sequencer State Machine Interrupt Flag
BM_SSMIF    EQU (1<<SSMIF)       

; SSMIMR - SSM interrupt mask register
SSMIM       EQU 0       ; Sequencer State Machine Interrupt Mask
BM_SSMIM    EQU (1<<SSMIM)       

; SSMRR - SSM Run Register
SSMR       EQU 0       ; Sequencer State Machine Run
BM_SSMR    EQU (1<<SSMR)       

SSMST       EQU 1       ; Sequencer State Machine Stop
BM_SSMST    EQU (1<<SSMST)       

; SSMSR - SSM Status Register
SSMESM0       EQU 0       ; Sequencer State Machine Error State Machine bit 0
BM_SSMESM0    EQU (1<<SSMESM0)       

SSMESM1       EQU 1       ; Sequencer State Machine Error State Machine bit 1
BM_SSMESM1    EQU (1<<SSMESM1)       

SSMESM2       EQU 2       ; Sequencer State Machine Error State Machine bit 2
BM_SSMESM2    EQU (1<<SSMESM2)       

