camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
SSMESM3       EQU 3       ; Sequencer State Machine Error State Machine bit 3
BM_SSMESM3    EQU (1<<SSMESM3)       

SSMERR       EQU 7       ; Sequencer State Machine Error
BM_SSMERR    EQU (1<<SSMERR)       

; SSMSTR - SSM State Register
SSMSTA0       EQU 0       ; Sequencer State Machine State A bit 0
BM_SSMSTA0    EQU (1<<SSMSTA0)       

SSMSTA1       EQU 1       ; Sequencer State Machine State A bit 1
BM_SSMSTA1    EQU (1<<SSMSTA1)       

SSMSTA2       EQU 2       ; Sequencer State Machine State A bit 2
BM_SSMSTA2    EQU (1<<SSMSTA2)       

SSMSTA3       EQU 3       ; Sequencer State Machine State A bit 3
BM_SSMSTA3    EQU (1<<SSMSTA3)       

SSMSTA4       EQU 4       ; Sequencer State Machine State A bit 4
BM_SSMSTA4    EQU (1<<SSMSTA4)       

SSMSTA5       EQU 5       ; Sequencer State Machine State A bit 5
BM_SSMSTA5    EQU (1<<SSMSTA5)       

; ***** SUP **************************
; CALRDY - Calibration ready signature
CALRDY0       EQU 0       ; Calibration ready signature bit 0
BM_CALRDY0    EQU (1<<CALRDY0)       

CALRDY1       EQU 1       ; Calibration ready signature bit 1
BM_CALRDY1    EQU (1<<CALRDY1)       

CALRDY2       EQU 2       ; Calibration ready signature bit 2
BM_CALRDY2    EQU (1<<CALRDY2)       

CALRDY3       EQU 3       ; Calibration ready signature bit 3
BM_CALRDY3    EQU (1<<CALRDY3)       

CALRDY4       EQU 4       ; Calibration ready signature bit 4
BM_CALRDY4    EQU (1<<CALRDY4)       

CALRDY5       EQU 5       ; Calibration ready signature bit 5
BM_CALRDY5    EQU (1<<CALRDY5)       

CALRDY6       EQU 6       ; Calibration ready signature bit 6
BM_CALRDY6    EQU (1<<CALRDY6)       

CALRDY7       EQU 7       ; Calibration ready signature bit 7
BM_CALRDY7    EQU (1<<CALRDY7)       

; CALRDYLF - Calibration ready signature LFVCC
CALRDYLF0       EQU 0       ; Calibration ready signature LFVCC bit 0
BM_CALRDYLF0    EQU (1<<CALRDYLF0)       

CALRDYLF1       EQU 1       ; Calibration ready signature LFVCC bit 1
BM_CALRDYLF1    EQU (1<<CALRDYLF1)       

CALRDYLF2       EQU 2       ; Calibration ready signature LFVCC bit 2
BM_CALRDYLF2    EQU (1<<CALRDYLF2)       

CALRDYLF3       EQU 3       ; Calibration ready signature LFVCC bit 3
BM_CALRDYLF3    EQU (1<<CALRDYLF3)       

CALRDYLF4       EQU 4       ; Calibration ready signature LFVCC bit 4
BM_CALRDYLF4    EQU (1<<CALRDYLF4)       

CALRDYLF5       EQU 5       ; Calibration ready signature LFVCC bit 5
BM_CALRDYLF5    EQU (1<<CALRDYLF5)       

CALRDYLF6       EQU 6       ; Calibration ready signature LFVCC bit 6
BM_CALRDYLF6    EQU (1<<CALRDYLF6)       

CALRDYLF7       EQU 7       ; Calibration ready signature LFVCC bit 7
BM_CALRDYLF7    EQU (1<<CALRDYLF7)       

; PMTER - Power Management Test Enable Register
PMTE0       EQU 0       ; Power Management Test Enable bit 0
BM_PMTE0    EQU (1<<PMTE0)       

PMTE1       EQU 1       ; Power Management Test Enable bit 1
BM_PMTE1    EQU (1<<PMTE1)       

PMTE2       EQU 2       ; Power Management Test Enable bit 2
BM_PMTE2    EQU (1<<PMTE2)       

PMTE3       EQU 3       ; Power Management Test Enable bit 3
BM_PMTE3    EQU (1<<PMTE3)       

PMTE4       EQU 4       ; Power Management Test Enable bit 4
BM_PMTE4    EQU (1<<PMTE4)       

PMTE5       EQU 5       ; Power Management Test Enable bit 5
BM_PMTE5    EQU (1<<PMTE5)       

PMTE6       EQU 6       ; Power Management Test Enable bit 6
BM_PMTE6    EQU (1<<PMTE6)       

PMTE7       EQU 7       ; Power Management Test Enable bit 7
BM_PMTE7    EQU (1<<PMTE7)       

; RCTCAL - RC oscillator Temperature Compensation register
FRCTC       EQU 0       ; FRC Oscillator Temperature Compensation bit
BM_FRCTC    EQU (1<<FRCTC)       

MRCTC0       EQU 1       ; Medium frequency RC Oscillator Temperature Compensation bit 0
BM_MRCTC0    EQU (1<<MRCTC0)       

MRCTC1       EQU 2       ; Medium frequency RC Oscillator Temperature Compensation bit 1
BM_MRCTC1    EQU (1<<MRCTC1)       

MRCTC2       EQU 3       ; Medium frequency RC Oscillator Temperature Compensation bit 2
BM_MRCTC2    EQU (1<<MRCTC2)       

DI_MRCBG       EQU 4       ; Disable MRC Oscillator Bandgap
BM_DI_MRCBG    EQU (1<<DI_MRCBG)       

; SUPCA1 - Supply calibration register 1
PV22       EQU 2       ; Power Amplifier Voltage 2.2V
BM_PV22    EQU (1<<PV22)       

PVDIC       EQU 3       ; Power Amplifier Regulator Double Internal Current
BM_PVDIC    EQU (1<<PVDIC)       

PVCAL0       EQU 4       ; Power Amplifier Regulator Calibration bit 0
BM_PVCAL0    EQU (1<<PVCAL0)       

PVCAL1       EQU 5       ; Power Amplifier Regulator Calibration bit 1
BM_PVCAL1    EQU (1<<PVCAL1)       

PVCAL2       EQU 6       ; Power Amplifier Regulator Calibration bit 2
BM_PVCAL2    EQU (1<<PVCAL2)       

PVCAL3       EQU 7       ; Power Amplifier Regulator Calibration bit 3
BM_PVCAL3    EQU (1<<PVCAL3)       

; SUPCA10 - Supply calibration register 10
POWMAN0       EQU 0       ; Power Management Spare bits bit 0
BM_POWMAN0    EQU (1<<POWMAN0)       

POWMAN1       EQU 1       ; Power Management Spare bits bit 1
BM_POWMAN1    EQU (1<<POWMAN1)       

POWMAN2       EQU 2       ; Power Management Spare bits bit 2
BM_POWMAN2    EQU (1<<POWMAN2)       

POWMAN3       EQU 3       ; Power Management Spare bits bit 3
BM_POWMAN3    EQU (1<<POWMAN3)       

POWMAN4       EQU 4       ; Power Management Spare bits bit 4
BM_POWMAN4    EQU (1<<POWMAN4)       

; SUPCA2 - Supply calibration register 2
BGCAL0       EQU 0       ; Band Gap Calibration bit 0
BM_BGCAL0    EQU (1<<BGCAL0)       

BGCAL1       EQU 1       ; Band Gap Calibration bit 1
BM_BGCAL1    EQU (1<<BGCAL1)       

BGCAL2       EQU 2       ; Band Gap Calibration bit 2
BM_BGCAL2    EQU (1<<BGCAL2)       

BGCAL3       EQU 3       ; Band Gap Calibration bit 3
BM_BGCAL3    EQU (1<<BGCAL3)       

; SUPCA3 - Supply calibration register 3
ACAL0       EQU 0       ; AVCC Regulator Output Voltage Calibration bit 0
BM_ACAL0    EQU (1<<ACAL0)       

ACAL1       EQU 1       ; AVCC Regulator Output Voltage Calibration bit 1
BM_ACAL1    EQU (1<<ACAL1)       

ACAL2       EQU 2       ; AVCC Regulator Output Voltage Calibration bit 2
BM_ACAL2    EQU (1<<ACAL2)       

