camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
ACAL3       EQU 3       ; AVCC Regulator Output Voltage Calibration bit 3
BM_ACAL3    EQU (1<<ACAL3)       

ACAL4       EQU 4       ; AVCC Regulator Output Voltage Calibration bit 4
BM_ACAL4    EQU (1<<ACAL4)       

ACAL5       EQU 5       ; AVCC Regulator Output Voltage Calibration bit 5
BM_ACAL5    EQU (1<<ACAL5)       

ACAL6       EQU 6       ; AVCC Regulator Output Voltage Calibration bit 6
BM_ACAL6    EQU (1<<ACAL6)       

ACAL7       EQU 7       ; AVCC Regulator Output Voltage Calibration bit 7
BM_ACAL7    EQU (1<<ACAL7)       

; SUPCA4 - Supply calibration register 4
ICONST0       EQU 0       ; ICONST Constant current of bandgap bit 0
BM_ICONST0    EQU (1<<ICONST0)       

ICONST1       EQU 1       ; ICONST Constant current of bandgap bit 1
BM_ICONST1    EQU (1<<ICONST1)       

ICONST2       EQU 2       ; ICONST Constant current of bandgap bit 2
BM_ICONST2    EQU (1<<ICONST2)       

ICONST3       EQU 3       ; ICONST Constant current of bandgap bit 3
BM_ICONST3    EQU (1<<ICONST3)       

ICONST4       EQU 4       ; ICONST Constant current of bandgap bit 4
BM_ICONST4    EQU (1<<ICONST4)       

ICONST5       EQU 5       ; ICONST Constant current of bandgap bit 5
BM_ICONST5    EQU (1<<ICONST5)       

; SUPCA5 - Supply calibration register 5
IPTAT0       EQU 0       ; IPTAT current of bandgap bit 0
BM_IPTAT0    EQU (1<<IPTAT0)       

IPTAT1       EQU 1       ; IPTAT current of bandgap bit 1
BM_IPTAT1    EQU (1<<IPTAT1)       

IPTAT2       EQU 2       ; IPTAT current of bandgap bit 2
BM_IPTAT2    EQU (1<<IPTAT2)       

IPTAT3       EQU 3       ; IPTAT current of bandgap bit 3
BM_IPTAT3    EQU (1<<IPTAT3)       

IPTAT4       EQU 4       ; IPTAT current of bandgap bit 4
BM_IPTAT4    EQU (1<<IPTAT4)       

IPTAT5       EQU 5       ; IPTAT current of bandgap bit 5
BM_IPTAT5    EQU (1<<IPTAT5)       

; SUPCA6 - Supply calibration register 6
VBGTR0       EQU 0       ; Threshold voltage of bandgap bit 0
BM_VBGTR0    EQU (1<<VBGTR0)       

VBGTR1       EQU 1       ; Threshold voltage of bandgap bit 1
BM_VBGTR1    EQU (1<<VBGTR1)       

VBGTR2       EQU 2       ; Threshold voltage of bandgap bit 2
BM_VBGTR2    EQU (1<<VBGTR2)       

VBGTR3       EQU 3       ; Threshold voltage of bandgap bit 3
BM_VBGTR3    EQU (1<<VBGTR3)       

VBGTR4       EQU 4       ; Threshold voltage of bandgap bit 4
BM_VBGTR4    EQU (1<<VBGTR4)       

VBGTR5       EQU 5       ; Threshold voltage of bandgap bit 5
BM_VBGTR5    EQU (1<<VBGTR5)       

VBGTR6       EQU 6       ; Threshold voltage of bandgap bit 6
BM_VBGTR6    EQU (1<<VBGTR6)       

VBGTR7       EQU 7       ; Threshold voltage of bandgap bit 7
BM_VBGTR7    EQU (1<<VBGTR7)       

; SUPCA7 - Supply calibration register 7
VCCCAL0       EQU 0       ; LFVCC and DVCC Output Voltage Calibration bit 0
BM_VCCCAL0    EQU (1<<VCCCAL0)       

VCCCAL1       EQU 1       ; LFVCC and DVCC Output Voltage Calibration bit 1
BM_VCCCAL1    EQU (1<<VCCCAL1)       

VCCCAL2       EQU 2       ; LFVCC and DVCC Output Voltage Calibration bit 2
BM_VCCCAL2    EQU (1<<VCCCAL2)       

LFVCCBD0       EQU 3       ; VREF voltage for LFVCC Brown-out-Detector bit 0
BM_LFVCCBD0    EQU (1<<LFVCCBD0)       

LFVCCBD1       EQU 4       ; VREF voltage for LFVCC Brown-out-Detector bit 1
BM_LFVCCBD1    EQU (1<<LFVCCBD1)       

LFVCCBD2       EQU 5       ; VREF voltage for LFVCC Brown-out-Detector bit 2
BM_LFVCCBD2    EQU (1<<LFVCCBD2)       

; SUPCA8 - Supply calibration register 8
VSWBD0       EQU 0       ; VSIG voltage for LFVCC Brown-out-Detector bit 0
BM_VSWBD0    EQU (1<<VSWBD0)       

VSWBD1       EQU 1       ; VSIG voltage for LFVCC Brown-out-Detector bit 1
BM_VSWBD1    EQU (1<<VSWBD1)       

VSWBD2       EQU 2       ; VSIG voltage for LFVCC Brown-out-Detector bit 2
BM_VSWBD2    EQU (1<<VSWBD2)       

DVCCBD0       EQU 3       ; VREF voltage for DVCC Brown-out-Detector bit 0
BM_DVCCBD0    EQU (1<<DVCCBD0)       

DVCCBD1       EQU 4       ; VREF voltage for DVCC Brown-out-Detector bit 1
BM_DVCCBD1    EQU (1<<DVCCBD1)       

DVCCBD2       EQU 5       ; VREF voltage for DVCC Brown-out-Detector bit 2
BM_DVCCBD2    EQU (1<<DVCCBD2)       

; SUPCA9 - Supply calibration register 9
VMEM0       EQU 0       ; VMEM ldo voltage bit 0
BM_VMEM0    EQU (1<<VMEM0)       

VMEM1       EQU 1       ; VMEM ldo voltage bit 1
BM_VMEM1    EQU (1<<VMEM1)       

VMEM2       EQU 2       ; VMEM ldo voltage bit 2
BM_VMEM2    EQU (1<<VMEM2)       

VMEM3       EQU 3       ; VMEM ldo voltage bit 3
BM_VMEM3    EQU (1<<VMEM3)       

VMEM4       EQU 4       ; VMEM ldo voltage bit 4
BM_VMEM4    EQU (1<<VMEM4)       

VMEM5       EQU 5       ; VMEM ldo voltage bit 5
BM_VMEM5    EQU (1<<VMEM5)       

VMEM6       EQU 6       ; VMEM ldo voltage bit 6
BM_VMEM6    EQU (1<<VMEM6)       

VMEM7       EQU 7       ; VMEM ldo voltage bit 7
BM_VMEM7    EQU (1<<VMEM7)       

; SUPCR - Supply Control Register
AVCCRM       EQU 0       ; AVCC Reset Interrupt Mask
BM_AVCCRM    EQU (1<<AVCCRM)       

AVCCLM       EQU 1       ; AVCC Low Interrupt Mask
BM_AVCCLM    EQU (1<<AVCCLM)       

PVEN       EQU 2       ; Power amplifier Voltage supply Enable
BM_PVEN    EQU (1<<PVEN)       

AVDIC       EQU 3       ; AVCC Double Internal Current
BM_AVDIC    EQU (1<<AVDIC)       

AVEN       EQU 4       ; AVCC Enable
BM_AVEN    EQU (1<<AVEN)       

DVHEN       EQU 5       ; DVCC High Current Mode Enable
BM_DVHEN    EQU (1<<DVHEN)       

VMRESM       EQU 6       ; VMEM Reset Mask
BM_VMRESM    EQU (1<<VMRESM)       

VMEMEN       EQU 7       ; Memory Voltage Regulator Enable
BM_VMEMEN    EQU (1<<VMEMEN)       

; SUPFR - Supply Interrupt Flag Register
AVCCRF       EQU 0       ; AVCC reset interrupt flag
BM_AVCCRF    EQU (1<<AVCCRF)       

AVCCLF       EQU 1       ; AVCC low interrupt flag
BM_AVCCLF    EQU (1<<AVCCLF)       

; VMCR - Voltage Monitor Control Register
VMLS0       EQU 0       ; Voltage Monitor Level Select bit 0
BM_VMLS0    EQU (1<<VMLS0)       

VMLS1       EQU 1       ; Voltage Monitor Level Select bit 1
BM_VMLS1    EQU (1<<VMLS1)       

