camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
VMLS2       EQU 2       ; Voltage Monitor Level Select bit 2
BM_VMLS2    EQU (1<<VMLS2)       

VMLS3       EQU 3       ; Voltage Monitor Level Select bit 3
BM_VMLS3    EQU (1<<VMLS3)       

VMIM       EQU 4       ; Voltage Monitor Interrupt Mask
BM_VMIM    EQU (1<<VMIM)       

VMPS0       EQU 5       ; Voltage Monitor Power Supply Select 0
BM_VMPS0    EQU (1<<VMPS0)       

VMPS1       EQU 6       ; Voltage Monitor Power Supply Select 1
BM_VMPS1    EQU (1<<VMPS1)       

VMRS       EQU 7       ; Voltage Monitor Range Select
BM_VMRS    EQU (1<<VMRS)       

; VMSCR - Voltage Monitor Status and Control Register
VMF       EQU 0       ; Voltage Monitor Flag
BM_VMF    EQU (1<<VMF)       

VMDIH       EQU 1       ; Voltage Monitor Disable Hysteresis
BM_VMDIH    EQU (1<<VMDIH)       

; ***** TIMER0_WDT *******************
; T0CR - Timer0 Control Register
T0PS0       EQU 0       ; Timer0 Prescaler Select bit 0
BM_T0PS0    EQU (1<<T0PS0)       

T0PS1       EQU 1       ; Timer0 Prescaler Select bit 1
BM_T0PS1    EQU (1<<T0PS1)       

T0PS2       EQU 2       ; Timer0 Prescaler Select bit 2
BM_T0PS2    EQU (1<<T0PS2)       

T0IE       EQU 3       ; Timer0 Interrupt Enable
BM_T0IE    EQU (1<<T0IE)       

T0PR       EQU 4       ; Timer0 Prescaler Reset
BM_T0PR    EQU (1<<T0PR)       

; T0IFR - Timer0 Interrupt Flag Register
T0F       EQU 0       ; Timer0 Flag
BM_T0F    EQU (1<<T0F)       

; WDTCR - Watchdog Timer0 control Register
WDPS0       EQU 0       ; Watchdog Prescaler Select bit 0
BM_WDPS0    EQU (1<<WDPS0)       

WDPS1       EQU 1       ; Watchdog Prescaler Select bit 1
BM_WDPS1    EQU (1<<WDPS1)       

WDPS2       EQU 2       ; Watchdog Prescaler Select bit 2
BM_WDPS2    EQU (1<<WDPS2)       

WDE       EQU 3       ; Watchdog System Reset Enable
BM_WDE    EQU (1<<WDE)       

WDCE       EQU 4       ; Watchdog Change Enable
BM_WDCE    EQU (1<<WDCE)       

; ***** TIMER1 ***********************
; T1CNT - Timer1 Counter Register
T1CNT0       EQU 0       ; Timer1 Counter bit 0
BM_T1CNT0    EQU (1<<T1CNT0)       

T1CNT1       EQU 1       ; Timer1 Counter bit 1
BM_T1CNT1    EQU (1<<T1CNT1)       

T1CNT2       EQU 2       ; Timer1 Counter bit 2
BM_T1CNT2    EQU (1<<T1CNT2)       

T1CNT3       EQU 3       ; Timer1 Counter bit 3
BM_T1CNT3    EQU (1<<T1CNT3)       

T1CNT4       EQU 4       ; Timer1 Counter bit 4
BM_T1CNT4    EQU (1<<T1CNT4)       

T1CNT5       EQU 5       ; Timer1 Counter bit 5
BM_T1CNT5    EQU (1<<T1CNT5)       

T1CNT6       EQU 6       ; Timer1 Counter bit 6
BM_T1CNT6    EQU (1<<T1CNT6)       

T1CNT7       EQU 7       ; Timer1 Counter bit 7
BM_T1CNT7    EQU (1<<T1CNT7)       

; T1COR - Timer1 Compare Register
T1COR0       EQU 0       ; Timer1 Compare bit 0
BM_T1COR0    EQU (1<<T1COR0)       

T1COR1       EQU 1       ; Timer1 Compare bit 1
BM_T1COR1    EQU (1<<T1COR1)       

T1COR2       EQU 2       ; Timer1 Compare bit 2
BM_T1COR2    EQU (1<<T1COR2)       

T1COR3       EQU 3       ; Timer1 Compare bit 3
BM_T1COR3    EQU (1<<T1COR3)       

T1COR4       EQU 4       ; Timer1 Compare bit 4
BM_T1COR4    EQU (1<<T1COR4)       

T1COR5       EQU 5       ; Timer1 Compare bit 5
BM_T1COR5    EQU (1<<T1COR5)       

T1COR6       EQU 6       ; Timer1 Compare bit 6
BM_T1COR6    EQU (1<<T1COR6)       

T1COR7       EQU 7       ; Timer1 Compare bit 7
BM_T1COR7    EQU (1<<T1COR7)       

; T1CR - Timer1 control Register
T1OTM       EQU 0       ; Timer1 Overflow Toggle Mask
BM_T1OTM    EQU (1<<T1OTM)       

T1CTM       EQU 1       ; Timer1 Compare Toggle Mask
BM_T1CTM    EQU (1<<T1CTM)       

T1CRM       EQU 2       ; Timer1 Compare Reset Mask
BM_T1CRM    EQU (1<<T1CRM)       

T1TOP       EQU 4       ; Timer1 Toggle Output Preset
BM_T1TOP    EQU (1<<T1TOP)       

T1RES       EQU 5       ; Timer1 Reset
BM_T1RES    EQU (1<<T1RES)       

T1TOS       EQU 6       ; Timer1 Toggle with Start
BM_T1TOS    EQU (1<<T1TOS)       

T1ENA       EQU 7       ; Timer1 Enable
BM_T1ENA    EQU (1<<T1ENA)       

; T1IFR - Timer1 Interrupt Flag Register
T1OFF       EQU 0       ; Timer1 Overflow Flag
BM_T1OFF    EQU (1<<T1OFF)       

T1COF       EQU 1       ; Timer1 Compare Flag
BM_T1COF    EQU (1<<T1COF)       

; T1IMR - Timer1 Interrupt Mask Register
T1OIM       EQU 0       ; Timer1 Overflow Interrupt Mask
BM_T1OIM    EQU (1<<T1OIM)       

T1CIM       EQU 1       ; Timer1 Compare Interrupt Mask
BM_T1CIM    EQU (1<<T1CIM)       

; T1MR - Timer1 Mode Register
T1CS0       EQU 0       ; Timer1 Clock Select bit 0
BM_T1CS0    EQU (1<<T1CS0)       

T1CS1       EQU 1       ; Timer1 Clock Select bit 1
BM_T1CS1    EQU (1<<T1CS1)       

T1PS0       EQU 2       ; Timer1 Prescaler Select bit 0
BM_T1PS0    EQU (1<<T1PS0)       

T1PS1       EQU 3       ; Timer1 Prescaler Select bit 1
BM_T1PS1    EQU (1<<T1PS1)       

T1PS2       EQU 4       ; Timer1 Prescaler Select bit 2
BM_T1PS2    EQU (1<<T1PS2)       

T1PS3       EQU 5       ; Timer1 Prescaler Select bit 3
BM_T1PS3    EQU (1<<T1PS3)       

T1DC0       EQU 6       ; Timer1 Duty Cycle bit 0
BM_T1DC0    EQU (1<<T1DC0)       

T1DC1       EQU 7       ; Timer1 Duty Cycle bit 1
BM_T1DC1    EQU (1<<T1DC1)       

; ***** TIMER2 ***********************
; T2CNT - Timer2 Counter Register
T2CNT0       EQU 0       ; Timer2 Counter bit 0
BM_T2CNT0    EQU (1<<T2CNT0)       

T2CNT1       EQU 1       ; Timer2 Counter bit 1
BM_T2CNT1    EQU (1<<T2CNT1)       

T2CNT2       EQU 2       ; Timer2 Counter bit 2
BM_T2CNT2    EQU (1<<T2CNT2)       

T2CNT3       EQU 3       ; Timer2 Counter bit 3
BM_T2CNT3    EQU (1<<T2CNT3)       

T2CNT4       EQU 4       ; Timer2 Counter bit 4
BM_T2CNT4    EQU (1<<T2CNT4)       

T2CNT5       EQU 5       ; Timer2 Counter bit 5
BM_T2CNT5    EQU (1<<T2CNT5)       

T2CNT6       EQU 6       ; Timer2 Counter bit 6
BM_T2CNT6    EQU (1<<T2CNT6)       

T2CNT7       EQU 7       ; Timer2 Counter bit 7
BM_T2CNT7    EQU (1<<T2CNT7)       

; T2COR - Timer2 Compare Register
T2COR0       EQU 0       ; Timer2 Compare bit 0
BM_T2COR0    EQU (1<<T2COR0)       

