camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
T2COR1       EQU 1       ; Timer2 Compare bit 1
BM_T2COR1    EQU (1<<T2COR1)       

T2COR2       EQU 2       ; Timer2 Compare bit 2
BM_T2COR2    EQU (1<<T2COR2)       

T2COR3       EQU 3       ; Timer2 Compare bit 3
BM_T2COR3    EQU (1<<T2COR3)       

T2COR4       EQU 4       ; Timer2 Compare bit 4
BM_T2COR4    EQU (1<<T2COR4)       

T2COR5       EQU 5       ; Timer2 Compare bit 5
BM_T2COR5    EQU (1<<T2COR5)       

T2COR6       EQU 6       ; Timer2 Compare bit 6
BM_T2COR6    EQU (1<<T2COR6)       

T2COR7       EQU 7       ; Timer2 Compare bit 7
BM_T2COR7    EQU (1<<T2COR7)       

; T2CR - Timer2 Control Register
T2OTM       EQU 0       ; Timer2 Overflow Toggle Mask
BM_T2OTM    EQU (1<<T2OTM)       

T2CTM       EQU 1       ; Timer2 Compare Toggle Mask
BM_T2CTM    EQU (1<<T2CTM)       

T2CRM       EQU 2       ; Timer2 Compare Reset Mask
BM_T2CRM    EQU (1<<T2CRM)       

T2TOP       EQU 4       ; Timer2 Toggle Output Preset
BM_T2TOP    EQU (1<<T2TOP)       

T2RES       EQU 5       ; Timer2 Reset
BM_T2RES    EQU (1<<T2RES)       

T2TOS       EQU 6       ; Timer2 Toggle with Start
BM_T2TOS    EQU (1<<T2TOS)       

T2ENA       EQU 7       ; Timer2 Enable
BM_T2ENA    EQU (1<<T2ENA)       

; T2IFR - Timer2 Interrupt Flag Register
T2OFF       EQU 0       ; Timer2 Overflow Flag
BM_T2OFF    EQU (1<<T2OFF)       

T2COF       EQU 1       ; Timer2 Compare Flag
BM_T2COF    EQU (1<<T2COF)       

; T2IMR - Timer2 Interrupt Mask Register
T2OIM       EQU 0       ; Timer2 Overflow Interrupt Mask
BM_T2OIM    EQU (1<<T2OIM)       

T2CIM       EQU 1       ; Timer2 Compare Interrupt Mask
BM_T2CIM    EQU (1<<T2CIM)       

; T2MR - Timer2 Mode Register
T2CS0       EQU 0       ; Timer2 Clock Select bit 0
BM_T2CS0    EQU (1<<T2CS0)       

T2CS1       EQU 1       ; Timer2 Clock Select bit 1
BM_T2CS1    EQU (1<<T2CS1)       

T2PS0       EQU 2       ; Timer2 Prescaler Select bit 0
BM_T2PS0    EQU (1<<T2PS0)       

T2PS1       EQU 3       ; Timer2 Prescaler Select bit 1
BM_T2PS1    EQU (1<<T2PS1)       

T2PS2       EQU 4       ; Timer2 Prescaler Select bit 2
BM_T2PS2    EQU (1<<T2PS2)       

T2PS3       EQU 5       ; Timer2 Prescaler Select bit 3
BM_T2PS3    EQU (1<<T2PS3)       

T2DC0       EQU 6       ; Timer2 Duty Cycle bit 0
BM_T2DC0    EQU (1<<T2DC0)       

T2DC1       EQU 7       ; Timer2 Duty Cycle bit 1
BM_T2DC1    EQU (1<<T2DC1)       

; ***** TIMER3 ***********************
; T3CNTH - Timer3 counter High Byte Register
T3CNT8       EQU 0       ; Timer3 counter bit 8
BM_T3CNT8    EQU (1<<T3CNT8)       

T3CNT9       EQU 1       ; Timer3 counter bit 9
BM_T3CNT9    EQU (1<<T3CNT9)       

T3CNT10       EQU 2       ; Timer3 counter bit 10
BM_T3CNT10    EQU (1<<T3CNT10)       

T3CNT11       EQU 3       ; Timer3 counter bit 11
BM_T3CNT11    EQU (1<<T3CNT11)       

T3CNT12       EQU 4       ; Timer3 counter bit 12
BM_T3CNT12    EQU (1<<T3CNT12)       

T3CNT13       EQU 5       ; Timer3 counter bit 13
BM_T3CNT13    EQU (1<<T3CNT13)       

T3CNT14       EQU 6       ; Timer3 counter bit 14
BM_T3CNT14    EQU (1<<T3CNT14)       

T3CNT15       EQU 7       ; Timer3 counter bit 15
BM_T3CNT15    EQU (1<<T3CNT15)       

; T3CNTL - Timer3 counter Low Byte Register
T3CNT0       EQU 0       ; Timer3 counter bit 0
BM_T3CNT0    EQU (1<<T3CNT0)       

T3CNT1       EQU 1       ; Timer3 counter bit 1
BM_T3CNT1    EQU (1<<T3CNT1)       

T3CNT2       EQU 2       ; Timer3 counter bit 2
BM_T3CNT2    EQU (1<<T3CNT2)       

T3CNT3       EQU 3       ; Timer3 counter bit 3
BM_T3CNT3    EQU (1<<T3CNT3)       

T3CNT4       EQU 4       ; Timer3 counter bit 4
BM_T3CNT4    EQU (1<<T3CNT4)       

T3CNT5       EQU 5       ; Timer3 counter bit 5
BM_T3CNT5    EQU (1<<T3CNT5)       

T3CNT6       EQU 6       ; Timer3 counter bit 6
BM_T3CNT6    EQU (1<<T3CNT6)       

T3CNT7       EQU 7       ; Timer3 counter bit 7
BM_T3CNT7    EQU (1<<T3CNT7)       

; T3CORH - Timer3 compare High Byte Register
T3COR8       EQU 0       ; Timer3 compare bit 8
BM_T3COR8    EQU (1<<T3COR8)       

T3COR9       EQU 1       ; Timer3 compare bit 9
BM_T3COR9    EQU (1<<T3COR9)       

T3COR10       EQU 2       ; Timer3 compare bit 10
BM_T3COR10    EQU (1<<T3COR10)       

T3COR11       EQU 3       ; Timer3 compare bit 11
BM_T3COR11    EQU (1<<T3COR11)       

T3COR12       EQU 4       ; Timer3 compare bit 12
BM_T3COR12    EQU (1<<T3COR12)       

T3COR13       EQU 5       ; Timer3 compare bit 13
BM_T3COR13    EQU (1<<T3COR13)       

T3COR14       EQU 6       ; Timer3 compare bit 14
BM_T3COR14    EQU (1<<T3COR14)       

T3COR15       EQU 7       ; Timer3 compare bit 15
BM_T3COR15    EQU (1<<T3COR15)       

; T3CORL - Timer3 compare Low Byte Register
T3COR0       EQU 0       ; Timer3 compare bit 0
BM_T3COR0    EQU (1<<T3COR0)       

T3COR1       EQU 1       ; Timer3 compare bit 1
BM_T3COR1    EQU (1<<T3COR1)       

T3COR2       EQU 2       ; Timer3 compare bit 2
BM_T3COR2    EQU (1<<T3COR2)       

T3COR3       EQU 3       ; Timer3 compare bit 3
BM_T3COR3    EQU (1<<T3COR3)       

T3COR4       EQU 4       ; Timer3 compare bit 4
BM_T3COR4    EQU (1<<T3COR4)       

T3COR5       EQU 5       ; Timer3 compare bit 5
BM_T3COR5    EQU (1<<T3COR5)       

T3COR6       EQU 6       ; Timer3 compare bit 6
BM_T3COR6    EQU (1<<T3COR6)       

T3COR7       EQU 7       ; Timer3 compare bit 7
BM_T3COR7    EQU (1<<T3COR7)       

; T3CR - Timer3 control Register
T3OTM       EQU 0       ; Timer3 Overflow Toggle Mask
BM_T3OTM    EQU (1<<T3OTM)       

T3CTM       EQU 1       ; Timer3 Compare Toggle Mask
BM_T3CTM    EQU (1<<T3CTM)       

T3CRM       EQU 2       ; Timer3 Compare Reset Mask
BM_T3CRM    EQU (1<<T3CRM)       

T3CPRM       EQU 3       ; Timer3 CaPture Reset Mask
BM_T3CPRM    EQU (1<<T3CPRM)       

T3TOP       EQU 4       ; Timer3 Toggle Output Preset
BM_T3TOP    EQU (1<<T3TOP)       

T3RES       EQU 5       ; Timer3 Reset
BM_T3RES    EQU (1<<T3RES)       

T3TOS       EQU 6       ; Timer3 Toggle with Start
BM_T3TOS    EQU (1<<T3TOS)       

T3ENA       EQU 7       ; Timer3 Enable
BM_T3ENA    EQU (1<<T3ENA)       

; T3ICRH - Timer3 input capture High Byte Register
T3ICR8       EQU 0       ; Timer3 input capture bit 8
BM_T3ICR8    EQU (1<<T3ICR8)       

T3ICR9       EQU 1       ; Timer3 input capture bit 9
BM_T3ICR9    EQU (1<<T3ICR9)       

T3ICR10       EQU 2       ; Timer3 input capture bit 10
BM_T3ICR10    EQU (1<<T3ICR10)       

T3ICR11       EQU 3       ; Timer3 input capture bit 11
BM_T3ICR11    EQU (1<<T3ICR11)       

