camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
T3ICR12       EQU 4       ; Timer3 input capture bit 12
BM_T3ICR12    EQU (1<<T3ICR12)       

T3ICR13       EQU 5       ; Timer3 input capture bit 13
BM_T3ICR13    EQU (1<<T3ICR13)       

T3ICR14       EQU 6       ; Timer3 input capture bit 14
BM_T3ICR14    EQU (1<<T3ICR14)       

T3ICR15       EQU 7       ; Timer3 input capture bit 15
BM_T3ICR15    EQU (1<<T3ICR15)       

; T3ICRL - Timer3 input capture Low Byte Register
T3ICR0       EQU 0       ; Timer3 input capture bit 0
BM_T3ICR0    EQU (1<<T3ICR0)       

T3ICR1       EQU 1       ; Timer3 input capture bit 1
BM_T3ICR1    EQU (1<<T3ICR1)       

T3ICR2       EQU 2       ; Timer3 input capture bit 2
BM_T3ICR2    EQU (1<<T3ICR2)       

T3ICR3       EQU 3       ; Timer3 input capture bit 3
BM_T3ICR3    EQU (1<<T3ICR3)       

T3ICR4       EQU 4       ; Timer3 input capture bit 4
BM_T3ICR4    EQU (1<<T3ICR4)       

T3ICR5       EQU 5       ; Timer3 input capture bit 5
BM_T3ICR5    EQU (1<<T3ICR5)       

T3ICR6       EQU 6       ; Timer3 input capture bit 6
BM_T3ICR6    EQU (1<<T3ICR6)       

T3ICR7       EQU 7       ; Timer3 input capture bit 7
BM_T3ICR7    EQU (1<<T3ICR7)       

; T3IFR - Timer3 interrupt flag Register
T3OFF       EQU 0       ; Timer3 OverFlow Flag
BM_T3OFF    EQU (1<<T3OFF)       

T3COF       EQU 1       ; Timer3 Compare Flag
BM_T3COF    EQU (1<<T3COF)       

T3ICF       EQU 2       ; Timer3 Input Capture Flag
BM_T3ICF    EQU (1<<T3ICF)       

; T3IMR - Timer3 interrupt mask Register
T3OIM       EQU 0       ; Timer3 Overflow Interrupt Mask
BM_T3OIM    EQU (1<<T3OIM)       

T3CIM       EQU 1       ; Timer3 Compare Interrupt Mask
BM_T3CIM    EQU (1<<T3CIM)       

T3CPIM       EQU 2       ; Timer3 Capture Interrupt Mask
BM_T3CPIM    EQU (1<<T3CPIM)       

; T3MRA - Timer3 mode Register
T3CS0       EQU 0       ; Timer3 Clock Select bit 0
BM_T3CS0    EQU (1<<T3CS0)       

T3CS1       EQU 1       ; Timer3 Clock Select bit 1
BM_T3CS1    EQU (1<<T3CS1)       

T3PS0       EQU 2       ; Timer3 Prescaler Select bit 0
BM_T3PS0    EQU (1<<T3PS0)       

T3PS1       EQU 3       ; Timer3 Prescaler Select bit 1
BM_T3PS1    EQU (1<<T3PS1)       

T3PS2       EQU 4       ; Timer3 Prescaler Select bit 2
BM_T3PS2    EQU (1<<T3PS2)       

; T3MRB - Timer3 mode Register
T3SCE       EQU 1       ; Timer3 Software Capture Enable
BM_T3SCE    EQU (1<<T3SCE)       

T3CNC       EQU 2       ; Timer3 input Capture Noise Canceller
BM_T3CNC    EQU (1<<T3CNC)       

T3CE0       EQU 3       ; Timer3 Capture Edge select bit 0
BM_T3CE0    EQU (1<<T3CE0)       

T3CE1       EQU 4       ; Timer3 Capture Edge select bit 1
BM_T3CE1    EQU (1<<T3CE1)       

T3ICS0       EQU 5       ; Timer3 Input Capture Select bit 0
BM_T3ICS0    EQU (1<<T3ICS0)       

T3ICS1       EQU 6       ; Timer3 Input Capture Select bit 1
BM_T3ICS1    EQU (1<<T3ICS1)       

T3ICS2       EQU 7       ; Timer3 Input Capture Select bit 2
BM_T3ICS2    EQU (1<<T3ICS2)       

; ***** TIMER4 ***********************
; T4CNTH - Timer4 counter High Byte Register
T4CNT8       EQU 0       ; Timer4 counter bit 8
BM_T4CNT8    EQU (1<<T4CNT8)       

T4CNT9       EQU 1       ; Timer4 counter bit 9
BM_T4CNT9    EQU (1<<T4CNT9)       

T4CNT10       EQU 2       ; Timer4 counter bit 10
BM_T4CNT10    EQU (1<<T4CNT10)       

T4CNT11       EQU 3       ; Timer4 counter bit 11
BM_T4CNT11    EQU (1<<T4CNT11)       

T4CNT12       EQU 4       ; Timer4 counter bit 12
BM_T4CNT12    EQU (1<<T4CNT12)       

T4CNT13       EQU 5       ; Timer4 counter bit 13
BM_T4CNT13    EQU (1<<T4CNT13)       

T4CNT14       EQU 6       ; Timer4 counter bit 14
BM_T4CNT14    EQU (1<<T4CNT14)       

T4CNT15       EQU 7       ; Timer4 counter bit 15
BM_T4CNT15    EQU (1<<T4CNT15)       

; T4CNTL - Timer4 counter Low Byte Register
T4CNT0       EQU 0       ; Timer4 counter bit 0
BM_T4CNT0    EQU (1<<T4CNT0)       

T4CNT1       EQU 1       ; Timer4 counter bit 1
BM_T4CNT1    EQU (1<<T4CNT1)       

T4CNT2       EQU 2       ; Timer4 counter bit 2
BM_T4CNT2    EQU (1<<T4CNT2)       

T4CNT3       EQU 3       ; Timer4 counter bit 3
BM_T4CNT3    EQU (1<<T4CNT3)       

T4CNT4       EQU 4       ; Timer4 counter bit 4
BM_T4CNT4    EQU (1<<T4CNT4)       

T4CNT5       EQU 5       ; Timer4 counter bit 5
BM_T4CNT5    EQU (1<<T4CNT5)       

T4CNT6       EQU 6       ; Timer4 counter bit 6
BM_T4CNT6    EQU (1<<T4CNT6)       

T4CNT7       EQU 7       ; Timer4 counter bit 7
BM_T4CNT7    EQU (1<<T4CNT7)       

; T4CORH - Timer4 compare high Byte Register
T4COR8       EQU 0       ; Timer4 compare bit 8
BM_T4COR8    EQU (1<<T4COR8)       

T4COR9       EQU 1       ; Timer4 compare bit 9
BM_T4COR9    EQU (1<<T4COR9)       

T4COR10       EQU 2       ; Timer4 compare bit 10
BM_T4COR10    EQU (1<<T4COR10)       

T4COR11       EQU 3       ; Timer4 compare bit 11
BM_T4COR11    EQU (1<<T4COR11)       

T4COR12       EQU 4       ; Timer4 compare bit 12
BM_T4COR12    EQU (1<<T4COR12)       

T4COR13       EQU 5       ; Timer4 compare bit 13
BM_T4COR13    EQU (1<<T4COR13)       

T4COR14       EQU 6       ; Timer4 compare bit 14
BM_T4COR14    EQU (1<<T4COR14)       

T4COR15       EQU 7       ; Timer4 compare bit 15
BM_T4COR15    EQU (1<<T4COR15)       

; T4CORL - Timer4 compare Low Byte Register
T4COR0       EQU 0       ; Timer4 compare bit 0
BM_T4COR0    EQU (1<<T4COR0)       

T4COR1       EQU 1       ; Timer4 compare bit 1
BM_T4COR1    EQU (1<<T4COR1)       

T4COR2       EQU 2       ; Timer4 compare bit 2
BM_T4COR2    EQU (1<<T4COR2)       

T4COR3       EQU 3       ; Timer4 compare bit 3
BM_T4COR3    EQU (1<<T4COR3)       

T4COR4       EQU 4       ; Timer4 compare bit 4
BM_T4COR4    EQU (1<<T4COR4)       

T4COR5       EQU 5       ; Timer4 compare bit 5
BM_T4COR5    EQU (1<<T4COR5)       

T4COR6       EQU 6       ; Timer4 compare bit 6
BM_T4COR6    EQU (1<<T4COR6)       

T4COR7       EQU 7       ; Timer4 compare bit 7
BM_T4COR7    EQU (1<<T4COR7)       

; T4CR - Timer4 control Register
T4OTM       EQU 0       ; Timer4 Overflow Toggle Mask
BM_T4OTM    EQU (1<<T4OTM)       

T4CTM       EQU 1       ; Timer4 Compare Toggle Mask
BM_T4CTM    EQU (1<<T4CTM)       

