camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
T4CRM       EQU 2       ; Timer4 Compare Reset Mask
BM_T4CRM    EQU (1<<T4CRM)       

T4CPRM       EQU 3       ; Timer4 CaPture Reset Mask
BM_T4CPRM    EQU (1<<T4CPRM)       

T4TOP       EQU 4       ; Timer4 Toggle Output Preset
BM_T4TOP    EQU (1<<T4TOP)       

T4RES       EQU 5       ; Timer4 Reset
BM_T4RES    EQU (1<<T4RES)       

T4TOS       EQU 6       ; Timer4 Toggle with Start
BM_T4TOS    EQU (1<<T4TOS)       

T4ENA       EQU 7       ; Timer4 Enable
BM_T4ENA    EQU (1<<T4ENA)       

; T4ICRH - Timer4 input capture High Byte Register
T4ICR8       EQU 0       ; Timer4 input capture bit 8
BM_T4ICR8    EQU (1<<T4ICR8)       

T4ICR9       EQU 1       ; Timer4 input capture bit 9
BM_T4ICR9    EQU (1<<T4ICR9)       

T4ICR10       EQU 2       ; Timer4 input capture bit 10
BM_T4ICR10    EQU (1<<T4ICR10)       

T4ICR11       EQU 3       ; Timer4 input capture bit 11
BM_T4ICR11    EQU (1<<T4ICR11)       

T4ICR12       EQU 4       ; Timer4 input capture bit 12
BM_T4ICR12    EQU (1<<T4ICR12)       

T4ICR13       EQU 5       ; Timer4 input capture bit 13
BM_T4ICR13    EQU (1<<T4ICR13)       

T4ICR14       EQU 6       ; Timer4 input capture bit 14
BM_T4ICR14    EQU (1<<T4ICR14)       

T4ICR15       EQU 7       ; Timer4 input capture bit 15
BM_T4ICR15    EQU (1<<T4ICR15)       

; T4ICRL - Timer4 input capture Low Byte Register
T4ICR0       EQU 0       ; Timer4 input capture bit 0
BM_T4ICR0    EQU (1<<T4ICR0)       

T4ICR1       EQU 1       ; Timer4 input capture bit 1
BM_T4ICR1    EQU (1<<T4ICR1)       

T4ICR2       EQU 2       ; Timer4 input capture bit 2
BM_T4ICR2    EQU (1<<T4ICR2)       

T4ICR3       EQU 3       ; Timer4 input capture bit 3
BM_T4ICR3    EQU (1<<T4ICR3)       

T4ICR4       EQU 4       ; Timer4 input capture bit 4
BM_T4ICR4    EQU (1<<T4ICR4)       

T4ICR5       EQU 5       ; Timer4 input capture bit 5
BM_T4ICR5    EQU (1<<T4ICR5)       

T4ICR6       EQU 6       ; Timer4 input capture bit 6
BM_T4ICR6    EQU (1<<T4ICR6)       

T4ICR7       EQU 7       ; Timer4 input capture bit 7
BM_T4ICR7    EQU (1<<T4ICR7)       

; T4IFR - Timer4 interrupt flag Register
T4OFF       EQU 0       ; Timer4 OverFlow Flag
BM_T4OFF    EQU (1<<T4OFF)       

T4COF       EQU 1       ; Timer4 Compare Flag
BM_T4COF    EQU (1<<T4COF)       

T4ICF       EQU 2       ; Timer4 Input Capture Flag
BM_T4ICF    EQU (1<<T4ICF)       

; T4IMR - Timer4 interrupt mask Register
T4OIM       EQU 0       ; Timer4 Overflow Interrupt Mask
BM_T4OIM    EQU (1<<T4OIM)       

T4CIM       EQU 1       ; Timer4 Compare Interrupt Mask
BM_T4CIM    EQU (1<<T4CIM)       

T4CPIM       EQU 2       ; Timer4 Capture Interrupt Mask
BM_T4CPIM    EQU (1<<T4CPIM)       

; T4MRA - Timer4 mode Register
T4CS0       EQU 0       ; Timer4 Clock Select bit 0
BM_T4CS0    EQU (1<<T4CS0)       

T4CS1       EQU 1       ; Timer4 Clock Select bit 1
BM_T4CS1    EQU (1<<T4CS1)       

T4PS0       EQU 2       ; Timer4 Prescaler Select bit 0
BM_T4PS0    EQU (1<<T4PS0)       

T4PS1       EQU 3       ; Timer4 Prescaler Select bit 1
BM_T4PS1    EQU (1<<T4PS1)       

T4PS2       EQU 4       ; Timer4 Prescaler Select bit 2
BM_T4PS2    EQU (1<<T4PS2)       

; T4MRB - Timer4 mode Register
T4SCE       EQU 1       ; Timer4 Software Capture Enable
BM_T4SCE    EQU (1<<T4SCE)       

T4CNC       EQU 2       ; Timer4 input Capture Noise Canceller
BM_T4CNC    EQU (1<<T4CNC)       

T4CE0       EQU 3       ; Timer4 Capture Edge select bit 0
BM_T4CE0    EQU (1<<T4CE0)       

T4CE1       EQU 4       ; Timer4 Capture Edge select bit 1
BM_T4CE1    EQU (1<<T4CE1)       

T4ICS0       EQU 5       ; Timer4 Input Capture Select bit 0
BM_T4ICS0    EQU (1<<T4ICS0)       

T4ICS1       EQU 6       ; Timer4 Input Capture Select bit 1
BM_T4ICS1    EQU (1<<T4ICS1)       

T4ICS2       EQU 7       ; Timer4 Input Capture Select bit 2
BM_T4ICS2    EQU (1<<T4ICS2)       

; ***** TIMER5 ***********************
; GTCCR - General Timer/Counter Control Register
PSR10       EQU 0       ; PreScaler Reset
BM_PSR10    EQU (1<<PSR10)       

TSM       EQU 7       ; Timer/Counter Synchronization Mode
BM_TSM    EQU (1<<TSM)       

; T5CCR - Timer5 Control Register
T5CS0       EQU 0       ; Timer5 Clock Select bit 0
BM_T5CS0    EQU (1<<T5CS0)       

T5CS1       EQU 1       ; Timer5 Clock Select bit 1
BM_T5CS1    EQU (1<<T5CS1)       

T5CS2       EQU 2       ; Timer5 Clock Select bit 2
BM_T5CS2    EQU (1<<T5CS2)       

T5CTC       EQU 3       ; Clear Timer5 on Compare Match
BM_T5CTC    EQU (1<<T5CTC)       

; T5CNTH - Timer5 Counter High byte
T5CNT8       EQU 0       ; Timer5 Counter bit 8
BM_T5CNT8    EQU (1<<T5CNT8)       

T5CNT9       EQU 1       ; Timer5 Counter bit 9
BM_T5CNT9    EQU (1<<T5CNT9)       

T5CNT10       EQU 2       ; Timer5 Counter bit 10
BM_T5CNT10    EQU (1<<T5CNT10)       

T5CNT11       EQU 3       ; Timer5 Counter bit 11
BM_T5CNT11    EQU (1<<T5CNT11)       

T5CNT12       EQU 4       ; Timer5 Counter bit 12
BM_T5CNT12    EQU (1<<T5CNT12)       

T5CNT13       EQU 5       ; Timer5 Counter bit 13
BM_T5CNT13    EQU (1<<T5CNT13)       

T5CNT14       EQU 6       ; Timer5 Counter bit 14
BM_T5CNT14    EQU (1<<T5CNT14)       

T5CNT15       EQU 7       ; Timer5 Counter bit 15
BM_T5CNT15    EQU (1<<T5CNT15)       

; T5CNTL - Timer5 Counter Low byte
T5CNT0       EQU 0       ; Timer5 Counter bit 0
BM_T5CNT0    EQU (1<<T5CNT0)       

T5CNT1       EQU 1       ; Timer5 Counter bit 1
BM_T5CNT1    EQU (1<<T5CNT1)       

T5CNT2       EQU 2       ; Timer5 Counter bit 2
BM_T5CNT2    EQU (1<<T5CNT2)       

T5CNT3       EQU 3       ; Timer5 Counter bit 3
BM_T5CNT3    EQU (1<<T5CNT3)       

T5CNT4       EQU 4       ; Timer5 Counter bit 4
BM_T5CNT4    EQU (1<<T5CNT4)       

T5CNT5       EQU 5       ; Timer5 Counter bit 5
BM_T5CNT5    EQU (1<<T5CNT5)       

T5CNT6       EQU 6       ; Timer5 Counter bit 6
BM_T5CNT6    EQU (1<<T5CNT6)       

T5CNT7       EQU 7       ; Timer5 Counter bit 7
BM_T5CNT7    EQU (1<<T5CNT7)       

; T5IFR - Timer5 Interrupt Flag Register
T5OFF       EQU 0       ; Timer5 Output Overflow Flag
BM_T5OFF    EQU (1<<T5OFF)       

T5COF       EQU 1       ; Timer5 Output Compare Output Match Flag
BM_T5COF    EQU (1<<T5COF)       

; T5IMR - Timer5 Interrupt Mask Register
T5OIM       EQU 0       ; Timer5 Output Overflow Interrupt Mask
BM_T5OIM    EQU (1<<T5OIM)       

T5CIM       EQU 1       ; Timer5 Output Compare Interrupt Mask
BM_T5CIM    EQU (1<<T5CIM)       

; T5OCRH - Timer5 Output Compare Register High byte
T5OCR8       EQU 0       ; Timer5 Output Compare Register bit 8
BM_T5OCR8    EQU (1<<T5OCR8)       

T5OCR9       EQU 1       ; Timer5 Output Compare Register bit 9
BM_T5OCR9    EQU (1<<T5OCR9)       

