camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
T5OCR10       EQU 2       ; Timer5 Output Compare Register bit 10
BM_T5OCR10    EQU (1<<T5OCR10)       

T5OCR11       EQU 3       ; Timer5 Output Compare Register bit 11
BM_T5OCR11    EQU (1<<T5OCR11)       

T5OCR12       EQU 4       ; Timer5 Output Compare Register bit 12
BM_T5OCR12    EQU (1<<T5OCR12)       

T5OCR13       EQU 5       ; Timer5 Output Compare Register bit 13
BM_T5OCR13    EQU (1<<T5OCR13)       

T5OCR14       EQU 6       ; Timer5 Output Compare Register bit 14
BM_T5OCR14    EQU (1<<T5OCR14)       

T5OCR15       EQU 7       ; Timer5 Output Compare Register bit 15
BM_T5OCR15    EQU (1<<T5OCR15)       

; T5OCRL - Timer5 Output Compare Register Low byte
T5OCR0       EQU 0       ; Timer5 Output Compare Register bit 0
BM_T5OCR0    EQU (1<<T5OCR0)       

T5OCR1       EQU 1       ; Timer5 Output Compare Register bit 1
BM_T5OCR1    EQU (1<<T5OCR1)       

T5OCR2       EQU 2       ; Timer5 Output Compare Register bit 2
BM_T5OCR2    EQU (1<<T5OCR2)       

T5OCR3       EQU 3       ; Timer5 Output Compare Register bit 3
BM_T5OCR3    EQU (1<<T5OCR3)       

T5OCR4       EQU 4       ; Timer5 Output Compare Register bit 4
BM_T5OCR4    EQU (1<<T5OCR4)       

T5OCR5       EQU 5       ; Timer5 Output Compare Register bit 5
BM_T5OCR5    EQU (1<<T5OCR5)       

T5OCR6       EQU 6       ; Timer5 Output Compare Register bit 6
BM_T5OCR6    EQU (1<<T5OCR6)       

T5OCR7       EQU 7       ; Timer5 Output Compare Register bit 7
BM_T5OCR7    EQU (1<<T5OCR7)       

; T5TEMP - Timer5 Temp Register
T5TEMP0       EQU 0       ; Timer5 Temp bit 0
BM_T5TEMP0    EQU (1<<T5TEMP0)       

T5TEMP1       EQU 1       ; Timer5 Temp bit 1
BM_T5TEMP1    EQU (1<<T5TEMP1)       

T5TEMP2       EQU 2       ; Timer5 Temp bit 2
BM_T5TEMP2    EQU (1<<T5TEMP2)       

T5TEMP3       EQU 3       ; Timer5 Temp bit 3
BM_T5TEMP3    EQU (1<<T5TEMP3)       

T5TEMP4       EQU 4       ; Timer5 Temp bit 4
BM_T5TEMP4    EQU (1<<T5TEMP4)       

T5TEMP5       EQU 5       ; Timer5 Temp bit 5
BM_T5TEMP5    EQU (1<<T5TEMP5)       

T5TEMP6       EQU 6       ; Timer5 Temp bit 6
BM_T5TEMP6    EQU (1<<T5TEMP6)       

T5TEMP7       EQU 7       ; Timer5 Temp bit 7
BM_T5TEMP7    EQU (1<<T5TEMP7)       

; ***** TMO **************************
; TMOCR - Timer Modulator Output Control Register
TO1PIS0       EQU 0       ; Timer modulator Output 1 Port Interface Select bit 0
BM_TO1PIS0    EQU (1<<TO1PIS0)       

TO1PIS1       EQU 1       ; Timer modulator Output 1 Port Interface Select bit 1
BM_TO1PIS1    EQU (1<<TO1PIS1)       

TO2PIS0       EQU 2       ; Timer modulator Output 2 Port Interface Select bit 0
BM_TO2PIS0    EQU (1<<TO2PIS0)       

TO2PIS1       EQU 3       ; Timer modulator Output 2 Port Interface Select bit 1
BM_TO2PIS1    EQU (1<<TO2PIS1)       

TO3PIS0       EQU 4       ; Timer modulator Output 3 Port Interface Select bit 0
BM_TO3PIS0    EQU (1<<TO3PIS0)       

TO3PIS1       EQU 5       ; Timer modulator Output 3 Port Interface Select bit 1
BM_TO3PIS1    EQU (1<<TO3PIS1)       

TO4PIS0       EQU 6       ; Timer modulator Output 4 Port Interface Select bit 0
BM_TO4PIS0    EQU (1<<TO4PIS0)       

TO4PIS1       EQU 7       ; Timer modulator Output 4 Port Interface Select bit 1
BM_TO4PIS1    EQU (1<<TO4PIS1)       

; ***** TPLF_CAL *********************
; LFCPR - LF Receiver Calibration Protect Register
LFCALP       EQU 0       ; LF Calibration Protection
BM_LFCALP    EQU (1<<LFCALP)       

LFCALRY       EQU 1       ; LF Calibration Ready
BM_LFCALRY    EQU (1<<LFCALRY)       

TPCD       EQU 6       ; Transponder Constant Disable
BM_TPCD    EQU (1<<TPCD)       

LFCPCE       EQU 7       ; LF Calibration Protect Change Enable
BM_LFCPCE    EQU (1<<LFCPCE)       

; SRCCAL - Slow RC oscillator calibration
SRCCAL1       EQU 0       ; Slow RC oscillator calibration bit 1
BM_SRCCAL1    EQU (1<<SRCCAL1)       

SRCCAL2       EQU 1       ; Slow RC oscillator calibration bit 2
BM_SRCCAL2    EQU (1<<SRCCAL2)       

SRCCAL3       EQU 2       ; Slow RC oscillator calibration bit 3
BM_SRCCAL3    EQU (1<<SRCCAL3)       

SRCCAL4       EQU 3       ; Slow RC oscillator calibration bit 4
BM_SRCCAL4    EQU (1<<SRCCAL4)       

SRCCAL5       EQU 4       ; Slow RC oscillator calibration bit 5
BM_SRCCAL5    EQU (1<<SRCCAL5)       

SRCCAL6       EQU 5       ; Slow RC oscillator calibration bit 6
BM_SRCCAL6    EQU (1<<SRCCAL6)       

SRCCAL7       EQU 6       ; Slow RC oscillator calibration bit 7
BM_SRCCAL7    EQU (1<<SRCCAL7)       

SRCCAL8       EQU 7       ; Slow RC oscillator calibration bit 8
BM_SRCCAL8    EQU (1<<SRCCAL8)       

; SRCCALL - Slow RC oscillator calibration LSB
SRCCAL0       EQU 0       ; Slow RC oscillator calibration bit 0
BM_SRCCAL0    EQU (1<<SRCCAL0)       

; SRCTCAL - SRC oscillator Temperature Compensation register
SRCTC0       EQU 0       ; SRC Oscillator Temperature Compensation bit 0
BM_SRCTC0    EQU (1<<SRCTC0)       

SRCTC1       EQU 1       ; SRC Oscillator Temperature Compensation bit 1
BM_SRCTC1    EQU (1<<SRCTC1)       

SRCTC2       EQU 2       ; SRC Oscillator Temperature Compensation bit 2
BM_SRCTC2    EQU (1<<SRCTC2)       

SRCS0       EQU 3       ; SRC Oscillator Select delta current bit 0
BM_SRCS0    EQU (1<<SRCS0)       

SRCS1       EQU 4       ; SRC Oscillator Select delta current bit 1
BM_SRCS1    EQU (1<<SRCS1)       

DIS_SRC       EQU 6       ; Disable SRC Bandgap
BM_DIS_SRC    EQU (1<<DIS_SRC)       

HOLD_SRC       EQU 7       ; Stop SRC-Osccillator output
BM_HOLD_SRC    EQU (1<<HOLD_SRC)       

; ***** TWI1 *************************
; TW1AMR - TWI1 Address Mask Register
TW1AM0       EQU 1       ; TWI1 Address Mask bit 0
BM_TW1AM0    EQU (1<<TW1AM0)       

TW1AM1       EQU 2       ; TWI1 Address Mask bit 1
BM_TW1AM1    EQU (1<<TW1AM1)       

TW1AM2       EQU 3       ; TWI1 Address Mask bit 2
BM_TW1AM2    EQU (1<<TW1AM2)       

TW1AM3       EQU 4       ; TWI1 Address Mask bit 3
BM_TW1AM3    EQU (1<<TW1AM3)       

TW1AM4       EQU 5       ; TWI1 Address Mask bit 4
BM_TW1AM4    EQU (1<<TW1AM4)       

TW1AM5       EQU 6       ; TWI1 Address Mask bit 5
BM_TW1AM5    EQU (1<<TW1AM5)       

TW1AM6       EQU 7       ; TWI1 Address Mask bit 6
BM_TW1AM6    EQU (1<<TW1AM6)       

; TW1AR - TWI1 (Slave) Address Register
TW1GCE       EQU 0       ; TWI1 General Call Recognition Enable
BM_TW1GCE    EQU (1<<TW1GCE)       

TW1A0       EQU 1       ; TWI1 (Slave) Address bit 0
BM_TW1A0    EQU (1<<TW1A0)       

TW1A1       EQU 2       ; TWI1 (Slave) Address bit 1
BM_TW1A1    EQU (1<<TW1A1)       

