camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
TW1A2       EQU 3       ; TWI1 (Slave) Address bit 2
BM_TW1A2    EQU (1<<TW1A2)       

TW1A3       EQU 4       ; TWI1 (Slave) Address bit 3
BM_TW1A3    EQU (1<<TW1A3)       

TW1A4       EQU 5       ; TWI1 (Slave) Address bit 4
BM_TW1A4    EQU (1<<TW1A4)       

TW1A5       EQU 6       ; TWI1 (Slave) Address bit 5
BM_TW1A5    EQU (1<<TW1A5)       

TW1A6       EQU 7       ; TWI1 (Slave) Address bit 6
BM_TW1A6    EQU (1<<TW1A6)       

; TW1BR - TWI1 Bit Rate Register
TW1BR0       EQU 0       ; TWI1 Bit Rate bit 0
BM_TW1BR0    EQU (1<<TW1BR0)       

TW1BR1       EQU 1       ; TWI1 Bit Rate bit 1
BM_TW1BR1    EQU (1<<TW1BR1)       

TW1BR2       EQU 2       ; TWI1 Bit Rate bit 2
BM_TW1BR2    EQU (1<<TW1BR2)       

TW1BR3       EQU 3       ; TWI1 Bit Rate bit 3
BM_TW1BR3    EQU (1<<TW1BR3)       

TW1BR4       EQU 4       ; TWI1 Bit Rate bit 4
BM_TW1BR4    EQU (1<<TW1BR4)       

TW1BR5       EQU 5       ; TWI1 Bit Rate bit 5
BM_TW1BR5    EQU (1<<TW1BR5)       

TW1BR6       EQU 6       ; TWI1 Bit Rate bit 6
BM_TW1BR6    EQU (1<<TW1BR6)       

TW1BR7       EQU 7       ; TWI1 Bit Rate bit 7
BM_TW1BR7    EQU (1<<TW1BR7)       

; TW1CR - TWI1 Control Register
TW1IE       EQU 0       ; TWI1 Interrupt Enable
BM_TW1IE    EQU (1<<TW1IE)       

TW1EN       EQU 2       ; TWI1 Enable
BM_TW1EN    EQU (1<<TW1EN)       

TW1WC       EQU 3       ; TWI1 Write Collision Flag
BM_TW1WC    EQU (1<<TW1WC)       

TW1STO       EQU 4       ; TWI1 STOP Condition
BM_TW1STO    EQU (1<<TW1STO)       

TW1STA       EQU 5       ; TWI1 START Condition
BM_TW1STA    EQU (1<<TW1STA)       

TW1EA       EQU 6       ; TWI1 Enable Acknowledge
BM_TW1EA    EQU (1<<TW1EA)       

TW1INT       EQU 7       ; TWI1 Interrupt Flag
BM_TW1INT    EQU (1<<TW1INT)       

; TW1DR - TWI1 Data Register
TW1D0       EQU 0       ; TWI1 Data bit 0
BM_TW1D0    EQU (1<<TW1D0)       

TW1D1       EQU 1       ; TWI1 Data bit 1
BM_TW1D1    EQU (1<<TW1D1)       

TW1D2       EQU 2       ; TWI1 Data bit 2
BM_TW1D2    EQU (1<<TW1D2)       

TW1D3       EQU 3       ; TWI1 Data bit 3
BM_TW1D3    EQU (1<<TW1D3)       

TW1D4       EQU 4       ; TWI1 Data bit 4
BM_TW1D4    EQU (1<<TW1D4)       

TW1D5       EQU 5       ; TWI1 Data bit 5
BM_TW1D5    EQU (1<<TW1D5)       

TW1D6       EQU 6       ; TWI1 Data bit 6
BM_TW1D6    EQU (1<<TW1D6)       

TW1D7       EQU 7       ; TWI1 Data bit 7
BM_TW1D7    EQU (1<<TW1D7)       

; TW1SR - TWI1 Status Register
TW1PS0       EQU 0       ; TWI1 Prescaler bit 0
BM_TW1PS0    EQU (1<<TW1PS0)       

TW1PS1       EQU 1       ; TWI1 Prescaler bit 1
BM_TW1PS1    EQU (1<<TW1PS1)       

TW1S0       EQU 3       ; TWI1 Status bit 0
BM_TW1S0    EQU (1<<TW1S0)       

TW1S1       EQU 4       ; TWI1 Status bit 1
BM_TW1S1    EQU (1<<TW1S1)       

TW1S2       EQU 5       ; TWI1 Status bit 2
BM_TW1S2    EQU (1<<TW1S2)       

TW1S3       EQU 6       ; TWI1 Status bit 3
BM_TW1S3    EQU (1<<TW1S3)       

TW1S4       EQU 7       ; TWI1 Status bit 4
BM_TW1S4    EQU (1<<TW1S4)       

; ***** TWI2 *************************
; TW2AMR - TWI2 Address Mask Register
TW2AM0       EQU 1       ; TWI2 Address Mask bit 0
BM_TW2AM0    EQU (1<<TW2AM0)       

TW2AM1       EQU 2       ; TWI2 Address Mask bit 1
BM_TW2AM1    EQU (1<<TW2AM1)       

TW2AM2       EQU 3       ; TWI2 Address Mask bit 2
BM_TW2AM2    EQU (1<<TW2AM2)       

TW2AM3       EQU 4       ; TWI2 Address Mask bit 3
BM_TW2AM3    EQU (1<<TW2AM3)       

TW2AM4       EQU 5       ; TWI2 Address Mask bit 4
BM_TW2AM4    EQU (1<<TW2AM4)       

TW2AM5       EQU 6       ; TWI2 Address Mask bit 5
BM_TW2AM5    EQU (1<<TW2AM5)       

TW2AM6       EQU 7       ; TWI2 Address Mask bit 6
BM_TW2AM6    EQU (1<<TW2AM6)       

; TW2AR - TWI2 (Slave) Address Register
TW2GCE       EQU 0       ; TWI2 General Call Recognition Enable
BM_TW2GCE    EQU (1<<TW2GCE)       

TW2A0       EQU 1       ; TWI2 (Slave) Address bit 0
BM_TW2A0    EQU (1<<TW2A0)       

TW2A1       EQU 2       ; TWI2 (Slave) Address bit 1
BM_TW2A1    EQU (1<<TW2A1)       

TW2A2       EQU 3       ; TWI2 (Slave) Address bit 2
BM_TW2A2    EQU (1<<TW2A2)       

TW2A3       EQU 4       ; TWI2 (Slave) Address bit 3
BM_TW2A3    EQU (1<<TW2A3)       

TW2A4       EQU 5       ; TWI2 (Slave) Address bit 4
BM_TW2A4    EQU (1<<TW2A4)       

TW2A5       EQU 6       ; TWI2 (Slave) Address bit 5
BM_TW2A5    EQU (1<<TW2A5)       

TW2A6       EQU 7       ; TWI2 (Slave) Address bit 6
BM_TW2A6    EQU (1<<TW2A6)       

; TW2BR - TWI2 Bit Rate Register
TW2BR0       EQU 0       ; TWI2 Bit Rate bit 0
BM_TW2BR0    EQU (1<<TW2BR0)       

TW2BR1       EQU 1       ; TWI2 Bit Rate bit 1
BM_TW2BR1    EQU (1<<TW2BR1)       

TW2BR2       EQU 2       ; TWI2 Bit Rate bit 2
BM_TW2BR2    EQU (1<<TW2BR2)       

TW2BR3       EQU 3       ; TWI2 Bit Rate bit 3
BM_TW2BR3    EQU (1<<TW2BR3)       

TW2BR4       EQU 4       ; TWI2 Bit Rate bit 4
BM_TW2BR4    EQU (1<<TW2BR4)       

TW2BR5       EQU 5       ; TWI2 Bit Rate bit 5
BM_TW2BR5    EQU (1<<TW2BR5)       

TW2BR6       EQU 6       ; TWI2 Bit Rate bit 6
BM_TW2BR6    EQU (1<<TW2BR6)       

TW2BR7       EQU 7       ; TWI2 Bit Rate bit 7
BM_TW2BR7    EQU (1<<TW2BR7)       

; TW2CR - TWI2 Control Register
TW2IE       EQU 0       ; TWI2 Interrupt Enable
BM_TW2IE    EQU (1<<TW2IE)       

TW2EN       EQU 2       ; TWI2 Enable
BM_TW2EN    EQU (1<<TW2EN)       

TW2WC       EQU 3       ; TWI2 Write Collision Flag
BM_TW2WC    EQU (1<<TW2WC)       

TW2STO       EQU 4       ; TWI2 STOP Condition
BM_TW2STO    EQU (1<<TW2STO)       

TW2STA       EQU 5       ; TWI2 START Condition
BM_TW2STA    EQU (1<<TW2STA)       

TW2EA       EQU 6       ; TWI2 Enable Acknowledge
BM_TW2EA    EQU (1<<TW2EA)       

TW2INT       EQU 7       ; TWI2 Interrupt Flag
BM_TW2INT    EQU (1<<TW2INT)       

; TW2DR - TWI2 Data Register
TW2D0       EQU 0       ; TWI2 Data bit 0
BM_TW2D0    EQU (1<<TW2D0)       

TW2D1       EQU 1       ; TWI2 Data bit 1
BM_TW2D1    EQU (1<<TW2D1)       

TW2D2       EQU 2       ; TWI2 Data bit 2
BM_TW2D2    EQU (1<<TW2D2)       

