camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
TW2D3       EQU 3       ; TWI2 Data bit 3
BM_TW2D3    EQU (1<<TW2D3)       

TW2D4       EQU 4       ; TWI2 Data bit 4
BM_TW2D4    EQU (1<<TW2D4)       

TW2D5       EQU 5       ; TWI2 Data bit 5
BM_TW2D5    EQU (1<<TW2D5)       

TW2D6       EQU 6       ; TWI2 Data bit 6
BM_TW2D6    EQU (1<<TW2D6)       

TW2D7       EQU 7       ; TWI2 Data bit 7
BM_TW2D7    EQU (1<<TW2D7)       

; TW2SR - TWI2 Status Register
TW2PS0       EQU 0       ; TWI2 Prescaler bit 0
BM_TW2PS0    EQU (1<<TW2PS0)       

TW2PS1       EQU 1       ; TWI2 Prescaler bit 1
BM_TW2PS1    EQU (1<<TW2PS1)       

TW2S0       EQU 3       ; TWI2 Status bit 0
BM_TW2S0    EQU (1<<TW2S0)       

TW2S1       EQU 4       ; TWI2 Status bit 1
BM_TW2S1    EQU (1<<TW2S1)       

TW2S2       EQU 5       ; TWI2 Status bit 2
BM_TW2S2    EQU (1<<TW2S2)       

TW2S3       EQU 6       ; TWI2 Status bit 3
BM_TW2S3    EQU (1<<TW2S3)       

TW2S4       EQU 7       ; TWI2 Status bit 4
BM_TW2S4    EQU (1<<TW2S4)       

; ***** TXDSP ************************
; BBTE2 - Base Band Test Enable 2
TDEPO       EQU 0       ; Tx DSP External Pin Output
BM_TDEPO    EQU (1<<TDEPO)       

DITDIS       EQU 1       ; Dither Disable on Sigma Delta Modulator
BM_DITDIS    EQU (1<<DITDIS)       

; FFREQ1H - Fractional Frequency 1 Setting, High Byte
FFREQ1H0       EQU 0       ; Fractional Frequency 1 High Byte bit 0
BM_FFREQ1H0    EQU (1<<FFREQ1H0)       

FFREQ1H1       EQU 1       ; Fractional Frequency 1 High Byte bit 1
BM_FFREQ1H1    EQU (1<<FFREQ1H1)       

; FFREQ1L - Fractional Frequency 1 Setting, Low Byte
FFREQ1L0       EQU 0       ; Fractional Frequency 1 Low Byte bit 0
BM_FFREQ1L0    EQU (1<<FFREQ1L0)       

FFREQ1L1       EQU 1       ; Fractional Frequency 1 Low Byte bit 1
BM_FFREQ1L1    EQU (1<<FFREQ1L1)       

FFREQ1L2       EQU 2       ; Fractional Frequency 1 Low Byte bit 2
BM_FFREQ1L2    EQU (1<<FFREQ1L2)       

FFREQ1L3       EQU 3       ; Fractional Frequency 1 Low Byte bit 3
BM_FFREQ1L3    EQU (1<<FFREQ1L3)       

FFREQ1L4       EQU 4       ; Fractional Frequency 1 Low Byte bit 4
BM_FFREQ1L4    EQU (1<<FFREQ1L4)       

FFREQ1L5       EQU 5       ; Fractional Frequency 1 Low Byte bit 5
BM_FFREQ1L5    EQU (1<<FFREQ1L5)       

FFREQ1L6       EQU 6       ; Fractional Frequency 1 Low Byte bit 6
BM_FFREQ1L6    EQU (1<<FFREQ1L6)       

FFREQ1L7       EQU 7       ; Fractional Frequency 1 Low Byte bit 7
BM_FFREQ1L7    EQU (1<<FFREQ1L7)       

; FFREQ1M - Fractional Frequency 1 Setting, Middle Byte
FFREQ1M0       EQU 0       ; Fractional Frequency 1 Middle Byte bit 0
BM_FFREQ1M0    EQU (1<<FFREQ1M0)       

FFREQ1M1       EQU 1       ; Fractional Frequency 1 Middle Byte bit 1
BM_FFREQ1M1    EQU (1<<FFREQ1M1)       

FFREQ1M2       EQU 2       ; Fractional Frequency 1 Middle Byte bit 2
BM_FFREQ1M2    EQU (1<<FFREQ1M2)       

FFREQ1M3       EQU 3       ; Fractional Frequency 1 Middle Byte bit 3
BM_FFREQ1M3    EQU (1<<FFREQ1M3)       

FFREQ1M4       EQU 4       ; Fractional Frequency 1 Middle Byte bit 4
BM_FFREQ1M4    EQU (1<<FFREQ1M4)       

FFREQ1M5       EQU 5       ; Fractional Frequency 1 Middle Byte bit 5
BM_FFREQ1M5    EQU (1<<FFREQ1M5)       

FFREQ1M6       EQU 6       ; Fractional Frequency 1 Middle Byte bit 6
BM_FFREQ1M6    EQU (1<<FFREQ1M6)       

FFREQ1M7       EQU 7       ; Fractional Frequency 1 Middle Byte bit 7
BM_FFREQ1M7    EQU (1<<FFREQ1M7)       

; FFREQ2H - Fractional Frequency 2 Setting, High Byte
FFREQ2H0       EQU 0       ; Fractional Frequency 2 High Byte bit 0
BM_FFREQ2H0    EQU (1<<FFREQ2H0)       

FFREQ2H1       EQU 1       ; Fractional Frequency 2 High Byte bit 1
BM_FFREQ2H1    EQU (1<<FFREQ2H1)       

; FFREQ2L - Fractional Frequency 2 Setting, Low Byte
FFREQ2L0       EQU 0       ; Fractional Frequency 2 Low Byte bit 0
BM_FFREQ2L0    EQU (1<<FFREQ2L0)       

FFREQ2L1       EQU 1       ; Fractional Frequency 2 Low Byte bit 1
BM_FFREQ2L1    EQU (1<<FFREQ2L1)       

FFREQ2L2       EQU 2       ; Fractional Frequency 2 Low Byte bit 2
BM_FFREQ2L2    EQU (1<<FFREQ2L2)       

FFREQ2L3       EQU 3       ; Fractional Frequency 2 Low Byte bit 3
BM_FFREQ2L3    EQU (1<<FFREQ2L3)       

FFREQ2L4       EQU 4       ; Fractional Frequency 2 Low Byte bit 4
BM_FFREQ2L4    EQU (1<<FFREQ2L4)       

FFREQ2L5       EQU 5       ; Fractional Frequency 2 Low Byte bit 5
BM_FFREQ2L5    EQU (1<<FFREQ2L5)       

FFREQ2L6       EQU 6       ; Fractional Frequency 2 Low Byte bit 6
BM_FFREQ2L6    EQU (1<<FFREQ2L6)       

FFREQ2L7       EQU 7       ; Fractional Frequency 2 Low Byte bit 7
BM_FFREQ2L7    EQU (1<<FFREQ2L7)       

; FFREQ2M - Fractional Frequency 2 Setting, Middle Byte
FFREQ2M0       EQU 0       ; Fractional Frequency 2 Middle Byte bit 0
BM_FFREQ2M0    EQU (1<<FFREQ2M0)       

FFREQ2M1       EQU 1       ; Fractional Frequency 2 Middle Byte bit 1
BM_FFREQ2M1    EQU (1<<FFREQ2M1)       

FFREQ2M2       EQU 2       ; Fractional Frequency 2 Middle Byte bit 2
BM_FFREQ2M2    EQU (1<<FFREQ2M2)       

FFREQ2M3       EQU 3       ; Fractional Frequency 2 Middle Byte bit 3
BM_FFREQ2M3    EQU (1<<FFREQ2M3)       

FFREQ2M4       EQU 4       ; Fractional Frequency 2 Middle Byte bit 4
BM_FFREQ2M4    EQU (1<<FFREQ2M4)       

FFREQ2M5       EQU 5       ; Fractional Frequency 2 Middle Byte bit 5
BM_FFREQ2M5    EQU (1<<FFREQ2M5)       

FFREQ2M6       EQU 6       ; Fractional Frequency 2 Middle Byte bit 6
BM_FFREQ2M6    EQU (1<<FFREQ2M6)       

FFREQ2M7       EQU 7       ; Fractional Frequency 2 Middle Byte bit 7
BM_FFREQ2M7    EQU (1<<FFREQ2M7)       

; FSCR - Frequency Synthesizer Control Register
TXMOD       EQU 0       ; Tx Modulation
BM_TXMOD    EQU (1<<TXMOD)       

SFM       EQU 1       ; Select FSK Modulation
BM_SFM    EQU (1<<SFM)       

TXMS0       EQU 2       ; Tx Modulation Source bit 0
BM_TXMS0    EQU (1<<TXMS0)       

TXMS1       EQU 3       ; Tx Modulation Source bit 1
BM_TXMS1    EQU (1<<TXMS1)       

PAOER       EQU 4       ; Power Amplifier Output Enable Register
BM_PAOER    EQU (1<<PAOER)       

PAON       EQU 7       ; Power Amplifier Output is On
BM_PAON    EQU (1<<PAON)       

; FSEN - Frequency Synthesizer Enable register
SDPU       EQU 0       ; Sigma-delta Modulator Power Up
BM_SDPU    EQU (1<<SDPU)       

SDEN       EQU 1       ; Sigma-delta Modulator Enable
BM_SDEN    EQU (1<<SDEN)       

GAEN       EQU 2       ; Gauss Filtering Enable
BM_GAEN    EQU (1<<GAEN)       

