camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
PEEN       EQU 3       ; Pre-emphasis Filtering Enable
BM_PEEN    EQU (1<<PEEN)       

ASEN       EQU 4       ; ASK Shaping Enable
BM_ASEN    EQU (1<<ASEN)       

ANTT       EQU 5       ; Antenna Tuning Active
BM_ANTT    EQU (1<<ANTT)       

; FSFCR - Frequency Synthesizer Filter Control Register
BTSEL0       EQU 0       ; Gauss Filter BT Selection bit 0
BM_BTSEL0    EQU (1<<BTSEL0)       

BTSEL1       EQU 1       ; Gauss Filter BT Selection bit 1
BM_BTSEL1    EQU (1<<BTSEL1)       

ASDIV0       EQU 4       ; ASK Shaping Divider bit 0
BM_ASDIV0    EQU (1<<ASDIV0)       

ASDIV1       EQU 5       ; ASK Shaping Divider bit 1
BM_ASDIV1    EQU (1<<ASDIV1)       

ASDIV2       EQU 6       ; ASK Shaping Divider bit 2
BM_ASDIV2    EQU (1<<ASDIV2)       

ASDIV3       EQU 7       ; ASK Shaping Divider bit 3
BM_ASDIV3    EQU (1<<ASDIV3)       

; GACDIVH - Gauss Clock Divider, High Byte
GACDIV8       EQU 0       ; Gauss Clock Divider bit 8
BM_GACDIV8    EQU (1<<GACDIV8)       

GACDIV9       EQU 1       ; Gauss Clock Divider bit 9
BM_GACDIV9    EQU (1<<GACDIV9)       

GACDIV10       EQU 2       ; Gauss Clock Divider bit 10
BM_GACDIV10    EQU (1<<GACDIV10)       

GACDIV11       EQU 3       ; Gauss Clock Divider bit 11
BM_GACDIV11    EQU (1<<GACDIV11)       

GACDIV12       EQU 4       ; Gauss Clock Divider bit 12
BM_GACDIV12    EQU (1<<GACDIV12)       

; GACDIVL - Gauss Clock Divider, Low Byte
GACDIV0       EQU 0       ; Gauss Clock Divider bit 0
BM_GACDIV0    EQU (1<<GACDIV0)       

GACDIV1       EQU 1       ; Gauss Clock Divider bit 1
BM_GACDIV1    EQU (1<<GACDIV1)       

GACDIV2       EQU 2       ; Gauss Clock Divider bit 2
BM_GACDIV2    EQU (1<<GACDIV2)       

GACDIV3       EQU 3       ; Gauss Clock Divider bit 3
BM_GACDIV3    EQU (1<<GACDIV3)       

GACDIV4       EQU 4       ; Gauss Clock Divider bit 4
BM_GACDIV4    EQU (1<<GACDIV4)       

GACDIV5       EQU 5       ; Gauss Clock Divider bit 5
BM_GACDIV5    EQU (1<<GACDIV5)       

GACDIV6       EQU 6       ; Gauss Clock Divider bit 6
BM_GACDIV6    EQU (1<<GACDIV6)       

GACDIV7       EQU 7       ; Gauss Clock Divider bit 7
BM_GACDIV7    EQU (1<<GACDIV7)       

; ***** TXM **************************
; TMCIH - Tx Modulator CRC Init Value, High Byte
TMCI8       EQU 0       ; Tx Modulator CRC Init Value bit 8
BM_TMCI8    EQU (1<<TMCI8)       

TMCI9       EQU 1       ; Tx Modulator CRC Init Value bit 9
BM_TMCI9    EQU (1<<TMCI9)       

TMCI10       EQU 2       ; Tx Modulator CRC Init Value bit 10
BM_TMCI10    EQU (1<<TMCI10)       

TMCI11       EQU 3       ; Tx Modulator CRC Init Value bit 11
BM_TMCI11    EQU (1<<TMCI11)       

TMCI12       EQU 4       ; Tx Modulator CRC Init Value bit 12
BM_TMCI12    EQU (1<<TMCI12)       

TMCI13       EQU 5       ; Tx Modulator CRC Init Value bit 13
BM_TMCI13    EQU (1<<TMCI13)       

TMCI14       EQU 6       ; Tx Modulator CRC Init Value bit 14
BM_TMCI14    EQU (1<<TMCI14)       

TMCI15       EQU 7       ; Tx Modulator CRC Init Value bit 15
BM_TMCI15    EQU (1<<TMCI15)       

; TMCIL - Tx Modulator CRC Init Value Low Byte
TMCI0       EQU 0       ; Tx Modulator CRC Init Value bit 0
BM_TMCI0    EQU (1<<TMCI0)       

TMCI1       EQU 1       ; Tx Modulator CRC Init Value bit 1
BM_TMCI1    EQU (1<<TMCI1)       

TMCI2       EQU 2       ; Tx Modulator CRC Init Value bit 2
BM_TMCI2    EQU (1<<TMCI2)       

TMCI3       EQU 3       ; Tx Modulator CRC Init Value bit 3
BM_TMCI3    EQU (1<<TMCI3)       

TMCI4       EQU 4       ; Tx Modulator CRC Init Value bit 4
BM_TMCI4    EQU (1<<TMCI4)       

TMCI5       EQU 5       ; Tx Modulator CRC Init Value bit 5
BM_TMCI5    EQU (1<<TMCI5)       

TMCI6       EQU 6       ; Tx Modulator CRC Init Value bit 6
BM_TMCI6    EQU (1<<TMCI6)       

TMCI7       EQU 7       ; Tx Modulator CRC Init Value bit 7
BM_TMCI7    EQU (1<<TMCI7)       

; TMCPH - Tx Modulator CRC Polynomial, High Byte
TMCP8       EQU 0       ; Tx Modulator CRC Polynomial bit 8
BM_TMCP8    EQU (1<<TMCP8)       

TMCP9       EQU 1       ; Tx Modulator CRC Polynomial bit 9
BM_TMCP9    EQU (1<<TMCP9)       

TMCP10       EQU 2       ; Tx Modulator CRC Polynomial bit 10
BM_TMCP10    EQU (1<<TMCP10)       

TMCP11       EQU 3       ; Tx Modulator CRC Polynomial bit 11
BM_TMCP11    EQU (1<<TMCP11)       

TMCP12       EQU 4       ; Tx Modulator CRC Polynomial bit 12
BM_TMCP12    EQU (1<<TMCP12)       

TMCP13       EQU 5       ; Tx Modulator CRC Polynomial bit 13
BM_TMCP13    EQU (1<<TMCP13)       

TMCP14       EQU 6       ; Tx Modulator CRC Polynomial bit 14
BM_TMCP14    EQU (1<<TMCP14)       

TMCP15       EQU 7       ; Tx Modulator CRC Polynomial bit 15
BM_TMCP15    EQU (1<<TMCP15)       

; TMCPL - Tx Modulator CRC Polynomial, Low Byte
TMCP0       EQU 0       ; Tx Modulator CRC Polynomial bit 0
BM_TMCP0    EQU (1<<TMCP0)       

TMCP1       EQU 1       ; Tx Modulator CRC Polynomial bit 1
BM_TMCP1    EQU (1<<TMCP1)       

TMCP2       EQU 2       ; Tx Modulator CRC Polynomial bit 2
BM_TMCP2    EQU (1<<TMCP2)       

TMCP3       EQU 3       ; Tx Modulator CRC Polynomial bit 3
BM_TMCP3    EQU (1<<TMCP3)       

TMCP4       EQU 4       ; Tx Modulator CRC Polynomial bit 4
BM_TMCP4    EQU (1<<TMCP4)       

TMCP5       EQU 5       ; Tx Modulator CRC Polynomial bit 5
BM_TMCP5    EQU (1<<TMCP5)       

TMCP6       EQU 6       ; Tx Modulator CRC Polynomial bit 6
BM_TMCP6    EQU (1<<TMCP6)       

TMCP7       EQU 7       ; Tx Modulator CRC Polynomial bit 7
BM_TMCP7    EQU (1<<TMCP7)       

; TMCR1 - Tx Modulator Control Register 1
TMPIS0       EQU 0       ; Tx Modulator Port Interface Select bit 0
BM_TMPIS0    EQU (1<<TMPIS0)       

TMPIS1       EQU 1       ; Tx Modulator Port Interface Select bit 1
BM_TMPIS1    EQU (1<<TMPIS1)       

TMPIS2       EQU 2       ; Tx Modulator Port Interface Select bit 2
BM_TMPIS2    EQU (1<<TMPIS2)       

TMSCS       EQU 3       ; Tx Modulator Serial Output Clock Select
BM_TMSCS    EQU (1<<TMSCS)       

TMCIM       EQU 4       ; Tx Modulator Transmission Complete Interrupt Mask
BM_TMCIM    EQU (1<<TMCIM)       

; TMCR2 - Tx Modulator Control Register 2
TMCRCE       EQU 0       ; Tx Modulator CRC Enable
BM_TMCRCE    EQU (1<<TMCRCE)       

TMCRCSE0       EQU 1       ; Tx Modulator CRC Select bit 0
BM_TMCRCSE0    EQU (1<<TMCRCSE0)       

