camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
TMCRCSE1       EQU 2       ; Tx Modulator CRC Select bit 1
BM_TMCRCSE1    EQU (1<<TMCRCSE1)       

TMNRZE       EQU 3       ; Tx Modulator NRZ Mode Enable
BM_TMNRZE    EQU (1<<TMNRZE)       

TMPOL       EQU 4       ; Tx Modulator Polarity
BM_TMPOL    EQU (1<<TMPOL)       

TMSSE       EQU 5       ; Tx Modulator Stop Sequence Enable
BM_TMSSE    EQU (1<<TMSSE)       

TMLSB       EQU 6       ; Tx Modulator Least Significant Bit First
BM_TMLSB    EQU (1<<TMLSB)       

; TMCRCH - Tx Modulator CRC Result, High Byte
TMCRC8       EQU 0       ; Tx Modulator CRC Result bit 8
BM_TMCRC8    EQU (1<<TMCRC8)       

TMCRC9       EQU 1       ; Tx Modulator CRC Result bit 9
BM_TMCRC9    EQU (1<<TMCRC9)       

TMCRC10       EQU 2       ; Tx Modulator CRC Result bit 10
BM_TMCRC10    EQU (1<<TMCRC10)       

TMCRC11       EQU 3       ; Tx Modulator CRC Result bit 11
BM_TMCRC11    EQU (1<<TMCRC11)       

TMCRC12       EQU 4       ; Tx Modulator CRC Result bit 12
BM_TMCRC12    EQU (1<<TMCRC12)       

TMCRC13       EQU 5       ; Tx Modulator CRC Result bit 13
BM_TMCRC13    EQU (1<<TMCRC13)       

TMCRC14       EQU 6       ; Tx Modulator CRC Result bit 14
BM_TMCRC14    EQU (1<<TMCRC14)       

TMCRC15       EQU 7       ; Tx Modulator CRC Result bit 15
BM_TMCRC15    EQU (1<<TMCRC15)       

; TMCRCL - Tx Modulator CRC Result, Low Byte
TMCRC0       EQU 0       ; Tx Modulator CRC Result bit 0
BM_TMCRC0    EQU (1<<TMCRC0)       

TMCRC1       EQU 1       ; Tx Modulator CRC Result bit 1
BM_TMCRC1    EQU (1<<TMCRC1)       

TMCRC2       EQU 2       ; Tx Modulator CRC Result bit 2
BM_TMCRC2    EQU (1<<TMCRC2)       

TMCRC3       EQU 3       ; Tx Modulator CRC Result bit 3
BM_TMCRC3    EQU (1<<TMCRC3)       

TMCRC4       EQU 4       ; Tx Modulator CRC Result bit 4
BM_TMCRC4    EQU (1<<TMCRC4)       

TMCRC5       EQU 5       ; Tx Modulator CRC Result bit 5
BM_TMCRC5    EQU (1<<TMCRC5)       

TMCRC6       EQU 6       ; Tx Modulator CRC Result bit 6
BM_TMCRC6    EQU (1<<TMCRC6)       

TMCRC7       EQU 7       ; Tx Modulator CRC Result bit 7
BM_TMCRC7    EQU (1<<TMCRC7)       

; TMCSB - Tx Modulator CRC Skip Bit Number
TMCSB0       EQU 0       ; Tx Modulator CRC Skip Bit Number bit 0
BM_TMCSB0    EQU (1<<TMCSB0)       

TMCSB1       EQU 1       ; Tx Modulator CRC Skip Bit Number bit 1
BM_TMCSB1    EQU (1<<TMCSB1)       

TMCSB2       EQU 2       ; Tx Modulator CRC Skip Bit Number bit 2
BM_TMCSB2    EQU (1<<TMCSB2)       

TMCSB3       EQU 3       ; Tx Modulator CRC Skip Bit Number bit 3
BM_TMCSB3    EQU (1<<TMCSB3)       

TMCSB4       EQU 4       ; Tx Modulator CRC Skip Bit Number bit 4
BM_TMCSB4    EQU (1<<TMCSB4)       

TMCSB5       EQU 5       ; Tx Modulator CRC Skip Bit Number bit 5
BM_TMCSB5    EQU (1<<TMCSB5)       

TMCSB6       EQU 6       ; Tx Modulator CRC Skip Bit Number bit 6
BM_TMCSB6    EQU (1<<TMCSB6)       

TMCSB7       EQU 7       ; Tx Modulator CRC Skip Bit Number bit 7
BM_TMCSB7    EQU (1<<TMCSB7)       

; TMFSM - Tx Modulator Finite State Machine
TMSSM0       EQU 0       ; Tx Modulator Sub State Machine bit 0
BM_TMSSM0    EQU (1<<TMSSM0)       

TMSSM1       EQU 1       ; Tx Modulator Sub State Machine bit 1
BM_TMSSM1    EQU (1<<TMSSM1)       

TMSSM2       EQU 2       ; Tx Modulator Sub State Machine bit 2
BM_TMSSM2    EQU (1<<TMSSM2)       

TMSSM3       EQU 3       ; Tx Modulator Sub State Machine bit 3
BM_TMSSM3    EQU (1<<TMSSM3)       

TMMSM0       EQU 4       ; Tx Modulator Master State Machine bit 0
BM_TMMSM0    EQU (1<<TMMSM0)       

TMMSM1       EQU 5       ; Tx Modulator Master State Machine bit 1
BM_TMMSM1    EQU (1<<TMMSM1)       

TMMSM2       EQU 6       ; Tx Modulator Master State Machine bit 2
BM_TMMSM2    EQU (1<<TMMSM2)       

; TMSHR - Tx Modulator Shift Register
TMSHR0       EQU 0       ; Tx Modulator Shift Register bit 0
BM_TMSHR0    EQU (1<<TMSHR0)       

TMSHR1       EQU 1       ; Tx Modulator Shift Register bit 1
BM_TMSHR1    EQU (1<<TMSHR1)       

TMSHR2       EQU 2       ; Tx Modulator Shift Register bit 2
BM_TMSHR2    EQU (1<<TMSHR2)       

TMSHR3       EQU 3       ; Tx Modulator Shift Register bit 3
BM_TMSHR3    EQU (1<<TMSHR3)       

TMSHR4       EQU 4       ; Tx Modulator Shift Register bit 4
BM_TMSHR4    EQU (1<<TMSHR4)       

TMSHR5       EQU 5       ; Tx Modulator Shift Register bit 5
BM_TMSHR5    EQU (1<<TMSHR5)       

TMSHR6       EQU 6       ; Tx Modulator Shift Register bit 6
BM_TMSHR6    EQU (1<<TMSHR6)       

TMSHR7       EQU 7       ; Tx Modulator Shift Register bit 7
BM_TMSHR7    EQU (1<<TMSHR7)       

; TMSR - Tx Modulator Status Register
TMTCF       EQU 0       ; Tx Modulator Transmission Complete Status Flag
BM_TMTCF    EQU (1<<TMTCF)       

; TMSSC - Tx Modulator Stop Sequence Configuration
TMSSP0       EQU 0       ; Tx Modulator Stop Sequence Pattern bit 0
BM_TMSSP0    EQU (1<<TMSSP0)       

TMSSP1       EQU 1       ; Tx Modulator Stop Sequence Pattern bit 1
BM_TMSSP1    EQU (1<<TMSSP1)       

TMSSP2       EQU 2       ; Tx Modulator Stop Sequence Pattern bit 2
BM_TMSSP2    EQU (1<<TMSSP2)       

TMSSP3       EQU 3       ; Tx Modulator Stop Sequence Pattern bit 3
BM_TMSSP3    EQU (1<<TMSSP3)       

TMSSL0       EQU 4       ; Tx Modulator Stop Sequence Length bit 0
BM_TMSSL0    EQU (1<<TMSSL0)       

TMSSL1       EQU 5       ; Tx Modulator Stop Sequence Length bit 1
BM_TMSSL1    EQU (1<<TMSSL1)       

TMSSL2       EQU 6       ; Tx Modulator Stop Sequence Length bit 2
BM_TMSSL2    EQU (1<<TMSSL2)       

TMSSH       EQU 7       ; Tx Modulator Stop Sequence Hold Mode
BM_TMSSH    EQU (1<<TMSSH)       

; TMTLH - Tx Modulator Telegram Length Register, High Byte
TMTL8       EQU 0       ; Tx Modulator Telegram Length bit 8
BM_TMTL8    EQU (1<<TMTL8)       

TMTL9       EQU 1       ; Tx Modulator Telegram Length bit 9
BM_TMTL9    EQU (1<<TMTL9)       

TMTL10       EQU 2       ; Tx Modulator Telegram Length bit 10
BM_TMTL10    EQU (1<<TMTL10)       

TMTL11       EQU 3       ; Tx Modulator Telegram Length bit 11
BM_TMTL11    EQU (1<<TMTL11)       

; TMTLL - Tx Modulator Telegram Length Register, Low Byte
TMTL0       EQU 0       ; Tx Modulator Telegram Length bit 0
BM_TMTL0    EQU (1<<TMTL0)       

TMTL1       EQU 1       ; Tx Modulator Telegram Length bit 1
BM_TMTL1    EQU (1<<TMTL1)       

