camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/regs.inc
TMTL2       EQU 2       ; Tx Modulator Telegram Length bit 2
BM_TMTL2    EQU (1<<TMTL2)       

TMTL3       EQU 3       ; Tx Modulator Telegram Length bit 3
BM_TMTL3    EQU (1<<TMTL3)       

TMTL4       EQU 4       ; Tx Modulator Telegram Length bit 4
BM_TMTL4    EQU (1<<TMTL4)       

TMTL5       EQU 5       ; Tx Modulator Telegram Length bit 5
BM_TMTL5    EQU (1<<TMTL5)       

TMTL6       EQU 6       ; Tx Modulator Telegram Length bit 6
BM_TMTL6    EQU (1<<TMTL6)       

TMTL7       EQU 7       ; Tx Modulator Telegram Length bit 7
BM_TMTL7    EQU (1<<TMTL7)       

; ***** VX_MODE **********************
; VXMCTRL - VX Mode Control Register
VX_SEL0       EQU 0       ; Select VX voltage level
BM_VX_SEL0    EQU (1<<VX_SEL0)       

VX_SEL1       EQU 1       ; Select VX voltage level
BM_VX_SEL1    EQU (1<<VX_SEL1)       

EN_VX       EQU 2       ; Enable the VX_LDO
BM_EN_VX    EQU (1<<EN_VX)       

EN_VX_OUT       EQU 3       ; Enable PB4 as an VX/VBAT Supply Output
BM_EN_VX_OUT    EQU (1<<EN_VX_OUT)       

EN_VX_IN       EQU 4       ; Enable VX Inputs
BM_EN_VX_IN    EQU (1<<EN_VX_IN)       

; ***** LOCKSBITS ********************************************************
LB1       EQU 0       ; Lock bit
LB2       EQU 1       ; Lock bit
BLB01       EQU 2       ; Boot Lock bit
BLB02       EQU 3       ; Boot Lock bit
BLB11       EQU 4       ; Boot lock bit
BLB12       EQU 5       ; Boot lock bit
; ***** FUSES ************************************************************
; LOW fuse bits
; ***** CPU REGISTER DEFINITIONS *****************************************
;.def       XH       EQU r27
;.def       XL       EQU r26
;.def       YH       EQU r29
;.def       YL       EQU r28
;.def       ZH       EQU r31
;.def       ZL       EQU r30
; ***** DATA MEMORY DECLARATIONS *****************************************
FLASHEND       EQU 0x7fff       ; Note: Word address
IOEND       EQU 0x01ff
SRAM_START       EQU 0x0200
SRAM_SIZE       EQU 1024
RAMEND       EQU 0x05ff
XRAMEND       EQU 0x0000
E2END       EQU 0x097f
EEPROMEND       EQU 0x097f
EEADRBITS       EQU 11
; ***** BOOTLOADER DECLARATIONS ******************************************
NRWW_START_ADDR       EQU 0xc00
NRWW_STOP_ADDR       EQU 0xfff
RWW_START_ADDR       EQU 0x0
RWW_STOP_ADDR       EQU 0xbff
PAGESIZE       EQU 32
FIRSTBOOTSTART       EQU 0x7000
SECONDBOOTSTART       EQU 0x6000
THIRDBOOTSTART       EQU 0x4000
FOURTHBOOTSTART       EQU 0x3600
SMALLBOOTSTART       EQU FIRSTBOOTSTART
LARGEBOOTSTART       EQU FOURTHBOOTSTART
; ***** INTERRUPT VECTORS ************************************************
INT0addr       EQU 0x0002       ; External Interrupt Request 0
INT1addr       EQU 0x0004       ; External Interrupt Request 1
PCI0addr       EQU 0x0006       ; Pin Change Interrupt Request 0
PCI1addr       EQU 0x0008       ; Pin Change Interrupt Request 1
VMONaddr       EQU 0x000a       ; Voltage Monitoring Interrupt
AVCCRaddr       EQU 0x000c       ; AVCC Reset Interrupt
AVCCLaddr       EQU 0x000e       ; AVCC Low Interrupt
T0INTaddr       EQU 0x0010       ; Timer0 Interval Interrupt
T1COMPaddr       EQU 0x0012       ; Timer/Counter1 Compare Match Interrupt
T1OVFaddr       EQU 0x0014       ; Timer/Counter1 Overflow Interrupt
T2COMPaddr       EQU 0x0016       ; Timer/Counter2 Compare Match Interrupt
T2OVFaddr       EQU 0x0018       ; Timer/Counter2 Overflow Interrupt
T3CAPaddr       EQU 0x001a       ; Timer/Counter3 Capture Event Interrupt
T3COMPaddr       EQU 0x001c       ; Timer/Counter3 Compare Match Interrupt
T3OVFaddr       EQU 0x001e       ; Timer/Counter3 Overflow Interrupt
T4CAPaddr       EQU 0x0020       ; Timer/Counter4 Capture Event Interrupt
T4COMPaddr       EQU 0x0022       ; Timer/Counter4 Compare Match Interrupt
T4OVFaddr       EQU 0x0024       ; Timer/Counter4 Overflow Interrupt
T5COMPaddr       EQU 0x0026       ; Timer/Counter5 Compare Match Interrupt
T5OVFaddr       EQU 0x0028       ; Timer/Counter5 Overflow Interrupt
SPIaddr       EQU 0x002a       ; SPI Serial Transfer Complete Interrupt
SRX_FIFOaddr       EQU 0x002c       ; SPI Rx Buffer Interrupt
STX_FIFOaddr       EQU 0x002e       ; SPI Tx Buffer Interrupt
SSMaddr       EQU 0x0030       ; Sequencer State Machine Interrupt
DFFLRaddr       EQU 0x0032       ; Data FIFO fill level reached Interrupt
DFOUEaddr       EQU 0x0034       ; Data FIFO overflow or underflow error Interrupt
SFFLRaddr       EQU 0x0036       ; RSSI/Preamble FIFO fill level reached Interrupt
SFOUEaddr       EQU 0x0038       ; RSSI/Preamble FIFO overflow or underflow error Interrupt
TMTCFaddr       EQU 0x003a       ; Tx Modulator Telegram Finish Interrupt
AESaddr       EQU 0x003c       ; AES Krypto Unit Interrupt
TPINTaddr       EQU 0x003e       ; Transponder Mode Interrupt
TPTOERRaddr       EQU 0x0040       ; Transponder Timeout Error Interrupt
LFID0INTaddr       EQU 0x0042       ; LF receiver Identifier 0 Interrupt
LFID1INTaddr       EQU 0x0044       ; LF receiver Identifier 1 Interrupt
LFFEINTaddr       EQU 0x0046       ; LF receiver Frame End Interrupt
LFBCRaddr       EQU 0x0048       ; LF receiver Bit Count Reached Interrupt
LFPBDaddr       EQU 0x004a       ; LF receiver PreBurst Detected Interrupt
LFDEaddr       EQU 0x004c       ; LF receiver Decoder Error Interrupt
LFEOTaddr       EQU 0x004e       ; LF receiver End of Telegram Interrupt
LFTCORaddr       EQU 0x0050       ; LF receiver Timer Compare Match Interrupt
LFRSCOaddr       EQU 0x0052       ; LF receiver RSSI measurement Interrupt
LDFFLRaddr       EQU 0x0054       ; LF Data FIFO Fill Level Reached Interrupt
LDFOUEaddr       EQU 0x0056       ; LF Data FIFO Overflow or Underflow Error Interrupt
EXCMaddr       EQU 0x0058       ; External input Clock monitoring Interrupt
E2CINTaddr       EQU 0x005a       ; EEPROM Error Correction Interrupt
ERDYaddr       EQU 0x005c       ; EEPROM Ready Interrupt
SPMRaddr       EQU 0x005e       ; Store Program Memory Ready
TWI1addr       EQU 0x0060       ; TWI1 Interrupt
SPI2addr       EQU 0x0062       ; SPI2 Interrupt
TWI2addr       EQU 0x0064       ; TWI2 Interrupt
INT_VECTORS_SIZE       EQU 102       ; size in words
#endif /* _REGDEF_INC_ */
; ***** END OF FILE ******************************************************
